{
    "ability name, no caps at all, with space if two words": {
        "name": "name of ability, with caps here please",
        "description": "the official description that is used in games, use capital letter and full stop",
        "effect": "bulbapedia's insight on the actual effect - you'll need to do this manually i guess - also caps and full stop please"
    },
    "adaptability": {
        "name": "Adaptability",
        "description": "Powers up moves of the same type as the Pokémon.",
        "effect": "In battle\r\nAdaptability increases STAB from 1.5× to 2×.\r\n\r\nOutside of battle\r\nAdaptability has no effect outside of battle."
    },
    "aerilate": {
        "name": "Aerilate",
        "description": "Normal-type moves become Flying-type moves. The power of those moves is boosted a little.",
        "effect": "In battle\r\nGeneration VI\r\nAerilate causes all Normal-type moves used by the Pokémon to become Flying-type and receive a 30% power boost.\r\n\r\nGeneration VII\r\nAffected moves now receive a 20% power boost.\r\n\r\nOutside of battle\r\nAerilate has no effect outside of battle."
    },
    "aftermath": {
        "name": "Aftermath",
        "description": "Damages the attacker if it contacts the Pokémon with a finishing hit.",
        "effect": "In battle\r\nWhen a Pokémon with this Ability faints due to damage from a move that makes contact, the attacking Pokémon takes damage equal to ¼ of its own maximum HP. This Ability will not activate if a Pokémon with Damp is on the field.\r\n\r\nOutside of battle\r\nAftermath has no effect outside of battle."
    },
    "air lock": {
        "name": "Air Lock",
        "description": "Eliminates the effects of weather.",
        "effect": "In battle\r\nWhen a Pokémon with Air Lock is in battle, all effects of weather are negated (though the weather itself does not disappear).\r\n\r\nGeneration V\r\nWhen a Pokémon with Air Lock is brought out, the message \"The effects of weather disappeared.\" will be displayed after the Ability is announced.\r\n\r\nGeneration VI\r\nDuring extremely harsh sunlight, heavy rain, and a mysterious air current, even if a Pokémon is negating the effects of weather with Air Lock, the moves Sunny Day, Rain Dance, Sandstorm, and Hail will still fail if used, and the Abilities Drought, Drizzle, Sand Stream, and Snow Warning will still fail to activate. However, all other effects of these weather conditions are negated by Air Lock.\r\n\r\nOutside of battle\r\nAir Lock has no effect outside of battle."
    },
    "analytic": {
        "name": "Analytic",
        "description": "Boosts move power when the Pokémon moves last.",
        "effect": "In battle\r\nIf a Pokémon with Analytic executes its move after the Pokémon it originally targeted has already acted this turn, the power of its move is increased by 30%. Using a move and switching to another Pokémon count as having acted, while Mega Evolving, shifting, or the charging phase of Focus Punch do not.\r\n\r\nIn a Triple Battle, this means that if the Pokémon with Analytic is targeting a Pokémon in a flank position that chooses to switch with its ally in the middle, its move's power will always be normal when it attacks the Pokémon that is shifted into the flank position; but if the Pokémon with Analytic targets a Pokémon in the middle whose ally on a flank chooses to shift into the middle position, its move's power still depends on whether the Pokémon that was in the middle (and is now on a flank) has acted when the Pokémon with Analytic uses its move.\r\n\r\nOutside of battle\r\nAnalytic has no effect outside of battle."
    },
    "anger point": {
        "name": "Anger Point",
        "description": "The Pokémon is angered when it takes a critical hit, and that maxes its Attack stat.",
        "effect": "In battle\r\nGeneration IV\r\nWhen a Pokémon with this Ability is hit by a critical hit, Anger Point maximizes its Attack stat by raising it to +6 stages (regardless of its current stage).\r\n\r\nAnger Point will activate even if the Pokémon's substitute is hit.\r\n\r\nGeneration V onward\r\nAnger Point no longer activates if the Pokémon's substitute is hit.\r\n\r\nOutside of battle\r\nAnger Point has no effect outside of battle."
    },
    "anticipation": {
        "name": "Anticipation",
        "description": "The Pokémon can sense an opposing Pokémon's dangerous moves.",
        "effect": "In battle\r\nGeneration IV\r\nWhen a Pokémon with Anticipation enters the battle or a Pokémon gains the Ability Anticipation, it causes the Pokémon to \"shudder\" if any opponent has a damaging move that is super effective against the Pokémon with Anticipation, a one-hit knockout move, or Selfdestruct or Explosion.\r\n\r\nHidden Power, Judgment, Weather Ball, and Natural Gift are treated as Normal-type moves. Counter, Metal Burst, and Mirror Coat do not trigger Anticipation.\r\n\r\nGeneration V\r\nThe moves Selfdestruct and Explosion are now treated like all other Normal-type moves, and thus no longer trigger Anticipation.\r\n\r\nCounter, Metal Burst, and Mirror Coat are counted as attacking moves of their types, so can trigger Anticipation. Techno Blast is treated as a Normal-type move.\r\n\r\nGeneration VI onward\r\nHidden Power is now treated as its effective type rather than Normal-type. Revelation Dance and Multi-Attack are treated as Normal-type moves.\r\n\r\nNormal-type moves (including Self-Destruct and Explosion) can trigger Anticipation in Inverse Battles, if the Pokémon is weak to Normal-type moves.\r\n\r\nAnticipation ignores a mysterious air current.\r\n\r\nOutside of battle\r\nAnticipation has no effect outside of battle."
    },
    "arena trap": {
        "name": "Arena Trap",
        "description": "Prevents opposing Pokémon from fleeing.",
        "effect": "In battle\r\nArena Trap prevents all grounded foes from fleeing (including Teleport) or switching out as long as the user remains in battle.\r\n\r\nUsing Baton Pass, U-turn, Volt Switch, or Parting Shot will still cause the Pokémon to switch out. Holding a Shed Shell allows the Pokémon to switch out, but not flee or Teleport. Having the Ability Run Away or holding a Smoke Ball allows the Pokémon to flee or Teleport, but not switch.\r\n\r\nIf a wild Pokémon has Arena Trap and the player's Pokémon faints, if the player attempts to flee instead of sending out another Pokémon, they are unaffected by Arena Trap.\r\n\r\nArena Trap does not affect allies.\r\n\r\nGeneration VI\r\nGhost-type Pokémon are now immune to Arena Trap."
    },
    "aroma veil": {
        "name": "Aroma Veil",
        "description": "Protects itself and its allies from attacks that limit their move choices.",
        "effect": "In battle\r\nAroma Veil prevents the Pokémon with this Ability and its allies (including non-adjacent allies) from being afflicted by Taunt, Torment, Encore, Disable and Cursed Body, Heal Block, and infatuation.\r\n\r\nWhen a Pokémon with Mold Breaker, Turboblaze or Teravolt uses a move, the effects of Aroma Veil (including allies') are ignored for the duration of that move. As such, if the move of a Pokémon with one of these Abilities triggers Cursed Body, Cute Charm or a Destiny Knot, it will not be protected by Aroma Veil; likewise, if its own Destiny Knot is activated during that attack (such as in response to the attack target's Cute Charm), that target will not be protected by its allies' Aroma Veil.\r\n\r\nOutside of battle\r\nIt is unknown if Aroma Veil has an effect outside of battle."
    },
    "aura break": {
        "name": "Aura Break",
        "description": "The effects of \"Aura\" Abilities are reversed to lower the power of affected moves.",
        "effect": "In battle\r\nAura Break inverts the effects of Fairy Aura and Dark Aura: instead of multiplying the power of Fairy- or Dark-type moves by those Abilities' normal multiplier of 1.33, the power of moves of that type is divided by 1.33 instead, resulting in approximately a 25% decrease in power as long as both Abilities are active.\r\n\r\nEven if a Pokémon with Mold Breaker, Teravolt, or Turboblaze uses a Fairy- or Dark-type move, the effect of Aura Break still applies.\r\n\r\nOutside of battle\r\nZygarde with the Ability Aura Break can be separated back into Cores and Cells.\r\n\r\nZygarde cannot switch between Abilities using an Ability Capsule."
    },
    "bad dreams": {
        "name": "Bad Dreams",
        "description": "Reduces the HP of sleeping opposing Pokémon.",
        "effect": "In battle\r\nAt the end of each turn, each adjacent sleeping opponent takes damage equal to 1/8 of its maximum HP.\r\n\r\nBad Dreams inflicts damage after a Pokémon that is drowsy due to Yawn falls asleep (and thus inflicts damage to a Pokémon the same turn it falls asleep due to drowsiness). Bad Dreams applies after a Pokémon has the opportunity to be woken up by Hydration, Shed Skin, or Healer.\r\n\r\nOutside of battle\r\nBad Dreams has no effect outside of battle.\r\n"
    },
    "battery": {
        "name": "Battery",
        "description": "Powers up ally Pokémon's special moves.",
        "effect": "In battle\r\nThis Ability raises the power of allies' special moves by 30%.\r\n\r\nOutside of battle\r\nBattery has no effect outside of battle."
    },
    "battle armor": {
        "name": "Battle Armor",
        "description": "Hard armor protects the Pokémon from critical hits.",
        "effect": "In battle\r\nBattle Armor prevents the opponent from landing a critical hit.\r\n\r\nOutside of battle\r\nBattle Armor has no effect outside of battle."
    },
    "battle bond": {
        "name": "Battle Bond",
        "description": "Defeating an opposing Pokémon strengthens the Pokémon's bond with its Trainer, and it becomes Ash-Greninja. Water Shuriken gets more powerful.",
        "effect": "In battle\r\nWhen a Greninja with Battle Bond directly causes another Pokémon (including allies) to faint by using a damaging move, unless this ends the battle, it will change into Ash-Greninja. After the battle, the Pokémon reverts to its original form.\r\n\r\nAsh-Greninja has higher base stats than regular Greninja. If Ash-Greninja uses Water Shuriken, the move's power becomes 20 (rather than the usual 15) and it always hits three times. If a Pokémon transforms into Ash-Greninja, Battle Bond does not affect the transformed Pokémon's use of Water Shuriken.\r\n\r\nMultiple Greninja can activate this Ability during the same battle. If Ash-Greninja faints in battle, it will revert to its original form, and that Greninja cannot change into Ash-Greninja again during the same battle even after being revived.\r\n\r\nGastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has Battle Bond. Role Play and Skill Swap fail if either Pokémon has Battle Bond. Battle Bond cannot be copied by Trace, Power of Alchemy, or Receiver. Battle Bond cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Greninja obtains Battle Bond with Imposter or Transform, the Pokémon cannot change form into Ash-Greninja even if it knocks out another Pokémon.\r\n\r\nOutside of battle\r\nGreninja with this Ability cannot breed nor be used in the Battle Spot if Special Pokémon are banned. However, it can be used in the Battle Tree."
    },
    "beast boost": {
        "name": "Beast Boost",
        "description": "The Pokémon boosts its most proficient stat each time it knocks out a Pokémon.",
        "effect": "In battle\r\nWhen a Pokémon with Beast Boost directly causes another Pokémon (including allies) to faint by using a damaging move, its highest stat (other than HP) is increased by one stage. If this stat is already at +6 stages, Beast Boost will not activate (not even in the case of a tie of two or more stats).\r\n\r\nFor determining the highest stat, Beast Boost does not take into account stat stages, held items, or reductions due to status conditions; however, it does consider the effects of Power Split, Guard Split, Power Trick, Wonder Room, and Speed Swap. In the case of a tie between multiple stats, it increases one stat, prioritized in this order: Attack, Defense, Special Attack, Special Defense, and Speed.\r\n\r\nIf the Pokémon fainting ends the battle, Beast Boost will not activate. Beast Boost activates after the Pokémon gains Attack from Fell Stinger. If a Pokémon with Beast Boost defeats a Pokémon with Mummy using a contact move, the Pokémon's Ability will become Mummy before Beast Boost has the opportunity to activate.\r\n\r\nOutside of battle\r\nBeast Boost has no effect outside of battle."
    },
    "berserk": {
        "name": "Berserk",
        "description": "Boosts the Pokémon's Sp. Atk stat when it takes a hit that causes its HP to become half or less.",
        "effect": "In battle\r\nEvery time the HP of a Pokémon with Berserk drops below half, its Special Attack is raised by one stage. If the HP falls below half due to indirect damage, such as one caused by Leech Seed, status conditions or weather, Berserk won't activate.\r\n\r\nOutside of battle\r\nBerserk has no effect outside of battle."
    },
    "big pecks": {
        "name": "Big Pecks",
        "description": "Protects the Pokémon from Defense-lowering effects.",
        "effect": "In battle\r\nBig Pecks prevents other Pokémon from lowering the Defense stat stage of the Pokémon with this Ability. It does not prevent the Pokémon with this Ability from lowering its own Defense, such as by using Shell Smash.\r\n\r\nEffects that decrease Defense without using stat stages, such as Guard Swap, Heart Swap, or Guard Split, are unaffected by Big Pecks.\r\n\r\nThis Ability can be ignored with Mold Breaker, Teravolt, and Turboblaze."
    },
    "blaze": {
        "name": "Blaze",
        "description": "Powers up Fire-type moves when the Pokémon's HP is low.",
        "effect": "In battle\r\nGenerations III to IV\r\nWhen a Pokémon with Blaze uses a Fire-type move, the move's power will be increased by 50% if the user has less than or equal to ⅓ of its maximum HP remaining.\r\n\r\nGenerations V onwards\r\nInstead of boosting Fire-type moves' power, Blaze now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Fire-type move is being used, resulting in effectively the same effect.\r\n\r\nOutside of battle\r\nBlaze has no effect outside of battle."
    },
    "bulletproof": {
        "name": "Bulletproof",
        "description": "Protects the Pokémon from some ball and bomb moves.",
        "effect": "In battle\r\nPokémon with Bulletproof are not affected by ball and bomb moves, as well as some cannon-based and blast-based attacks.\r\n\r\nOutside of battle\r\nBulletproof has no effect outside of battle."
    },
    "cheek pouch": {
        "name": "Cheek Pouch",
        "description": "Restores HP as well when the Pokémon eats a Berry.",
        "effect": "In battle\r\nCheek Pouch restores 33% of the Pokémon's maximum HP when it consumes a Berry, after the effect of the Berry is applied.\r\n\r\nCheek Pouch activates even if the Pokémon eats another Pokémon's held Berry via Bug Bite, Pluck or Fling, but only if the Berry is actually eaten for an effect (i.e. the Berry consumption animation plays). Consuming a Berry through other means (such as Natural Gift, using Fling, or its Trainer giving it a Berry from the Bag) will not trigger Cheek Pouch.\r\n\r\nCheek Pouch will not activate if the Pokémon is under the effect of Heal Block.\r\n\r\nOutside of battle\r\nIt is unknown if Cheek Pouch has an effect outside of battle."
    },
    "chlorophyll": {
        "name": "Chlorophyll",
        "description": "Boosts the Pokémon's Speed stat in harsh sunlight.",
        "effect": "In battle\r\nDuring harsh sunlight, the Speed stat of Pokémon with this Ability is doubled.\r\n\r\nOutside of battle\r\nChlorophyll has no effect outside of battle."
    },
    "clear body": {
        "name": "Clear Body",
        "description": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
        "effect": "In battle\r\nClear Body prevents stat reduction caused by other Pokémon's moves and Abilities (such as Scary Face and Intimidate), including Sticky Web. Clear Body does not prevent self-inflicted stat reductions such as from moves like Superpower or Hammer Arm.\r\n\r\nClear Body only protects from effects that lower stat stages, so it does not prevent stat reduction from items like the Iron Ball, the status conditions paralysis or burn, or the moves Guard Split or Power Split. Clear Body does not prevent stat stages being directly modified by Heart Swap, Guard Swap, Power Swap, Baton Pass, or Topsy-Turvy.\r\n\r\nThis Ability is ignored by Pokémon with Mold Breaker, Teravolt, and Turboblaze.\r\n\r\nOutside of battle\r\nClear Body has no effect outside of battle."
    },
    "cloud nine": {
        "name": "Cloud Nine",
        "description": "Eliminates the effects of weather.\r\n",
        "effect": "In battle\r\nWhen a Pokémon with Cloud Nine is in battle, all effects of weather are negated (though the weather itself does not disappear).\r\n\r\nGeneration V\r\nWhen a Pokémon with Cloud Nine is brought out, the message \"The effects of weather disappeared.\" will be displayed.\r\n\r\nGeneration VI\r\nDuring extremely harsh sunlight, heavy rain, and a mysterious air current, even if a Pokémon is negating the effects of weather with Cloud Nine, the moves Sunny Day, Rain Dance, Sandstorm, and Hail will still fail if used, and the Abilities Drought, Drizzle, Sand Stream, and Snow Warning will still fail to activate. However, all other effects of these weather conditions are negated by Cloud Nine.\r\n\r\nOutside of battle\r\nCloud Nine has no effect outside of battle."
    },
    "color change": {
        "name": "Color Change",
        "description": "The Pokémon's type becomes the type of the move used on it.",
        "effect": "In battle\r\nGenerations III and IV\r\nWhen a Pokémon with this Ability is hit by a damage-dealing move (except Struggle and Shadow moves), Color Change will change the Pokémon's own type to the type of the move that it was hit by. Color Change does not activate if the Pokémon's substitute is hit.\r\n\r\nEven if the Pokémon with Color Change has two types, it will only have a single type after the effect is applied. If a Pokémon with this Ability is hit by Weather Ball during shadowy aura, it will become Normal-type.\r\n\r\nColor Change will activate after the first hit of a multi-strike move. Future Sight and Doom Desire do not activate Color Change.\r\n\r\nStatus conditions are inflicted before Color Change activates. As a result, even if Color Change would make the Pokémon become a type that is immune to the status condition, the Pokémon can still be afflicted with the status condition; for example, a Pokémon with Color Change that is hit by Poison Sting has a chance to be poisoned before it becomes Poison-type.\r\n\r\nGeneration V onward\r\nColor Change now activates after the last hit of a multi-strike move.\r\n\r\nFuture Sight and Doom Desire now activate Color Change when they hit (they do not activate Color Change when used).\r\n\r\nColor Change will not activate when the Pokémon is hit by a typeless Revelation Dance.\r\n\r\nOutside of battle\r\nColor Change has no effect outside of battle."
    },
    "comatose": {
        "name": "Comatose",
        "description": "It's always drowsing and will never wake up. It can attack without waking up.",
        "effect": "In battle\r\nComatose makes the user act as if it were asleep, without inflicting the status; the Pokémon with this Ability can still use moves (including successfully using Sleep Talk and Snore). It cannot be afflicted with non-volatile status conditions or become drowsy due to Yawn. The Pokémon with this Ability takes double damage from Hex and Wake-Up Slap; can be affected by Dream Eater, Nightmare, and Bad Dreams; and cannot successfully use Rest.\r\n\r\nComatose is unaffected by effects that prevent sleep (such as Uproar, Electric Terrain and Sweet Veil). Comatose is unaffected by Mold Breaker, Turboblaze and Teravolt. A Pokémon with Poison Touch using Sunsteel Strike cannot poison a target that has Comatose.\r\n\r\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability Comatose. Skill Swap fails if either Pokémon has Comatose. Comatose cannot be copied by Trace, Power of Alchemy, or Receiver. Comatose cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon that has its Ability suppressed passes that effect to a Pokémon with Comatose via Baton Pass, that effect fades. If a Pokémon that already has its Ability suppressed obtains Comatose with Transform, Comatose's effects are suppressed (i.e. the Pokémon will not be protected from status conditions, is not treated as asleep for effects such as Sleep Talk, etc.).\r\n\r\nIf a Pokémon that already has a status condition gains Comatose (i.e. due to Transform or Imposter), it will not be cured of its status condition. If the Pokémon was asleep, the status has its normal effect, unaffected by Comatose.\r\n\r\nOutside of battle\r\nComatose has no effect outside of battle."
    },
    "competitive": {
        "name": "Competitive",
        "description": "Boosts the Sp. Atk stat sharply when a stat is lowered.",
        "effect": "In battle\r\nWhen a stat of a Pokémon with this Ability is lowered by an opponent, its Special Attack is increased by two stages. Competitive will not activate if the Pokémon with this Ability lowers its own stats (such as with Close Combat) or if its stats are lowered by an ally.\r\n\r\nIf multiple stats are lowered (such as by Memento or Venom Drench) Competitive activates for each stat lowered.\r\n\r\nIf the Pokémon with this Ability is holding a White Herb, if a stat other than Special Attack is lowered, Competitive will trigger before the White Herb, so the user will receive the Special Attack boost and then the lowered stat will be restored. If its Special Attack is lowered, Competitive will activate first, increasing its Special Attack so that the White Herb cannot activate.\r\n\r\nOutside of battle\r\nCompetitive has no effect outside of battle."
    },
    "compound eyes": {
        "name": "Compound Eyes",
        "description": "The Pokémon's compound eyes boost its accuracy.",
        "effect": "In battle\r\nCompound Eyes raises accuracy by 30% of a move's original accuracy in battles. This means that Thunder, for example, has 91% accuracy as opposed to the usual 70% (70 x 1.3 = 91%). A move with a theoretical accuracy of 77% or higher will have its accuracy set to 100% (77% x 1.3 = 100.1%).\r\n\r\nOutside of battle\r\nIn Pokémon Emerald and all games since Generation IV, if a Pokémon with this Ability leads the party (even if fainted), the chances of finding a wild Pokémon holding an item increase from 50%/5% to 60%/20%. In dark grass in Generation V, the chances increase from 50%/5%/1% to 60%/20%/5%."
    },
    "contrary": {
        "name": "Contrary",
        "description": "Makes stat changes have an opposite effect.",
        "effect": "In battle\r\nThis Ability inverts all changes to the stat stages of a Pokémon with this Ability; if an effect would lower a stat, it is increased instead, and if an effect would increase a stat, it is decreased instead. Effects that change a Pokémon's stats without affecting stat stages, such as burn and paralysis, are not affected by Contrary.\r\n\r\nThis also applies to self-inflicted changes, such as Curse and Leaf Storm. This Ability only inverts the changes when they are applied; it does not passively cause all existing changes to reverse; therefore, if the Ability Contrary is no longer in effect or the stats are passed by Baton Pass, all existing stat stage changes remain the same. Stats passed by Baton Pass onto a Pokémon with Contrary are not reversed.\r\n\r\nStat stage increases caused by the Z-Power effects of status Z-Moves are not inverted by Contrary. However, the stat stage increases as a result of Extreme Evoboost are inverted.\r\n\r\nMist (including from Guard Spec.) and Flower Veil take into account Contrary's inversion before determining whether to block the stat change. For example, if a Pokémon with Contrary is targeted by String Shot while protected by Mist, it will gain Speed; if a Pokémon with Contrary is targeted by Swagger while protected by Mist, its Attack will not be changed.\r\n\r\nIf a Pokémon with Contrary uses Belly Drum, its Attack will be lowered to -6 stages (although the message will still say that the user maximized its Attack); if the user's Attack is already at -6 stages, Belly Drum will still deduct HP. Even if the user has Contrary, Belly Drum fails if the user's Attack is already at +6.\r\n\r\nIf a move used by a Pokémon with Mold Breaker, Teravolt, or Turboblaze would change a stat stage of a Pokémon with Contrary, the change will not be inverted.\r\n\r\nOutside of battle\r\nContrary has no effect outside of battle."
    },
    "corrosion": {
        "name": "Corrosion",
        "description": "The Pokémon can poison the target even if it's a Steel or Poison type.",
        "effect": "In battle\r\nCorrosion allows the user to inflict poison on any Pokémon regardless of type, allowing them to poison Poison and Steel-type Pokémon.\r\n\r\nIf a Poison- or Steel-type Pokémon with Corrosion holds a Toxic Orb, it will badly poison itself. A Pokémon with Corrosion can poison Poison- and Steel-type Pokémon if it uses Fling while holding a Toxic Orb or a Poison Barb.\r\n\r\nThis Ability has no effect on Toxic Spikes. It does not allow the Pokémon with this Ability to poison a Pokémon with Immunity. Corrosion does not allow the Pokémon with this Ability to damage Steel-type Pokémon with Poison-type moves.\r\n\r\nIf the Pokémon with this Ability uses a move, and that move gets reflected by the target due to Magic Coat or Magic Bounce, the reflected move will not be able to poison Steel- or Poison-type Pokémon. If a Poison- or Steel-type Pokémon with this Ability poisons a target with Synchronize, Synchronize will not be able to affect the Pokémon with this Ability.\r\n\r\nOutside of battle\r\nCorrosion has no effect outside of battle."
    },
    "cursed body": {
        "name": "Cursed Body",
        "description": "May disable a move used on the Pokémon.",
        "effect": "In battle\r\nWhen a Pokémon with this Ability is hit by a damaging move, there is a 30% chance that the Cursed Body will disable that move of the attacking Pokémon for 4 turns (including the turn Cursed Body activates). Cursed Body can activate even if the attacker is behind a substitute or if the Pokémon with Cursed Body is knocked out, but will not activate if the attack hits the substitute of the Pokémon with Cursed Body.\r\n\r\nIf Cursed Body disables a multi-strike move before it has finished all of its hits, it will not prevent the other hits from being executed. Cursed Body can disable a move that calls another move if the called move dealt damage.\r\n\r\nIf a Pokémon uses a damaging Z-Move on a Pokémon with Cursed Body, that damaging Z-Move can be disabled (with no effect on the base move), despite Z-Moves only being able to be used once per battle. However, if Cursed Body would disable a status Z-Move (such as Z-Nature Power), the base status move will be disabled.\r\n\r\nOutside of battle\r\nCursed Body has no effect outside of battle."
    },
    "cute charm": {
        "name": "Cute Charm",
        "description": "Contact with the Pokémon may cause infatuation.",
        "effect": "In battle\r\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become infatuated if it is of the opposite gender to the Pokémon with this Ability. This Ability will not activate if the Pokémon with this Ability is genderless.\r\n\r\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\r\n\r\nOutside of battle\r\nFrom Pokémon Emerald onwards, if a Pokémon with Cute Charm is in the first place in the party (even if fainted), there is a 66.7% chance that the game will force an encountered Pokémon to be the opposite gender from the Pokémon with Cute Charm if it can be that gender. This does not affect a swarming Pokémon species or Pokémon found in Hidden Grottos.\r\n\r\nEffects on personality value\r\nIn Generation IV only, when Cute Charm forces a Pokémon to be a specific gender, it does so by setting its personality value to one out of 25 possible values that correspond to the forced gender (one value per nature). The set of possible values depends on the gender of the Pokémon with Cute Charm, and, if the Pokémon with Cute Charm is female, the wild Pokémon's gender ratio. This has significant consequences for properties determined by personality value.\r\n\r\nAs a result, when the encountered species can be affected by Cute Charm (i.e., when it is not a male-only, female-only, or genderless species), the chances of encountering a Shiny Pokémon differ from the usual 1/8192, depending on how many of the 25 possible values forced by Cute Charm result in a Shiny Pokémon (in conjunction with the Trainer ID number and Secret ID): they may be as low as 1/24546 (if none of the 25 values forced by Cute Charm result in Shiny Pokémon, so the Pokémon can only be Shiny if Cute Charm fails), or as high as 21.34% (if 8 out of the 25 values forced by Cute Charm result in Shiny Pokémon).\r\n\r\nAdditionally, Spinda whose gender has been forced by Cute Charm in Generation IV only have one of 50 patterns (25 for male, 25 for female)."
    },
    "damp": {
        "name": "Damp",
        "description": "Prevents the use of explosive moves such as Self-Destruct by dampening its surroundings.",
        "effect": "In battle\r\nDamp prevents all Pokémon from using Self-Destruct, Explosion, and Mind Blown; if a Pokémon attempts to use one of these moves, it will fail and the user will not faint or take damage. Additionally, Damp prevents the Ability Aftermath from doing damage when the Pokémon with Aftermath faints.\r\n\r\nDamp affects non-adjacent Pokémon in Triple Battles.\r\n\r\nOutside of battle\r\nDamp has no effect outside of battle.\r\n\r\nPokémon Mystery Dungeon\r\nBlast Seed becomes ineffective in the presence of a Pokémon with Damp."
    },
    "dancer": {
        "name": "Dancer",
        "description": "When another Pokémon uses a dance move, it can use a dance move following it regardless of its Speed.",
        "effect": "In battle\r\nWhenever another Pokémon uses a dance move, a Pokémon with the Ability Dancer will immediately use that move as well. Using a move through Dancer is a separate action to using the move originally selected. Dancer will not activate for a move copied by another Pokémon with Dancer, but it will activate on an instructed dance move.\r\n\r\nDancer is able to copy a status dance move that has been powered up into its corresponding Z-Move (e.g. Z-Feather Dance), but the Pokémon with Dancer copies the regular version of the move and does not gain the additional Z-Power effect.\r\n\r\nDancer will not activate if the move's animation does not play (assuming battle animations are on): if all of the move's targets are protected from it, the move fails to affect any Pokémon (e.g. Teeter Dance if all of the targets are already confused or have Own Tempo), or all targets are immune (e.g. Electric-type Revelation Dance if the target is Ground-type). Dancer will not activate if the move is stolen by Snatch.\r\n\r\nIf multiple Pokémon have Dancer when a dance move is used, the slowest Pokémon will move first (Lagging Tail and Full Incense are ignored), even during Trick Room.\r\n\r\nIf the Pokémon with Dancer is confused, it may hurt itself instead of copying the move, even if it is protected by a move like Protect or Mat Block. If a Pokémon has flinched, this also applies to moves it subsequently tries to copy with Dancer. A Pokémon with Dancer that is locked into a consecutively executed move (such as Petal Dance) or any move by Encore or a held Choice item will still try to copy the move, but will fail unless it is locked into that same dance move; if a Pokémon uses Petal Dance via Dancer while locked into Petal Dance, this usage does not count towards the 2-3 turn duration. If a Pokémon with Dancer is holding an Assault Vest, it can still successfully copy status dance moves.\r\n\r\nLunar Dance is copied after the original user faints. If a Pokémon copies Petal Dance via Dancer, it will not be locked into the move. If Feather Dance is reflected by Magic Bounce or Magic Coat, Dancer will not activate for either the initial usage of the move or its reflected use. If the Pokémon with Dancer is under the effect of Taunt, it will still try to copy a status dance move, but will fail.\r\n\r\nMoves used via Dancer can be stolen by Snatch and reflected by Magic Bounce and Magic Coat. Moves used via Dancer are not considered the move used most recently (such as for the purpose of Instruct, Mimic or Mirror Move), but damage dealt by them is considered for the purpose of Mirror Coat and Metal Burst.\r\n\r\nOutside of battle\r\nDancer has no effect outside of battle."
    },
    "dark aura": {
        "name": "Dark Aura",
        "description": "Powers up each Pokémon's Dark-type moves.",
        "effect": "In battle\r\nDark Aura increases the damage dealt by Dark-type attacks by 33% for all Pokémon on the field. This effect is inverted by Aura Break, instead dividing the power of Dark-type attacks by 1.33, resulting in approximately a 25% reduction in damage.\r\n\r\nThe effects will not stack multiple times if more than one Pokémon has this Ability.\r\n\r\nOutside of battle\r\nDark Aura has no effect outside of battle."
    },
    "dazzling": {
        "name": "Dazzling",
        "description": "Surprises the opposing Pokémon, making it unable to attack using priority moves.",
        "effect": "In battle\r\nIf an opponent uses a priority move (including moves boosted by Prankster, Gale Wings or Triage) that targets the Pokémon with Dazzling or its allies, Dazzling prevents the Pokémon from executing that move (PP is still consumed). When this occurs, the text \"[Pokémon] cannot use [Move]!\" is displayed.\r\n\r\nMoves that target all Pokémon (except Perish Song, Flower Shield, and Rototiller) and moves that target all foes cannot be blocked by Dazzling even if they become priority moves. Dazzling has no effect on allies' priority moves.\r\n\r\nPriority status Z-Moves will have their Z-Power effect activate. For example, if a Pokémon with Prankster uses Z-Will-O-Wisp, it will get the Attack boost, but will not burn the target.\r\n\r\nMold Breaker will ignore this Ability.\r\n\r\nOutside of battle\r\nDazzling has no effect outside of battle."
    },
    "defeatist": {
        "name": "Defeatist",
        "description": "Halves the Pokémon's Attack and Sp. Atk stats when its HP becomes half or less.",
        "effect": "In battle\r\nDefeatist halves the user's Attack and Special Attack stats when its HP is equal to or less than half of its maximum.\r\n\r\nOutside of battle\r\nDefeatist has no effect outside of battle."
    },
    "defiant": {
        "name": "Defiant",
        "description": "Boosts the Pokémon's Attack stat sharply when its stats are lowered.",
        "effect": "In battle\r\nWhen a stat of a Pokémon with this Ability is lowered by an opponent, its Attack is increased by two stages. Defiant will not activate if the Pokémon with this Ability lowers its own stats (such as with Close Combat) or if its stats are lowered by an ally.\r\n\r\nIf multiple stats are lowered (such as by Memento or Venom Drench), Defiant activates for each stat lowered.\r\n\r\nIf the Pokémon with this Ability is holding a White Herb, if a stat other than Attack is lowered, Defiant will trigger before the White Herb, so the user will receive the Attack boost and then the lowered stat will be restored. If its Attack is lowered, Defiant will activate first, increasing its Attack so that the White Herb cannot activate.\r\n\r\nOutside of battle\r\nDefiant has no effect outside of battle."
    },
    "delta stream": {
        "name": "Delta Stream",
        "description": "The Pokémon changes the weather to eliminate all of the Flying type's weaknesses.",
        "effect": "In battle\r\nWhen a Pokémon with Delta Stream enters the battle or a Pokémon gains the Ability, a unique weather condition called mysterious air current is created. In a Rotation Battle, Delta Stream will not activate if the Pokémon is sent out in a rotated-out position, nor will it activate if the Pokémon is rotated in. In addition, Delta Stream will not activate if a mysterious air current is already present on the battlefield or if the Pokémon's Ability is suppressed prior to it gaining Delta Stream.\r\n\r\nA mysterious air current causes moves that would be super effective against pure Flying-type Pokémon to instead deal neutral damage to all Flying-type Pokémon (unless a Pokémon on the field has the Air Lock or Cloud Nine Ability). Outside of Inverse Battles, this causes Electric-, Ice-, and Rock-type moves to deal neutral damage to Flying-type Pokémon; during Inverse Battles, this causes Bug-, Fighting-, Grass-, and Ground-type moves to deal neutral damage to Flying-type Pokémon. If a move is not super effective against the Pokémon's other type (for dual-typed Pokémon), this no longer counts as a super-effective hit (for the purposes of damage-reducing Berries, etc.). A mysterious air current has no effect on Stealth Rock or Anticipation.\r\n\r\nAdditionally, a mysterious air current causes the weather-modifying moves Sunny Day, Rain Dance, Sandstorm, and Hail to fail if used; and causes the Abilities Drought, Drizzle, Sand Stream, and Snow Warning to fail to activate.\r\n\r\nThe mysterious air current will dissipate if the Pokémon is removed from the field (and no other Pokémon with Delta Stream remain on the field), if the Pokémon is rotated out in a Rotation Battle, if the Pokémon has its Ability suppressed or replaced, or if the Desolate Land or Primordial Sea Ability activates.\r\n\r\nOutside of battle\r\nDelta Stream has no effect outside of battle."
    },
    "desolate land": {
        "name": "Desolate Land",
        "description": "The Pokémon changes the weather to nullify Water-type attacks.",
        "effect": "In battle\r\nWhen a Pokémon with Desolate Land enters the battle or a Pokémon gains the Ability Desolate Land, the Ability creates extremely harsh sunlight, a unique variation of harsh sunlight. In a Rotation Battle, Desolate Land will not activate if the Pokémon is sent out in a rotated-out position, nor will it activate if the Pokémon is rotated in. In addition, Desolate Land will not activate if extremely harsh sunlight is already present on the battlefield.\r\n\r\nAlong with the usual effects of harsh sunlight, extremely harsh sunlight causes damage-dealing Water-type moves to fail (unless a Pokémon on the field has the Air Lock or Cloud Nine Ability). Additionally, extremely harsh sunlight causes the weather-modifying moves Sunny Day, Rain Dance, Sandstorm, and Hail to fail if used; and causes the Abilities Drought, Drizzle, Sand Stream, and Snow Warning to fail to activate.\r\n\r\nThe extremely harsh sunlight will fade if the Pokémon is removed from the field (and no other Pokémon with Desolate Land remain on the field), if the Pokémon is rotated out in a Rotation Battle, if the Pokémon has its Ability suppressed or replaced, or if the Primordial Sea or Delta Stream Ability activates.\r\n\r\nOutside of battle\r\nDesolate Land has no effect outside of battle."
    },
    "disguise": {
        "name": "Disguise",
        "description": "Once per battle, the shroud that covers the Pokémon can protect it from an attack.",
        "effect": "In battle\r\nIf a Mimikyu in its Disguised Form is hit by a damaging attack or hits itself in confusion, Disguise causes it to take no damage. When this effect activates, the message, \"Its disguise served it as a decoy!\" is displayed, Mimikyu changes to its Busted Form, and finally the message, \"<Name>'s disguise was busted!\" is displayed. If Mimikyu's type was changed, it is restored to Ghost/Fairy when it changes to its Busted Form.\r\n\r\nMimikyu remains in Busted Form if it is switched out, but reverts to Disguised Form outside of battle. If a Mimikyu faints and is revived, it will be revived in its Disguised Form and Disguise will be able to activate again.\r\n\r\nDisguise will not protect against entry hazards or weather damage. Disguise activates at the first strike of a multi-strike move such as Water Shuriken and will not block damage from remaining strikes. Disguise only blocks the damage from moves; additional effects of damaging moves like paralysis from Nuzzle are not prevented. If Mimikyu has a substitute, the substitute will take damage before Disguise.\r\n\r\nWeakness Policy will not activate if Disguise negates the damage, because it is treated as a neutral hit. A held Air Balloon will be popped even if the Disguise negates the damage.\r\n\r\nGastro Acid, Worry Seed, and Simple Beam fail if the target has the Ability Disguise. Role Play, Skill Swap, and Entrainment fail if either Pokémon has Disguise. Disguise cannot be copied by Trace, Power of Alchemy, or Receiver. Disguise cannot be replaced by Mummy or suppressed by Core Enforcer; if a Pokémon that has its Ability suppressed passes that effect to a Pokémon with this Ability via Baton Pass, that effect fades. If a Pokémon other than Mimikyu obtains Disguise with Imposter or Transform, the Ability will never activate.\r\n\r\nPokémon with Mold Breaker, Teravolt or Turboblaze will ignore Disguise, hitting through the disguise without busting it. The same is true for the moves Moongeist Beam, Sunsteel Strike, and Photon Geyser as well as the Z-Moves Searing Sunraze Smash, Menacing Moonraze Maelstrom and Light That Burns the Sky.\r\n\r\nOutside of battle\r\nDisguise has no effect outside of battle."
    },
    "download": {
        "name": "Download",
        "description": "Compares an opposing Pokémon's Defense and Sp. Def stats before raising its own Attack or Sp. Atk stat—whichever will be more effective.",
        "effect": "In battle\r\nDownload raises either the Attack stat or Special Attack stat by one stage depending on the foe's lowest current defensive stat: it will raise Attack if the foe's current Defense is lower than its current Special Defense stat, and Special Attack otherwise.\r\n\r\nFor determining which of the foe's defensive stat is lower, Download takes into account stat stages and the effect of Power Trick; however, it does not consider the effects of held items, Abilities such as Marvel Scale, or Wonder Room. In case of a tie between the foe's Defense and Special Defense, Download increases Special Attack.\r\n\r\nDuring a Double Battle, Download will add the two opposing Pokémon's stats and calculate the lower stat between both.\r\n\r\nOutside of battle\r\nDownload has no effect outside of battle."
    },
    "drizzle": {
        "name": "Drizzle",
        "description": "The Pokémon makes it rain when it enters a battle.",
        "effect": "In battle\r\nGenerations III to V\r\nDrizzle summons rain in battle as soon as a Pokémon with Drizzle enters the battle. Its effects are the same as the move Rain Dance, but instead of lasting for a limited amount of turns, it lasts for the whole battle (unless it is replaced by another type of weather). If a Pokémon with Drizzle is sent out in the same turn as another Pokémon whose Ability affects the weather, the slower Pokémon's Ability will override the faster Pokémon's Ability.\r\n\r\nGeneration VI\r\nThe rain now lasts only for five turns. This can be extended to eight turns if the Pokémon is holding a Damp Rock.\r\n\r\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Drizzle will fail to activate.\r\n\r\nOutside of battle\r\nDrizzle has no effect outside of battle."
    },
    "drought": {
        "name": "Drought",
        "description": "Turns the sunlight harsh when the Pokémon enters a battle.",
        "effect": "In battle\r\nGenerations III to V\r\nDrought summons harsh sunlight in battle as soon as a Pokémon with Drought enters the battle. Its effects are the same as the move Sunny Day, but instead of lasting for a limited amount of turns, it lasts for the whole battle (unless it is replaced by another weather condition). If a Pokémon with Drought is sent out in the same turn as another Pokémon whose Ability affects the weather, the slower Pokémon's Ability will override the faster Pokémon's Ability.\r\n\r\nGeneration VI\r\nThe sunlight now lasts only for five turns. This can be extended to eight turns if the Pokémon is holding a Heat Rock.\r\n\r\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Drought will fail to activate.\r\n\r\nOutside of battle\r\nDrought has no effect outside of battle."
    },
    "dry skin": {
        "name": "Dry Skin",
        "description": "Restores HP in rain or when hit by Water-type moves. Reduces HP in harsh sunlight, and increases the damage received from Fire-type moves.",
        "effect": "In battle\r\nDuring harsh sunlight, a Pokémon with Dry Skin will lose ⅛ of its maximum HP at the end of each turn. During rain, a Pokémon with Dry Skin will regain ⅛ of its maximum HP at the end of each turn.\r\n\r\nFire-type attacks do 25% more damage to a Pokémon with Dry Skin.\r\n\r\nWhen a Pokémon with Dry Skin is hit by a Water-type move, its HP is restored by one quarter of its maximum HP, and the move will have no effect on that Pokémon (if a Pokémon with this Ability already has full HP, the Water-type move will do nothing). This effect will not activate if the Pokémon is protected from the Water-type move.\r\n\r\nIf a Pokémon with Dry Skin is holding an Absorb Bulb or Luminous Moss, Dry Skin absorbs the Water-type move so the item's effect is not triggered.\r\n\r\nOutside of battle\r\nDry Skin has no effect outside of battle."
    },
    "early bird": {
        "name": "Early Bird",
        "description": "The Pokémon awakens twice as fast as other Pokémon from sleep.",
        "effect": "In battle\r\nEarly Bird causes quick awakening from sleep. In the turn the Pokémon is put to sleep, the number of turns it will remain asleep is preset. If it is 6 turns, it will be halved to 3. If 3, it will be rounded to 1. If only 1 turn is preset, it is rounded to 0, causing the Pokémon to instantly wake up at the end of the same turn. This also applies to the self-induced sleep from Rest, reducing its length from 3 to 1 turn.\r\n\r\nOutside of battle\r\nEarly Bird has no effect outside of battle."
    },
    "effect spore": {
        "name": "Effect Spore",
        "description": "Contact with the Pokémon may inflict poison, sleep, or paralysis on its attacker.",
        "effect": "In battle\r\nGenerations III to V\r\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become poisoned, paralyzed or asleep: there is a 9% chance of poison, 10% chance of paralysis, and 11% chance of sleep.[1]\r\n\r\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\r\n\r\nGeneration VI onward\r\nGrass-type Pokémon, Pokémon with Overcoat, and Pokémon holding Safety Goggles are now immune to Effect Spore.\r\n\r\nOutside of battle\r\nEffect Spore has no effect outside of battle."
    },
    "electric surge": {
        "name": "Electric Surge",
        "description": "Turns the ground into Electric Terrain when the Pokémon enters a battle.",
        "effect": "In battle\r\nWhen a Pokémon with Electric Surge enters the battle, it creates the effect of the move Electric Terrain on the battlefield.\r\n\r\nOutside of battle\r\nElectric Surge has no effect outside of battle."
    },
    "emergency exit": {
        "name": "Emergency Exit",
        "description": "The Pokémon, sensing danger, switches out when its HP becomes half or less.",
        "effect": "In battle\r\nWhen a Pokémon with Emergency Exit drops below half of its full HP in battle, it will flee in wild battles, or switch out in Trainer battles. It can only activate when a Pokémon's HP falls from above half to below half; if it does not activate at that time, it will not activate at all (unless the Pokémon with this Ability restores HP).\r\n\r\nEmergency Exit will not activate if the Pokémon's HP falls below half due to hurting itself in confusion, hail, sandstorm or using Substitute. This Ability will not activate if the HP of the Pokémon with this Ability is restored to above half immediately after it drops below half (such as due to a held Sitrus Berry).\r\n\r\nEmergency Exit will not activate if the Pokémon's HP falls below half by a move affected by Sheer Force.\r\n\r\nIt will activate only after the last hit of multi-strike moves, even if the HP of the Pokémon with this Ability drops below half before the last hit. If this Ability activates due to being hit by U-turn or Volt Switch, the user of that move will not be switched out. This Ability will not activate if the Pokémon's HP falls below half while it is in the air during the semi-invulnerable turn of Sky Drop.\r\n\r\nTrapping moves do not prevent Emergency Exit from activating.\r\n\r\nIf the Pokémon with Emergency Exit holds a Red Card or Eject Button, the item activates first. Dragon Tail and Circle Throw switch out Pokémon before the Ability activates.\r\n\r\nEmergency Exit will not activate on the player's Pokémon in wild battles during trials.\r\n\r\nOutside of battle\r\nEmergency Exit has no effect outside of battle."
    },
    "fairy aura": {
        "name": "Fairy Aura",
        "description": "Powers up each Pokémon's Fairy-type moves.",
        "effect": "In battle\r\nFairy Aura increases the damage dealt by Fairy-type attacks by 33% for all Pokémon on the field. This effect is inverted by Aura Break, instead dividing the power of Fairy-type attacks by 1.33, resulting in approximately a 25% reduction in damage.\r\n\r\nThe effects will not stack multiple times if more than one Pokémon has this Ability.\r\n\r\nOutside of battle\r\nFairy Aura has no effect outside of battle."
    },
    "filter": {
        "name": "Filter",
        "description": "Reduces the power of supereffective attacks taken.",
        "effect": "In battle\r\nFilter reduces damage from supereffective moves by ¼ (regardless of the effectiveness multiplier).\r\n\r\nOutside of battle\r\nFilter has no effect outside of battle."
    },
    "flame body": {
        "name": "Flame Body",
        "description": "Contact with the Pokémon may burn the attacker.",
        "effect": "In battle\r\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become burned.\r\n\r\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\r\n\r\nOutside of battle\r\nFrom Pokémon Emerald onward, if a Pokémon with Flame Body is in the party (even if fainted), the number of cycles it takes for all Pokémon Eggs in the party to hatch are halved. This effect does not stack with itself or Magma Armor; however, it can be stacked with Hatching Power Pass Power, O-Power, or Roto Hatch."
    },
    "flare boost": {
        "name": "Flare Boost",
        "description": "Powers up special attacks when the Pokémon is burned.",
        "effect": "In battle\r\nWhile the Pokémon with this Ability is burned, the power of its special moves is increased by 50%.\r\n\r\nOutside of battle\r\nFlare Boost has no effect outside of battle."
    },
    "flash fire": {
        "name": "Flash Fire",
        "description": "Powers up the Pokémon's Fire-type moves if it's hit by one.",
        "effect": "In battle\r\nGeneration III\r\nFlash Fire makes the Pokémon immune to Fire-type moves and will activate when hit by one. When activated, the power of the Pokémon's Fire-type moves is increased by 50%. While subsequent hits by Fire-type moves will not provide further increases in power, the Pokémon remains immune to the moves.\r\n\r\nFlash Fire will not activate if the Pokémon is protected from the Fire-type move.\r\n\r\nFlash Fire will not work while the user is frozen.\r\n\r\nGeneration IV\r\nInstead of boosting Fire-type moves' power, Flash Fire now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Fire-type move is being used, resulting in effectively the same effect.\r\n\r\nGeneration V onwards\r\nFlash Fire is now functional even if the user is frozen.\r\n\r\nOutside of battle\r\nFlash Fire has no effect outside of battle."
    },
    "flower gift": {
        "name": "Flower Gift",
        "description": "Boosts the Attack and Sp. Def stats of itself and allies in harsh sunlight.",
        "effect": "In battle\r\nGeneration IV\r\nDuring harsh sunlight, Flower Gift increases the Attack and Special Defense stats of the Pokémon with this Ability and its allies by 1.5×.\r\n\r\nFlower Gift is not responsible for changing Cherrim from Overcast Form into Sunshine Form.\r\n\r\nFlower Gift can be copied by Trace or Role Play.\r\n\r\nGeneration V onward\r\nAlong with its previous effect, Flower Gift now changes Cherrim from Overcast Form to Sunshine Form during harsh sunlight. If Cherrim loses Flower Gift or Flower Gift is suppressed (such as by Gastro Acid), it will revert to its Overcast Form.\r\n\r\nRole Play fails if the target has the Ability Flower Gift. Entrainment fails if the user has the Ability Flower Gift. Flower Gift cannot be copied by Trace, Power of Alchemy, or Receiver.\r\n\r\nOutside of battle\r\nFlower Gift has no effect outside of battle."
    },
    "flower veil": {
        "name": "Flower Veil",
        "description": "Ally Grass-type Pokémon are protected from status conditions and the lowering of their stats.",
        "effect": "In battle\r\nFlower Veil prevents the Pokémon with this Ability (if it is Grass-type) and its Grass-type allies (including non-adjacent allies) from having their stats lowered. Self-inflicted stat reductions, such as from Leaf Storm or Weak Armor, are not prevented. If a Grass-type Pokémon has Contrary, Flower Veil prevents the Pokémon's stats from being lowered after accounting for Contrary.\r\n\r\nFlower Veil also prevents the Pokémon with this Ability (if it is Grass-type) and its Grass-type allies (including non-adjacent allies) from being afflicted by non-volatile status conditions or Yawn. However, it will not prevent a Pokémon from falling asleep if it is already drowsy from Yawn. This Ability has no effect on Rest, the Flame Orb, and the Toxic Orb.\r\n\r\nWhen a Pokémon with Mold Breaker, Turboblaze or Teravolt uses a move, the effects of Flower Veil (including allies') are ignored for the duration of that move. As such, if the move of a Grass-type Pokémon with one of these Abilities triggers Flame Body, Poison Point, Static, Synchronize, Gooey, or Tangling Hair, it will not be protected by Flower Veil.\r\n\r\nOutside of battle\r\nIt is unknown if Flower Veil has an effect outside of battle."
    },
    "fluffy": {
        "name": "Fluffy",
        "description": "Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.",
        "effect": "In battle\r\nA Pokémon with Fluffy takes half damage from moves that make contact. It also takes double damage from Fire-type moves. Fire-type moves that make contact will deal regular damage. Moves affected by Long Reach or the Protective Pads that make contact will deal regular damage.\r\n\r\nOutside of battle\r\nFluffy has no effect outside of battle."
    },
    "forecast": {
        "name": "Forecast",
        "description": "The Pokémon transforms with the weather to change its type to Water, Fire, or Ice.",
        "effect": "In battle\r\nDepending on the weather, Forecast will change Castform's form, which also changes its type. Castform changes as follows:\r\n\r\n- During harsh sunlight or extremely harsh sunlight, it will become Sunny Form, which is Fire-type.\r\n- During hail, it will become Snowy Form, which is Ice-type.\r\n- During rain or heavy rain, it will become Rainy Form, which is Water-type.\r\n- During a sandstorm, fog, a mysterious air current, a shadowy aura, or clear weather it will revert to its normal form, which is Normal-type.\r\n  -It will also revert to its normal form if a Pokémon on the field has Cloud Nine or Air Lock.\r\nThis Ability has no effect on Pokémon other than Castform.\r\n\r\nForecast does not change Castform's form until after Stealth Rock deals damage.\r\n\r\nGeneration III\r\nIf a Pokémon transforms into Castform with Forecast, it will change forms with the weather just like Castform.\r\n\r\nIf Castform or a Pokémon transformed into Castform loses Forecast, it will be stuck in its current form. When it regains Forecast, it will change to the form matching the current weather, even if it is already in the correct form (which resets its type if it had changed due to an effect like Color Change).\r\n\r\nForecast can be copied by Role Play and Trace.\r\n\r\nGeneration IV\r\nIf Forecast is suppressed with Gastro Acid, it will be stuck in its current form.\r\n\r\nForecast cannot be copied by Trace.\r\n\r\nGeneration V onward\r\nIf a Pokémon transforms into Castform, the Pokémon will remain in the same form as the target Castform, regardless of the weather.\r\n\r\nIf Castform loses Forecast or Forecast is suppressed with Gastro Acid, it will revert to its normal form and not be able to change form. If Castform regains Forecast, it will change form to match the current weather, unless it would be in its normal form in the current weather.\r\n\r\nRole Play fails if the target has the Ability Forecast. Entrainment fails if the user has the Ability Forecast. Forecast cannot be copied by Power of Alchemy or Receiver.\r\n\r\nOutside of battle\r\nForecast has no effect outside of battle."
    },
    "forewarn": {
        "name": "Forewarn",
        "description": "When it enters a battle, the Pokémon can tell one of the moves an opposing Pokémon has.",
        "effect": "In battle\r\nForewarn shows the opponent's move with the highest power. If two or more moves are of the same power, one will be chosen at random.\r\n\r\nIn a Double Battle, Forewarn will only show the highest power move out of all the moves known by both opponents. If both opponents have a move with the same power, one will be chosen at random.\r\n\r\nDamaging moves without a power (i.e. moves that deal direct damage and moves that have variable power) are assigned one.\r\n\r\nOutside of battle\r\nForewarn has no effect outside of battle."
    },
    "friend guard": {
        "name": "Friend Guard",
        "description": "Decreases damage inflicted against ally Pokémon.",
        "effect": ""
    },
    "frisk": {
        "name": "Frisk",
        "description": "The Pokémon can check the foe’s held item.",
        "effect": ""
    },
    "full metal body": {
        "name": "Full Metal Body",
        "description": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
        "effect": ""
    },
    "fur coat": {
        "name": "Fur Coat",
        "description": "Halves damage from physical moves.",
        "effect": ""
    },
    "gale wings": {
        "name": "Gale Wings",
        "description": "Gives priority to Flying-type moves.",
        "effect": ""
    },
    "galvanize": {
        "name": "Galvanize",
        "description": "Normal-type moves become Electric-type moves. The power of those moves is boosted a little.",
        "effect": ""
    },
    "gluttony": {
        "name": "Gluttony",
        "description": "Encourages the early use of a held Berry.",
        "effect": ""
    },
    "gooey": {
        "name": "Gooey",
        "description": "Contact with the Pokémon lowers the attacker's Speed stat.",
        "effect": ""
    },
    "grass pelt": {
        "name": "Grass Pelt",
        "description": "Boosts the Defense stat in Grassy Terrain.",
        "effect": ""
    },
    "grassy surge": {
        "name": "Grassy Surge",
        "description": "Turns the ground into Grassy Terrain when the Pokémon enters a battle.",
        "effect": ""
    },
    "guts": {
        "name": "Guts",
        "description": "Boosts Attack if there is a status problem.",
        "effect": ""
    },
    "harvest": {
        "name": "Harvest",
        "description": "Restores any held Berry after the turn on which it is used.",
        "effect": ""
    },
    "healer": {
        "name": "Healer",
        "description": "Has a 30% chance of curing each adjacent ally of any major status ailment after each turn.",
        "effect": ""
    },
    "heatproof": {
        "name": "Heatproof",
        "description": "Weakens the power of Fire-type moves.",
        "effect": ""
    },
    "heavy metal": {
        "name": "Heavy Metal",
        "description": "Doubles the Pokémon's weight.",
        "effect": ""
    },
    "honey gather": {
        "name": "Honey Gather",
        "description": "The Pokémon may gather Honey from somewhere.",
        "effect": ""
    },
    "huge power": {
        "name": "Huge Power",
        "description": "Raises the Pokémon’s Attack stat.",
        "effect": ""
    },
    "hustle": {
        "name": "Hustle",
        "description": "Boosts the Attack stat, but lowers accuracy.",
        "effect": ""
    },
    "hydration": {
        "name": "Hydration",
        "description": "Heals status problems if it is raining.",
        "effect": ""
    },
    "hyper cutter": {
        "name": "Hyper Cutter",
        "description": "Prevents the Attack stat from being lowered.",
        "effect": ""
    },
    "ice body": {
        "name": "Ice Body",
        "description": "The Pokémon regains HP in a hailstorm.",
        "effect": ""
    },
    "illuminate": {
        "name": "Illuminate",
        "description": "Raises the likelihood of meeting wild Pokémon.",
        "effect": ""
    },
    "illusion": {
        "name": "Illusion",
        "description": "Takes the appearance of the last conscious party Pokémon upon being sent out until hit by a damaging move.",
        "effect": ""
    },
    "immunity": {
        "name": "Immunity",
        "description": "Prevents the Pokémon from getting poisoned.",
        "effect": ""
    },
    "imposter": {
        "name": "Imposter",
        "description": "Transforms upon entering battle.",
        "effect": ""
    },
    "infiltrator": {
        "name": "Infiltrator",
        "description": "Ignores Light Screen, Reflect, and Safeguard.",
        "effect": ""
    },
    "innards out": {
        "name": "Innards Out",
        "description": "Damages the attacker landing the finishing hit by the amount equal to its last HP.",
        "effect": ""
    },
    "inner focus": {
        "name": "Inner Focus",
        "description": "The Pokémon is protected from flinching.",
        "effect": ""
    },
    "insomnia": {
        "name": "Insomnia",
        "description": "Prevents the Pokémon from falling asleep.",
        "effect": ""
    },
    "intimidate": {
        "name": "Intimidate",
        "description": "Lowers the foe’s Attack stat.",
        "effect": ""
    },
    "iron barbs": {
        "name": "Iron Barbs",
        "description": "Damages attacking Pokémon for 1/8 their max HP on contact.",
        "effect": ""
    },
    "iron fist": {
        "name": "Iron Fist",
        "description": "Boosts the power of punching moves.",
        "effect": ""
    },
    "justified": {
        "name": "Justified",
        "description": "Raises Attack when hit by Dark-type moves.",
        "effect": ""
    },
    "keen eye": {
        "name": "Keen Eye",
        "description": "Prevents the Pokémon from losing accuracy.",
        "effect": ""
    },
    "klutz": {
        "name": "Klutz",
        "description": "The Pokémon can’t use any held items.",
        "effect": ""
    },
    "leaf guard": {
        "name": "Leaf Guard",
        "description": "Prevents status problems in sunny weather.",
        "effect": ""
    },
    "levitate": {
        "name": "Levitate",
        "description": "Gives full immunity to all Ground-type moves.",
        "effect": ""
    },
    "light metal": {
        "name": "Light Metal",
        "description": "Halves the Pokémon's weight.",
        "effect": ""
    },
    "lightning rod": {
        "name": "Lightning Rod",
        "description": "The Pokémon draws in all Electric-type moves and then raise Sp.Atk.",
        "effect": ""
    },
    "limber": {
        "name": "Limber",
        "description": "The Pokémon is protected from paralysis.",
        "effect": ""
    },
    "liquid ooze": {
        "name": "Liquid Ooze",
        "description": "Inflicts damage on foes using any draining move.",
        "effect": ""
    },
    "liquid voice": {
        "name": "Liquid Voice",
        "description": "All sound-based moves become Water-type moves.",
        "effect": ""
    },
    "long reach": {
        "name": "Long Reach",
        "description": "The Pokémon uses its moves without making contact with the target.",
        "effect": ""
    },
    "magic bounce": {
        "name": "Magic Bounce",
        "description": "Reflects most non-damaging moves back at their user.",
        "effect": ""
    },
    "magic guard": {
        "name": "Magic Guard",
        "description": "The Pokémon only takes damage from attacks.",
        "effect": ""
    },
    "magician": {
        "name": "Magician",
        "description": "The Pokémon steals the held item of a Pokémon it hits with a move.",
        "effect": ""
    },
    "magma armor": {
        "name": "Magma Armor",
        "description": "Prevents the Pokémon from becoming frozen.",
        "effect": ""
    },
    "magnet pull": {
        "name": "Magnet Pull",
        "description": "Prevents Steel-type Pokémon from escaping.",
        "effect": ""
    },
    "marvel scale": {
        "name": "Marvel Scale",
        "description": "Boosts Defense if there is a status problem.",
        "effect": ""
    },
    "mega launcher": {
        "name": "Mega Launcher",
        "description": "Powers up aura and pulse moves.",
        "effect": ""
    },
    "merciless": {
        "name": "Merciless",
        "description": "The Pokémon's attacks become critical hits if the target is poisoned.",
        "effect": ""
    },
    "minus": {
        "name": "Minus",
        "description": "Boosts Sp. Atk if another Pokémon has Plus.",
        "effect": ""
    },
    "misty surge": {
        "name": "Misty Surge",
        "description": "Turns the ground into Misty Terrain when the Pokémon enters a battle.",
        "effect": ""
    },
    "mold breaker": {
        "name": "Mold Breaker",
        "description": "Moves can be used regardless of Abilities.",
        "effect": ""
    },
    "moody": {
        "name": "Moody",
        "description": "Raises a random stat two stages and lowers another one stage after each turn.",
        "effect": ""
    },
    "motor drive": {
        "name": "Motor Drive",
        "description": "Raises Speed if hit by an Electric-type move.",
        "effect": ""
    },
    "moxie": {
        "name": "Moxie",
        "description": "Raises Attack one stage upon KOing a Pokémon.",
        "effect": ""
    },
    "multiscale": {
        "name": "Multiscale",
        "description": "Halves damage taken from full HP.",
        "effect": ""
    },
    "multitype": {
        "name": "Multitype",
        "description": "Changes type to match the held Plate.",
        "effect": ""
    },
    "mummy": {
        "name": "Mummy",
        "description": "Contact with this Pokémon spreads this Ability.",
        "effect": ""
    },
    "natural cure": {
        "name": "Natural Cure",
        "description": "All status problems are healed upon switching out.",
        "effect": ""
    },
    "no guard": {
        "name": "No Guard",
        "description": "Ensures the Pokémon and its foe’s attacks land.",
        "effect": ""
    },
    "normalize": {
        "name": "Normalize",
        "description": "All the Pokémon’s moves become the Normal type.",
        "effect": ""
    },
    "oblivious": {
        "name": "Oblivious",
        "description": "Prevents the Pokémon from becoming infatuated.",
        "effect": ""
    },
    "overcoat": {
        "name": "Overcoat",
        "description": "Protects against damage from weather.",
        "effect": ""
    },
    "overgrow": {
        "name": "Overgrow",
        "description": "Powers up Grass-type moves in a pinch.",
        "effect": ""
    },
    "own tempo": {
        "name": "Own Tempo",
        "description": "Prevents the Pokémon from becoming confused.",
        "effect": ""
    },
    "parental bond": {
        "name": "Parental Bond",
        "description": "Parent and child attack together.",
        "effect": ""
    },
    "pickpocket": {
        "name": "Pickpocket",
        "description": "Steals attacking Pokémon's held item on contact.",
        "effect": ""
    },
    "pickup": {
        "name": "Pickup",
        "description": "The Pokémon may pick up items.",
        "effect": ""
    },
    "pixilate": {
        "name": "Pixilate",
        "description": "Normal-type moves become Fairy-type moves.",
        "effect": ""
    },
    "plus": {
        "name": "Plus",
        "description": "Boosts Sp. Atk if another Pokémon has Minus.",
        "effect": ""
    },
    "poison heal": {
        "name": "Poison Heal",
        "description": "Restores HP if the Pokémon is poisoned.",
        "effect": ""
    },
    "poison point": {
        "name": "Poison Point",
        "description": "Contact with the Pokémon may poison the foe.",
        "effect": ""
    },
    "poison touch": {
        "name": "Poison Touch",
        "description": "Has a 30% chance of poisoning Pokémon upon contact when attacking.",
        "effect": ""
    },
    "power construct": {
        "name": "Power Construct",
        "description": "Other Cells gather to aid when its HP becomes half or less. Then the Pokémon changes its form to Complete Forme.",
        "effect": ""
    },
    "power of alchemy": {
        "name": "Power of Alchemy",
        "description": "The Pokémon copies the Ability of a defeated ally.",
        "effect": ""
    },
    "prankster": {
        "name": "Prankster",
        "description": "Raises non-damaging moves' priority by one stage.",
        "effect": ""
    },
    "pressure": {
        "name": "Pressure",
        "description": "The Pokémon raises the foe’s PP usage.",
        "effect": ""
    },
    "primordial sea": {
        "name": "Primordial Sea",
        "description": "Causes heavy rain.",
        "effect": ""
    },
    "prism armor": {
        "name": "Prism Armor",
        "description": "Reduces the power of supereffective attacks taken.",
        "effect": ""
    },
    "protean": {
        "name": "Protean",
        "description": "Changes the Pokémon's type to the same type of the move it is using.",
        "effect": ""
    },
    "psychic surge": {
        "name": "Psychic Surge",
        "description": "Turns the ground into Psychic Terrain when the Pokémon enters a battle.",
        "effect": ""
    },
    "pure power": {
        "name": "Pure Power",
        "description": "Boosts the power of physical attacks.",
        "effect": ""
    },
    "queenly majesty": {
        "name": "Queenly Majesty",
        "description": "Its majesty pressures the opposing Pokémon, making it unable to attack using priority moves.",
        "effect": ""
    },
    "quick feet": {
        "name": "Quick Feet",
        "description": "Boosts Speed if there is a status problem.",
        "effect": ""
    },
    "rain dish": {
        "name": "Rain Dish",
        "description": "The Pokémon gradually recovers HP in rain.",
        "effect": ""
    },
    "rattled": {
        "name": "Rattled",
        "description": "Raises Speed one stage upon being hit by a Dark, Ghost, or Bug move.",
        "effect": ""
    },
    "receiver": {
        "name": "Receiver",
        "description": "The Pokémon copies the Ability of a defeated ally.",
        "effect": ""
    },
    "reckless": {
        "name": "Reckless",
        "description": "Powers up moves that have recoil damage.",
        "effect": ""
    },
    "refrigerate": {
        "name": "Refrigerate",
        "description": "Normal-type moves become Ice-type moves.",
        "effect": ""
    },
    "regenerator": {
        "name": "Regenerator",
        "description": "Heals for 1/3 max HP upon leaving battle.",
        "effect": ""
    },
    "rivalry": {
        "name": "Rivalry",
        "description": "Raises Attack if the foe is of the same gender.",
        "effect": ""
    },
    "rks system": {
        "name": "RKS System",
        "description": "Changes the Pokémon’s type to match the memory disc it holds.",
        "effect": ""
    },
    "rock head": {
        "name": "Rock Head",
        "description": "Protects the Pokémon from recoil damage.",
        "effect": ""
    },
    "rough skin": {
        "name": "Rough Skin",
        "description": "Inflicts damage to the foe on contact.",
        "effect": ""
    },
    "run away": {
        "name": "Run Away",
        "description": "Enables sure getaway from wild Pokémon.",
        "effect": ""
    },
    "sand force": {
        "name": "Sand Force",
        "description": "Strengthens Rock, Ground, and Steel moves to 1.3× their power during a sandstorm.",
        "effect": ""
    },
    "sand rush": {
        "name": "Sand Rush",
        "description": "Doubles Speed during a sandstorm.",
        "effect": ""
    },
    "sand stream": {
        "name": "Sand Stream",
        "description": "The Pokémon summons a sandstorm in battle.",
        "effect": ""
    },
    "sand veil": {
        "name": "Sand Veil",
        "description": "Boosts the Pokémon’s evasion in a sandstorm.",
        "effect": ""
    },
    "sap sipper": {
        "name": "Sap Sipper",
        "description": "Absorbs Grass moves, raising Attack one stage.",
        "effect": ""
    },
    "schooling": {
        "name": "Schooling",
        "description": "When it has a lot of HP, the Pokémon forms a powerful school. It stops schooling when its HP is low.",
        "effect": ""
    },
    "scrappy": {
        "name": "Scrappy",
        "description": "Enables moves to hit Ghost-type foes.",
        "effect": ""
    },
    "serene grace": {
        "name": "Serene Grace",
        "description": "Boosts the likelihood of added effects appearing.",
        "effect": ""
    },
    "shadow shield": {
        "name": "Shadow Shield",
        "description": "Reduces the amount of damage the Pokémon takes while its HP is full.",
        "effect": ""
    },
    "shadow tag": {
        "name": "Shadow Tag",
        "description": "Prevents the foe from escaping.",
        "effect": ""
    },
    "shed skin": {
        "name": "Shed Skin",
        "description": "The Pokémon may heal its own status problems.",
        "effect": ""
    },
    "sheer force": {
        "name": "Sheer Force",
        "description": "Strengthens moves with extra effects to 1.3× their power, but prevents their extra effects.",
        "effect": ""
    },
    "shell armor": {
        "name": "Shell Armor",
        "description": "The Pokémon is protected against critical hits.",
        "effect": ""
    },
    "shield dust": {
        "name": "Shield Dust",
        "description": "Blocks the added effects of attacks taken.",
        "effect": ""
    },
    "shields down": {
        "name": "Shields Down",
        "description": "When its HP becomes half or less, the Pokémon's shell breaks and it becomes aggressive.",
        "effect": ""
    },
    "simple": {
        "name": "Simple",
        "description": "The Pokémon is prone to wild stat changes.",
        "effect": ""
    },
    "skill link": {
        "name": "Skill Link",
        "description": "Increases the frequency of multi-strike moves.",
        "effect": ""
    },
    "slow start": {
        "name": "Slow Start",
        "description": "Temporarily halves Attack and Speed.",
        "effect": ""
    },
    "slush rush": {
        "name": "Slush Rush",
        "description": "Boosts the Pokémon's Speed stat in a hailstorm.",
        "effect": ""
    },
    "sniper": {
        "name": "Sniper",
        "description": "Powers up moves if they become critical hits.",
        "effect": ""
    },
    "snow cloak": {
        "name": "Snow Cloak",
        "description": "Raises evasion in a hailstorm.",
        "effect": ""
    },
    "snow warning": {
        "name": "Snow Warning",
        "description": "The Pokémon summons a hailstorm in battle.",
        "effect": ""
    },
    "solar power": {
        "name": "Solar Power",
        "description": "Boosts Sp. Atk, but lowers HP in sunshine.",
        "effect": ""
    },
    "solid rock": {
        "name": "Solid Rock",
        "description": "Powers down supereffective moves.",
        "effect": ""
    },
    "soul-heart": {
        "name": "Soul-Heart",
        "description": "Boosts its Sp. Atk stat every time a Pokémon faints.",
        "effect": ""
    },
    "soundproof": {
        "name": "Soundproof",
        "description": "Gives full immunity to all sound-based moves.",
        "effect": ""
    },
    "speed boost": {
        "name": "Speed Boost",
        "description": "The Pokémon’s Speed stat is gradually boosted.",
        "effect": ""
    },
    "stakeout": {
        "name": "Stakeout",
        "description": "Doubles the damage dealt to the target's replacement if the target switches out.",
        "effect": ""
    },
    "stall": {
        "name": "Stall",
        "description": "The Pokémon moves after even slower foes.",
        "effect": ""
    },
    "stamina": {
        "name": "Stamina",
        "description": "Boosts the Defense stat when hit by an attack.",
        "effect": ""
    },
    "stance change": {
        "name": "Stance Change",
        "description": "The Pokémon changes form depending on how it battles.",
        "effect": ""
    },
    "static": {
        "name": "Static",
        "description": "Contact with the Pokémon may cause paralysis.",
        "effect": ""
    },
    "steadfast": {
        "name": "Steadfast",
        "description": "Raises Speed each time the Pokémon flinches.",
        "effect": ""
    },
    "steelworker": {
        "name": "Steelworker",
        "description": "Powers up Steel-type moves.",
        "effect": ""
    },
    "stench": {
        "name": "Stench",
        "description": "The stench may cause the target to flinch.",
        "effect": ""
    },
    "sticky hold": {
        "name": "Sticky Hold",
        "description": "Protects the Pokémon from item theft.",
        "effect": ""
    },
    "storm drain": {
        "name": "Storm Drain",
        "description": "The Pokémon draws in all Water-type moves.",
        "effect": ""
    },
    "strong jaw": {
        "name": "Strong Jaw",
        "description": "The Pokémon's strong jaw gives it tremendous biting power.",
        "effect": ""
    },
    "sturdy": {
        "name": "Sturdy",
        "description": "The Pokémon is protected against 1-hit KO attacks.",
        "effect": ""
    },
    "suction cups": {
        "name": "Suction Cups",
        "description": "Negates moves that force switching out.",
        "effect": ""
    },
    "super luck": {
        "name": "Super Luck",
        "description": "Heightens the critical-hit ratios of moves.",
        "effect": ""
    },
    "surge surfer": {
        "name": "Surge Surfer",
        "description": "Doubles the Pokémon's Speed stat on Electric Terrain.",
        "effect": ""
    },
    "swarm": {
        "name": "Swarm",
        "description": "Powers up Bug-type moves in a pinch.",
        "effect": ""
    },
    "sweet veil": {
        "name": "Sweet Veil",
        "description": "Prevents itself and its allies from falling asleep.",
        "effect": ""
    },
    "swift swim": {
        "name": "Swift Swim",
        "description": "Boosts the Pokémon’s Speed in rain.",
        "effect": ""
    },
    "symbiosis": {
        "name": "Symbiosis",
        "description": "The Pokémon can pass an item to an ally.",
        "effect": ""
    },
    "synchronize": {
        "name": "Synchronize",
        "description": "Passes on a burn, poison, or paralysis to the foe.",
        "effect": ""
    },
    "tangled feet": {
        "name": "Tangled Feet",
        "description": "Raises evasion if the Pokémon is confused.",
        "effect": ""
    },
    "tangling hair": {
        "name": "Tangling Hair",
        "description": "Contact with the Pokémon lowers the attacker's Speed stat.",
        "effect": ""
    },
    "technician": {
        "name": "Technician",
        "description": "Powers up the Pokémon’s weaker moves.",
        "effect": ""
    },
    "telepathy": {
        "name": "Telepathy",
        "description": "Protects against damaging moves from friendly Pokémon.",
        "effect": ""
    },
    "teravolt": {
        "name": "Teravolt",
        "description": "Moves can be used regardless of Abilities.",
        "effect": ""
    },
    "thick fat": {
        "name": "Thick Fat",
        "description": "Raises resistance to Fire- and Ice-type moves.",
        "effect": ""
    },
    "tinted lens": {
        "name": "Tinted Lens",
        "description": "Powers up “not very effective” moves.",
        "effect": ""
    },
    "torrent": {
        "name": "Torrent",
        "description": "Powers up Water-type moves in a pinch.",
        "effect": ""
    },
    "tough claws": {
        "name": "Tough Claws",
        "description": "Powers up moves that make direct contact.",
        "effect": ""
    },
    "toxic boost": {
        "name": "Toxic Boost",
        "description": "Increases Attack to 1.5× when poisoned.",
        "effect": ""
    },
    "trace": {
        "name": "Trace",
        "description": "The Pokémon copies a foe's Ability.",
        "effect": ""
    },
    "triage": {
        "name": "Triage",
        "description": "Gives priority to a healing move.",
        "effect": ""
    },
    "truant": {
        "name": "Truant",
        "description": "The Pokémon can't attack on consecutive turns.",
        "effect": ""
    },
    "turboblaze": {
        "name": "Turboblaze",
        "description": "Moves can be used regardless of Abilities.",
        "effect": ""
    },
    "unaware": {
        "name": "Unaware",
        "description": "Ignores any change in stats by the foe.",
        "effect": ""
    },
    "unburden": {
        "name": "Unburden",
        "description": "Raises Speed if a held item is used.",
        "effect": ""
    },
    "unnerve": {
        "name": "Unnerve",
        "description": "Prevents opposing Pokémon from eating held Berries.",
        "effect": ""
    },
    "victory star": {
        "name": "Victory Star",
        "description": "Raises moves' accuracy to 1.1× for friendly Pokémon.",
        "effect": ""
    },
    "vital spirit": {
        "name": "Vital Spirit",
        "description": "Prevents the Pokémon from falling asleep.",
        "effect": ""
    },
    "volt absorb": {
        "name": "Volt Absorb",
        "description": "Restores HP if hit by an Electric-type move.",
        "effect": ""
    },
    "water absorb": {
        "name": "Water Absorb",
        "description": "Restores HP if hit by a Water-type move.",
        "effect": ""
    },
    "water bubble": {
        "name": "Water Bubble",
        "description": "Lowers the power of Fire-type moves done to the Pokémon and prevents the Pokémon from getting a burn.",
        "effect": ""
    },
    "water compaction": {
        "name": "Water Compaction",
        "description": "Boosts the Pokémon's Defense stat sharply when hit by a Water-type move.",
        "effect": ""
    },
    "water veil": {
        "name": "Water Veil",
        "description": "Prevents the Pokémon from getting a burn.",
        "effect": ""
    },
    "weak armor": {
        "name": "Weak Armor",
        "description": "Raises Speed and lowers Defense by one stage each upon being hit by any move.",
        "effect": ""
    },
    "white smoke": {
        "name": "White Smoke",
        "description": "Prevents the Pokémon’s stats from being lowered.",
        "effect": ""
    },
    "wimp out": {
        "name": "Wimp Out",
        "description": "The Pokémon cowardly switches out when its HP becomes half or less.",
        "effect": ""
    },
    "wonder guard": {
        "name": "Wonder Guard",
        "description": "Only supereffective moves will hit.",
        "effect": ""
    },
    "wonder skin": {
        "name": "Wonder Skin",
        "description": "Has a 50% chance of protecting against non-damaging moves that inflict major status ailments.",
        "effect": ""
    },
    "zen mode": {
        "name": "Zen Mode",
        "description": "Changes the Pokémon's shape when HP is halved.",
        "effect": ""
    }
}
