{
    "ability name, no caps at all, with space if two words": {
        "name": "name of ability, with caps here please",
        "description": "the official description that is used in games, use capital letter and full stop",
        "effect": "bulbapedia's insight on the actual effect - you'll need to do this manually i guess - also caps and full stop please"
    },
    "adaptability": {
        "name": "Adaptability",
        "description": "Powers up moves of the same type as the Pokémon.",
        "effect": "In battle\nAdaptability increases STAB from 1.5× to 2×.\n\nOutside of battle\nAdaptability has no effect outside of battle."
    },
    "aerilate": {
        "name": "Aerilate",
        "description": "Normal-type moves become Flying-type moves. The power of those moves is boosted a little.",
        "effect": "In battle\nGeneration VI\nAerilate causes all Normal-type moves used by the Pokémon to become Flying-type and receive a 30% power boost.\n\nGeneration VII\nAffected moves now receive a 20% power boost.\n\nOutside of battle\nAerilate has no effect outside of battle."
    },
    "aftermath": {
        "name": "Aftermath",
        "description": "Damages the attacker if it contacts the Pokémon with a finishing hit.",
        "effect": "In battle\nWhen a Pokémon with this Ability faints due to damage from a move that makes contact, the attacking Pokémon takes damage equal to ¼ of its own maximum HP. This Ability will not activate if a Pokémon with Damp is on the field.\n\nOutside of battle\nAftermath has no effect outside of battle."
    },
    "air lock": {
        "name": "Air Lock",
        "description": "Eliminates the effects of weather.",
        "effect": "In battle\nWhen a Pokémon with Air Lock is in battle, all effects of weather are negated (though the weather itself does not disappear).\n\nGeneration V\nWhen a Pokémon with Air Lock is brought out, the message \"The effects of weather disappeared.\" will be displayed after the Ability is announced.\n\nGeneration VI\nDuring extremely harsh sunlight, heavy rain, and a mysterious air current, even if a Pokémon is negating the effects of weather with Air Lock, the moves Sunny Day, Rain Dance, Sandstorm, and Hail will still fail if used, and the Abilities Drought, Drizzle, Sand Stream, and Snow Warning will still fail to activate. However, all other effects of these weather conditions are negated by Air Lock.\n\nOutside of battle\nAir Lock has no effect outside of battle."
    },
    "analytic": {
        "name": "Analytic",
        "description": "Boosts move power when the Pokémon moves last.",
        "effect": "In battle\nIf a Pokémon with Analytic executes its move after the Pokémon it originally targeted has already acted this turn, the power of its move is increased by 30%. Using a move and switching to another Pokémon count as having acted, while Mega Evolving, shifting, or the charging phase of Focus Punch do not.\n\nIn a Triple Battle, this means that if the Pokémon with Analytic is targeting a Pokémon in a flank position that chooses to switch with its ally in the middle, its move's power will always be normal when it attacks the Pokémon that is shifted into the flank position; but if the Pokémon with Analytic targets a Pokémon in the middle whose ally on a flank chooses to shift into the middle position, its move's power still depends on whether the Pokémon that was in the middle (and is now on a flank) has acted when the Pokémon with Analytic uses its move.\n\nOutside of battle\nAnalytic has no effect outside of battle."
    },
    "anger point": {
        "name": "Anger Point",
        "description": "The Pokémon is angered when it takes a critical hit, and that maxes its Attack stat.",
        "effect": "In battle\nGeneration IV\nWhen a Pokémon with this Ability is hit by a critical hit, Anger Point maximizes its Attack stat by raising it to +6 stages (regardless of its current stage).\n\nAnger Point will activate even if the Pokémon's substitute is hit.\n\nGeneration V onward\nAnger Point no longer activates if the Pokémon's substitute is hit.\n\nOutside of battle\nAnger Point has no effect outside of battle."
    },
    "anticipation": {
        "name": "Anticipation",
        "description": "The Pokémon can sense an opposing Pokémon's dangerous moves.",
        "effect": "In battle\nGeneration IV\nWhen a Pokémon with Anticipation enters the battle or a Pokémon gains the Ability Anticipation, it causes the Pokémon to \"shudder\" if any opponent has a damaging move that is super effective against the Pokémon with Anticipation, a one-hit knockout move, or Selfdestruct or Explosion.\n\nHidden Power, Judgment, Weather Ball, and Natural Gift are treated as Normal-type moves. Counter, Metal Burst, and Mirror Coat do not trigger Anticipation.\n\nGeneration V\nThe moves Selfdestruct and Explosion are now treated like all other Normal-type moves, and thus no longer trigger Anticipation.\n\nCounter, Metal Burst, and Mirror Coat are counted as attacking moves of their types, so can trigger Anticipation. Techno Blast is treated as a Normal-type move.\n\nGeneration VI onward\nHidden Power is now treated as its effective type rather than Normal-type. Revelation Dance and Multi-Attack are treated as Normal-type moves.\n\nNormal-type moves (including Self-Destruct and Explosion) can trigger Anticipation in Inverse Battles, if the Pokémon is weak to Normal-type moves.\n\nAnticipation ignores a mysterious air current.\n\nOutside of battle\nAnticipation has no effect outside of battle."
    },
    "arena trap": {
        "name": "Arena Trap",
        "description": "Prevents opposing Pokémon from fleeing.",
        "effect": "In battle\nArena Trap prevents all grounded foes from fleeing (including Teleport) or switching out as long as the user remains in battle.\n\nUsing Baton Pass, U-turn, Volt Switch, or Parting Shot will still cause the Pokémon to switch out. Holding a Shed Shell allows the Pokémon to switch out, but not flee or Teleport. Having the Ability Run Away or holding a Smoke Ball allows the Pokémon to flee or Teleport, but not switch.\n\nIf a wild Pokémon has Arena Trap and the player's Pokémon faints, if the player attempts to flee instead of sending out another Pokémon, they are unaffected by Arena Trap.\n\nArena Trap does not affect allies.\n\nGeneration VI\nGhost-type Pokémon are now immune to Arena Trap."
    },
    "aroma veil": {
        "name": "Aroma Veil",
        "description": "Protects itself and its allies from attacks that limit their move choices.",
        "effect": "In battle\nAroma Veil prevents the Pokémon with this Ability and its allies (including non-adjacent allies) from being afflicted by Taunt, Torment, Encore, Disable and Cursed Body, Heal Block, and infatuation.\n\nWhen a Pokémon with Mold Breaker, Turboblaze or Teravolt uses a move, the effects of Aroma Veil (including allies') are ignored for the duration of that move. As such, if the move of a Pokémon with one of these Abilities triggers Cursed Body, Cute Charm or a Destiny Knot, it will not be protected by Aroma Veil; likewise, if its own Destiny Knot is activated during that attack (such as in response to the attack target's Cute Charm), that target will not be protected by its allies' Aroma Veil.\n\nOutside of battle\nIt is unknown if Aroma Veil has an effect outside of battle."
    },
    "aura break": {
        "name": "Aura Break",
        "description": "The effects of \"Aura\" Abilities are reversed to lower the power of affected moves.",
        "effect": "In battle\nAura Break inverts the effects of Fairy Aura and Dark Aura: instead of multiplying the power of Fairy- or Dark-type moves by those Abilities' normal multiplier of 1.33, the power of moves of that type is divided by 1.33 instead, resulting in approximately a 25% decrease in power as long as both Abilities are active.\n\nEven if a Pokémon with Mold Breaker, Teravolt, or Turboblaze uses a Fairy- or Dark-type move, the effect of Aura Break still applies.\n\nOutside of battle\nZygarde with the Ability Aura Break can be separated back into Cores and Cells.\n\nZygarde cannot switch between Abilities using an Ability Capsule."
    },
    "bad dreams": {
        "name": "Bad Dreams",
        "description": "Reduces the HP of sleeping opposing Pokémon.",
        "effect": "In battle\nAt the end of each turn, each adjacent sleeping opponent takes damage equal to 1/8 of its maximum HP.\n\nBad Dreams inflicts damage after a Pokémon that is drowsy due to Yawn falls asleep (and thus inflicts damage to a Pokémon the same turn it falls asleep due to drowsiness). Bad Dreams applies after a Pokémon has the opportunity to be woken up by Hydration, Shed Skin, or Healer.\n\nOutside of battle\nBad Dreams has no effect outside of battle.\n"
    },
    "battery": {
        "name": "Battery",
        "description": "Powers up ally Pokémon's special moves.",
        "effect": "In battle\nThis Ability raises the power of allies' special moves by 30%.\n\nOutside of battle\nBattery has no effect outside of battle."
    },
    "battle armor": {
        "name": "Battle Armor",
        "description": "Hard armor protects the Pokémon from critical hits.",
        "effect": "In battle\nBattle Armor prevents the opponent from landing a critical hit.\n\nOutside of battle\nBattle Armor has no effect outside of battle."
    },
    "battle bond": {
        "name": "Battle Bond",
        "description": "Defeating an opposing Pokémon strengthens the Pokémon's bond with its Trainer, and it becomes Ash-Greninja. Water Shuriken gets more powerful.",
        "effect": "In battle\nWhen a Greninja with Battle Bond directly causes another Pokémon (including allies) to faint by using a damaging move, unless this ends the battle, it will change into Ash-Greninja. After the battle, the Pokémon reverts to its original form.\n\nAsh-Greninja has higher base stats than regular Greninja. If Ash-Greninja uses Water Shuriken, the move's power becomes 20 (rather than the usual 15) and it always hits three times. If a Pokémon transforms into Ash-Greninja, Battle Bond does not affect the transformed Pokémon's use of Water Shuriken.\n\nMultiple Greninja can activate this Ability during the same battle. If Ash-Greninja faints in battle, it will revert to its original form, and that Greninja cannot change into Ash-Greninja again during the same battle even after being revived.\n\nGastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has Battle Bond. Role Play and Skill Swap fail if either Pokémon has Battle Bond. Battle Bond cannot be copied by Trace, Power of Alchemy, or Receiver. Battle Bond cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Greninja obtains Battle Bond with Imposter or Transform, the Pokémon cannot change form into Ash-Greninja even if it knocks out another Pokémon.\n\nOutside of battle\nGreninja with this Ability cannot breed nor be used in the Battle Spot if Special Pokémon are banned. However, it can be used in the Battle Tree."
    },
    "beast boost": {
        "name": "Beast Boost",
        "description": "The Pokémon boosts its most proficient stat each time it knocks out a Pokémon.",
        "effect": "In battle\nWhen a Pokémon with Beast Boost directly causes another Pokémon (including allies) to faint by using a damaging move, its highest stat (other than HP) is increased by one stage. If this stat is already at +6 stages, Beast Boost will not activate (not even in the case of a tie of two or more stats).\n\nFor determining the highest stat, Beast Boost does not take into account stat stages, held items, or reductions due to status conditions; however, it does consider the effects of Power Split, Guard Split, Power Trick, Wonder Room, and Speed Swap. In the case of a tie between multiple stats, it increases one stat, prioritized in this order: Attack, Defense, Special Attack, Special Defense, and Speed.\n\nIf the Pokémon fainting ends the battle, Beast Boost will not activate. Beast Boost activates after the Pokémon gains Attack from Fell Stinger. If a Pokémon with Beast Boost defeats a Pokémon with Mummy using a contact move, the Pokémon's Ability will become Mummy before Beast Boost has the opportunity to activate.\n\nOutside of battle\nBeast Boost has no effect outside of battle."
    },
    "berserk": {
        "name": "Berserk",
        "description": "Boosts the Pokémon's Sp. Atk stat when it takes a hit that causes its HP to become half or less.",
        "effect": "In battle\nEvery time the HP of a Pokémon with Berserk drops below half, its Special Attack is raised by one stage. If the HP falls below half due to indirect damage, such as one caused by Leech Seed, status conditions or weather, Berserk won't activate.\n\nOutside of battle\nBerserk has no effect outside of battle."
    },
    "big pecks": {
        "name": "Big Pecks",
        "description": "Protects the Pokémon from Defense-lowering effects.",
        "effect": "In battle\nBig Pecks prevents other Pokémon from lowering the Defense stat stage of the Pokémon with this Ability. It does not prevent the Pokémon with this Ability from lowering its own Defense, such as by using Shell Smash.\n\nEffects that decrease Defense without using stat stages, such as Guard Swap, Heart Swap, or Guard Split, are unaffected by Big Pecks.\n\nThis Ability can be ignored with Mold Breaker, Teravolt, and Turboblaze."
    },
    "blaze": {
        "name": "Blaze",
        "description": "Powers up Fire-type moves when the Pokémon's HP is low.",
        "effect": "In battle\nGenerations III to IV\nWhen a Pokémon with Blaze uses a Fire-type move, the move's power will be increased by 50% if the user has less than or equal to ⅓ of its maximum HP remaining.\n\nGenerations V onwards\nInstead of boosting Fire-type moves' power, Blaze now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Fire-type move is being used, resulting in effectively the same effect.\n\nOutside of battle\nBlaze has no effect outside of battle."
    },
    "bulletproof": {
        "name": "Bulletproof",
        "description": "Protects the Pokémon from some ball and bomb moves.",
        "effect": "In battle\nPokémon with Bulletproof are not affected by ball and bomb moves, as well as some cannon-based and blast-based attacks.\n\nOutside of battle\nBulletproof has no effect outside of battle."
    },
    "cheek pouch": {
        "name": "Cheek Pouch",
        "description": "Restores HP as well when the Pokémon eats a Berry.",
        "effect": "In battle\nCheek Pouch restores 33% of the Pokémon's maximum HP when it consumes a Berry, after the effect of the Berry is applied.\n\nCheek Pouch activates even if the Pokémon eats another Pokémon's held Berry via Bug Bite, Pluck or Fling, but only if the Berry is actually eaten for an effect (i.e. the Berry consumption animation plays). Consuming a Berry through other means (such as Natural Gift, using Fling, or its Trainer giving it a Berry from the Bag) will not trigger Cheek Pouch.\n\nCheek Pouch will not activate if the Pokémon is under the effect of Heal Block.\n\nOutside of battle\nIt is unknown if Cheek Pouch has an effect outside of battle."
    },
    "chlorophyll": {
        "name": "Chlorophyll",
        "description": "Boosts the Pokémon's Speed stat in harsh sunlight.",
        "effect": "In battle\nDuring harsh sunlight, the Speed stat of Pokémon with this Ability is doubled.\n\nOutside of battle\nChlorophyll has no effect outside of battle."
    },
    "clear body": {
        "name": "Clear Body",
        "description": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
        "effect": "In battle\nClear Body prevents stat reduction caused by other Pokémon's moves and Abilities (such as Scary Face and Intimidate), including Sticky Web. Clear Body does not prevent self-inflicted stat reductions such as from moves like Superpower or Hammer Arm.\n\nClear Body only protects from effects that lower stat stages, so it does not prevent stat reduction from items like the Iron Ball, the status conditions paralysis or burn, or the moves Guard Split or Power Split. Clear Body does not prevent stat stages being directly modified by Heart Swap, Guard Swap, Power Swap, Baton Pass, or Topsy-Turvy.\n\nThis Ability is ignored by Pokémon with Mold Breaker, Teravolt, and Turboblaze.\n\nOutside of battle\nClear Body has no effect outside of battle."
    },
    "cloud nine": {
        "name": "Cloud Nine",
        "description": "Eliminates the effects of weather.\n",
        "effect": "In battle\nWhen a Pokémon with Cloud Nine is in battle, all effects of weather are negated (though the weather itself does not disappear).\n\nGeneration V\nWhen a Pokémon with Cloud Nine is brought out, the message \"The effects of weather disappeared.\" will be displayed.\n\nGeneration VI\nDuring extremely harsh sunlight, heavy rain, and a mysterious air current, even if a Pokémon is negating the effects of weather with Cloud Nine, the moves Sunny Day, Rain Dance, Sandstorm, and Hail will still fail if used, and the Abilities Drought, Drizzle, Sand Stream, and Snow Warning will still fail to activate. However, all other effects of these weather conditions are negated by Cloud Nine.\n\nOutside of battle\nCloud Nine has no effect outside of battle."
    },
    "color change": {
        "name": "Color Change",
        "description": "The Pokémon's type becomes the type of the move used on it.",
        "effect": "In battle\nGenerations III and IV\nWhen a Pokémon with this Ability is hit by a damage-dealing move (except Struggle and Shadow moves), Color Change will change the Pokémon's own type to the type of the move that it was hit by. Color Change does not activate if the Pokémon's substitute is hit.\n\nEven if the Pokémon with Color Change has two types, it will only have a single type after the effect is applied. If a Pokémon with this Ability is hit by Weather Ball during shadowy aura, it will become Normal-type.\n\nColor Change will activate after the first hit of a multi-strike move. Future Sight and Doom Desire do not activate Color Change.\n\nStatus conditions are inflicted before Color Change activates. As a result, even if Color Change would make the Pokémon become a type that is immune to the status condition, the Pokémon can still be afflicted with the status condition; for example, a Pokémon with Color Change that is hit by Poison Sting has a chance to be poisoned before it becomes Poison-type.\n\nGeneration V onward\nColor Change now activates after the last hit of a multi-strike move.\n\nFuture Sight and Doom Desire now activate Color Change when they hit (they do not activate Color Change when used).\n\nColor Change will not activate when the Pokémon is hit by a typeless Revelation Dance.\n\nOutside of battle\nColor Change has no effect outside of battle."
    },
    "comatose": {
        "name": "Comatose",
        "description": "It's always drowsing and will never wake up. It can attack without waking up.",
        "effect": "In battle\nComatose makes the user act as if it were asleep, without inflicting the status; the Pokémon with this Ability can still use moves (including successfully using Sleep Talk and Snore). It cannot be afflicted with non-volatile status conditions or become drowsy due to Yawn. The Pokémon with this Ability takes double damage from Hex and Wake-Up Slap; can be affected by Dream Eater, Nightmare, and Bad Dreams; and cannot successfully use Rest.\n\nComatose is unaffected by effects that prevent sleep (such as Uproar, Electric Terrain and Sweet Veil). Comatose is unaffected by Mold Breaker, Turboblaze and Teravolt. A Pokémon with Poison Touch using Sunsteel Strike cannot poison a target that has Comatose.\n\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability Comatose. Skill Swap fails if either Pokémon has Comatose. Comatose cannot be copied by Trace, Power of Alchemy, or Receiver. Comatose cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon that has its Ability suppressed passes that effect to a Pokémon with Comatose via Baton Pass, that effect fades. If a Pokémon that already has its Ability suppressed obtains Comatose with Transform, Comatose's effects are suppressed (i.e. the Pokémon will not be protected from status conditions, is not treated as asleep for effects such as Sleep Talk, etc.).\n\nIf a Pokémon that already has a status condition gains Comatose (i.e. due to Transform or Imposter), it will not be cured of its status condition. If the Pokémon was asleep, the status has its normal effect, unaffected by Comatose.\n\nOutside of battle\nComatose has no effect outside of battle."
    },
    "competitive": {
        "name": "Competitive",
        "description": "Boosts the Sp. Atk stat sharply when a stat is lowered.",
        "effect": "In battle\nWhen a stat of a Pokémon with this Ability is lowered by an opponent, its Special Attack is increased by two stages. Competitive will not activate if the Pokémon with this Ability lowers its own stats (such as with Close Combat) or if its stats are lowered by an ally.\n\nIf multiple stats are lowered (such as by Memento or Venom Drench) Competitive activates for each stat lowered.\n\nIf the Pokémon with this Ability is holding a White Herb, if a stat other than Special Attack is lowered, Competitive will trigger before the White Herb, so the user will receive the Special Attack boost and then the lowered stat will be restored. If its Special Attack is lowered, Competitive will activate first, increasing its Special Attack so that the White Herb cannot activate.\n\nOutside of battle\nCompetitive has no effect outside of battle."
    },
    "compound eyes": {
        "name": "Compound Eyes",
        "description": "The Pokémon's compound eyes boost its accuracy.",
        "effect": "In battle\nCompound Eyes raises accuracy by 30% of a move's original accuracy in battles. This means that Thunder, for example, has 91% accuracy as opposed to the usual 70% (70 x 1.3 = 91%). A move with a theoretical accuracy of 77% or higher will have its accuracy set to 100% (77% x 1.3 = 100.1%).\n\nOutside of battle\nIn Pokémon Emerald and all games since Generation IV, if a Pokémon with this Ability leads the party (even if fainted), the chances of finding a wild Pokémon holding an item increase from 50%/5% to 60%/20%. In dark grass in Generation V, the chances increase from 50%/5%/1% to 60%/20%/5%."
    },
    "contrary": {
        "name": "Contrary",
        "description": "Makes stat changes have an opposite effect.",
        "effect": "In battle\nThis Ability inverts all changes to the stat stages of a Pokémon with this Ability; if an effect would lower a stat, it is increased instead, and if an effect would increase a stat, it is decreased instead. Effects that change a Pokémon's stats without affecting stat stages, such as burn and paralysis, are not affected by Contrary.\n\nThis also applies to self-inflicted changes, such as Curse and Leaf Storm. This Ability only inverts the changes when they are applied; it does not passively cause all existing changes to reverse; therefore, if the Ability Contrary is no longer in effect or the stats are passed by Baton Pass, all existing stat stage changes remain the same. Stats passed by Baton Pass onto a Pokémon with Contrary are not reversed.\n\nStat stage increases caused by the Z-Power effects of status Z-Moves are not inverted by Contrary. However, the stat stage increases as a result of Extreme Evoboost are inverted.\n\nMist (including from Guard Spec.) and Flower Veil take into account Contrary's inversion before determining whether to block the stat change. For example, if a Pokémon with Contrary is targeted by String Shot while protected by Mist, it will gain Speed; if a Pokémon with Contrary is targeted by Swagger while protected by Mist, its Attack will not be changed.\n\nIf a Pokémon with Contrary uses Belly Drum, its Attack will be lowered to -6 stages (although the message will still say that the user maximized its Attack); if the user's Attack is already at -6 stages, Belly Drum will still deduct HP. Even if the user has Contrary, Belly Drum fails if the user's Attack is already at +6.\n\nIf a move used by a Pokémon with Mold Breaker, Teravolt, or Turboblaze would change a stat stage of a Pokémon with Contrary, the change will not be inverted.\n\nOutside of battle\nContrary has no effect outside of battle."
    },
    "corrosion": {
        "name": "Corrosion",
        "description": "The Pokémon can poison the target even if it's a Steel or Poison type.",
        "effect": "In battle\nCorrosion allows the user to inflict poison on any Pokémon regardless of type, allowing them to poison Poison and Steel-type Pokémon.\n\nIf a Poison- or Steel-type Pokémon with Corrosion holds a Toxic Orb, it will badly poison itself. A Pokémon with Corrosion can poison Poison- and Steel-type Pokémon if it uses Fling while holding a Toxic Orb or a Poison Barb.\n\nThis Ability has no effect on Toxic Spikes. It does not allow the Pokémon with this Ability to poison a Pokémon with Immunity. Corrosion does not allow the Pokémon with this Ability to damage Steel-type Pokémon with Poison-type moves.\n\nIf the Pokémon with this Ability uses a move, and that move gets reflected by the target due to Magic Coat or Magic Bounce, the reflected move will not be able to poison Steel- or Poison-type Pokémon. If a Poison- or Steel-type Pokémon with this Ability poisons a target with Synchronize, Synchronize will not be able to affect the Pokémon with this Ability.\n\nOutside of battle\nCorrosion has no effect outside of battle."
    },
    "cursed body": {
        "name": "Cursed Body",
        "description": "May disable a move used on the Pokémon.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a damaging move, there is a 30% chance that the Cursed Body will disable that move of the attacking Pokémon for 4 turns (including the turn Cursed Body activates). Cursed Body can activate even if the attacker is behind a substitute or if the Pokémon with Cursed Body is knocked out, but will not activate if the attack hits the substitute of the Pokémon with Cursed Body.\n\nIf Cursed Body disables a multi-strike move before it has finished all of its hits, it will not prevent the other hits from being executed. Cursed Body can disable a move that calls another move if the called move dealt damage.\n\nIf a Pokémon uses a damaging Z-Move on a Pokémon with Cursed Body, that damaging Z-Move can be disabled (with no effect on the base move), despite Z-Moves only being able to be used once per battle. However, if Cursed Body would disable a status Z-Move (such as Z-Nature Power), the base status move will be disabled.\n\nOutside of battle\nCursed Body has no effect outside of battle."
    },
    "cute charm": {
        "name": "Cute Charm",
        "description": "Contact with the Pokémon may cause infatuation.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become infatuated if it is of the opposite gender to the Pokémon with this Ability. This Ability will not activate if the Pokémon with this Ability is genderless.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Cute Charm is in the first place in the party (even if fainted), there is a 66.7% chance that the game will force an encountered Pokémon to be the opposite gender from the Pokémon with Cute Charm if it can be that gender. This does not affect a swarming Pokémon species or Pokémon found in Hidden Grottos.\n\nEffects on personality value\nIn Generation IV only, when Cute Charm forces a Pokémon to be a specific gender, it does so by setting its personality value to one out of 25 possible values that correspond to the forced gender (one value per nature). The set of possible values depends on the gender of the Pokémon with Cute Charm, and, if the Pokémon with Cute Charm is female, the wild Pokémon's gender ratio. This has significant consequences for properties determined by personality value.\n\nAs a result, when the encountered species can be affected by Cute Charm (i.e., when it is not a male-only, female-only, or genderless species), the chances of encountering a Shiny Pokémon differ from the usual 1/8192, depending on how many of the 25 possible values forced by Cute Charm result in a Shiny Pokémon (in conjunction with the Trainer ID number and Secret ID): they may be as low as 1/24546 (if none of the 25 values forced by Cute Charm result in Shiny Pokémon, so the Pokémon can only be Shiny if Cute Charm fails), or as high as 21.34% (if 8 out of the 25 values forced by Cute Charm result in Shiny Pokémon).\n\nAdditionally, Spinda whose gender has been forced by Cute Charm in Generation IV only have one of 50 patterns (25 for male, 25 for female)."
    },
    "damp": {
        "name": "Damp",
        "description": "Prevents the use of explosive moves such as Self-Destruct by dampening its surroundings.",
        "effect": "In battle\nDamp prevents all Pokémon from using Self-Destruct, Explosion, and Mind Blown; if a Pokémon attempts to use one of these moves, it will fail and the user will not faint or take damage. Additionally, Damp prevents the Ability Aftermath from doing damage when the Pokémon with Aftermath faints.\n\nDamp affects non-adjacent Pokémon in Triple Battles.\n\nOutside of battle\nDamp has no effect outside of battle."
    },
    "dancer": {
        "name": "Dancer",
        "description": "When another Pokémon uses a dance move, it can use a dance move following it regardless of its Speed.",
        "effect": "In battle\nWhenever another Pokémon uses a dance move, a Pokémon with the Ability Dancer will immediately use that move as well. Using a move through Dancer is a separate action to using the move originally selected. Dancer will not activate for a move copied by another Pokémon with Dancer, but it will activate on an instructed dance move.\n\nDancer is able to copy a status dance move that has been powered up into its corresponding Z-Move (e.g. Z-Feather Dance), but the Pokémon with Dancer copies the regular version of the move and does not gain the additional Z-Power effect.\n\nDancer will not activate if the move's animation does not play (assuming battle animations are on): if all of the move's targets are protected from it, the move fails to affect any Pokémon (e.g. Teeter Dance if all of the targets are already confused or have Own Tempo), or all targets are immune (e.g. Electric-type Revelation Dance if the target is Ground-type). Dancer will not activate if the move is stolen by Snatch.\n\nIf multiple Pokémon have Dancer when a dance move is used, the slowest Pokémon will move first (Lagging Tail and Full Incense are ignored), even during Trick Room.\n\nIf the Pokémon with Dancer is confused, it may hurt itself instead of copying the move, even if it is protected by a move like Protect or Mat Block. If a Pokémon has flinched, this also applies to moves it subsequently tries to copy with Dancer. A Pokémon with Dancer that is locked into a consecutively executed move (such as Petal Dance) or any move by Encore or a held Choice item will still try to copy the move, but will fail unless it is locked into that same dance move; if a Pokémon uses Petal Dance via Dancer while locked into Petal Dance, this usage does not count towards the 2-3 turn duration. If a Pokémon with Dancer is holding an Assault Vest, it can still successfully copy status dance moves.\n\nLunar Dance is copied after the original user faints. If a Pokémon copies Petal Dance via Dancer, it will not be locked into the move. If Feather Dance is reflected by Magic Bounce or Magic Coat, Dancer will not activate for either the initial usage of the move or its reflected use. If the Pokémon with Dancer is under the effect of Taunt, it will still try to copy a status dance move, but will fail.\n\nMoves used via Dancer can be stolen by Snatch and reflected by Magic Bounce and Magic Coat. Moves used via Dancer are not considered the move used most recently (such as for the purpose of Instruct, Mimic or Mirror Move), but damage dealt by them is considered for the purpose of Mirror Coat and Metal Burst.\n\nOutside of battle\nDancer has no effect outside of battle."
    },
    "dark aura": {
        "name": "Dark Aura",
        "description": "Powers up each Pokémon's Dark-type moves.",
        "effect": "In battle\nDark Aura increases the damage dealt by Dark-type attacks by 33% for all Pokémon on the field. This effect is inverted by Aura Break, instead dividing the power of Dark-type attacks by 1.33, resulting in approximately a 25% reduction in damage.\n\nThe effects will not stack multiple times if more than one Pokémon has this Ability.\n\nOutside of battle\nDark Aura has no effect outside of battle."
    },
    "dazzling": {
        "name": "Dazzling",
        "description": "Surprises the opposing Pokémon, making it unable to attack using priority moves.",
        "effect": "In battle\nIf an opponent uses a priority move (including moves boosted by Prankster, Gale Wings or Triage) that targets the Pokémon with Dazzling or its allies, Dazzling prevents the Pokémon from executing that move (PP is still consumed). When this occurs, the text \"[Pokémon] cannot use [Move]!\" is displayed.\n\nMoves that target all Pokémon (except Perish Song, Flower Shield, and Rototiller) and moves that target all foes cannot be blocked by Dazzling even if they become priority moves. Dazzling has no effect on allies' priority moves.\n\nPriority status Z-Moves will have their Z-Power effect activate. For example, if a Pokémon with Prankster uses Z-Will-O-Wisp, it will get the Attack boost, but will not burn the target.\n\nMold Breaker will ignore this Ability.\n\nOutside of battle\nDazzling has no effect outside of battle."
    },
    "defeatist": {
        "name": "Defeatist",
        "description": "Halves the Pokémon's Attack and Sp. Atk stats when its HP becomes half or less.",
        "effect": "In battle\nDefeatist halves the user's Attack and Special Attack stats when its HP is equal to or less than half of its maximum.\n\nOutside of battle\nDefeatist has no effect outside of battle."
    },
    "defiant": {
        "name": "Defiant",
        "description": "Boosts the Pokémon's Attack stat sharply when its stats are lowered.",
        "effect": "In battle\nWhen a stat of a Pokémon with this Ability is lowered by an opponent, its Attack is increased by two stages. Defiant will not activate if the Pokémon with this Ability lowers its own stats (such as with Close Combat) or if its stats are lowered by an ally.\n\nIf multiple stats are lowered (such as by Memento or Venom Drench), Defiant activates for each stat lowered.\n\nIf the Pokémon with this Ability is holding a White Herb, if a stat other than Attack is lowered, Defiant will trigger before the White Herb, so the user will receive the Attack boost and then the lowered stat will be restored. If its Attack is lowered, Defiant will activate first, increasing its Attack so that the White Herb cannot activate.\n\nOutside of battle\nDefiant has no effect outside of battle."
    },
    "delta stream": {
        "name": "Delta Stream",
        "description": "The Pokémon changes the weather to eliminate all of the Flying type's weaknesses.",
        "effect": "In battle\nWhen a Pokémon with Delta Stream enters the battle or a Pokémon gains the Ability, a unique weather condition called mysterious air current is created. In a Rotation Battle, Delta Stream will not activate if the Pokémon is sent out in a rotated-out position, nor will it activate if the Pokémon is rotated in. In addition, Delta Stream will not activate if a mysterious air current is already present on the battlefield or if the Pokémon's Ability is suppressed prior to it gaining Delta Stream.\n\nA mysterious air current causes moves that would be super effective against pure Flying-type Pokémon to instead deal neutral damage to all Flying-type Pokémon (unless a Pokémon on the field has the Air Lock or Cloud Nine Ability). Outside of Inverse Battles, this causes Electric-, Ice-, and Rock-type moves to deal neutral damage to Flying-type Pokémon; during Inverse Battles, this causes Bug-, Fighting-, Grass-, and Ground-type moves to deal neutral damage to Flying-type Pokémon. If a move is not super effective against the Pokémon's other type (for dual-typed Pokémon), this no longer counts as a super-effective hit (for the purposes of damage-reducing Berries, etc.). A mysterious air current has no effect on Stealth Rock or Anticipation.\n\nAdditionally, a mysterious air current causes the weather-modifying moves Sunny Day, Rain Dance, Sandstorm, and Hail to fail if used; and causes the Abilities Drought, Drizzle, Sand Stream, and Snow Warning to fail to activate.\n\nThe mysterious air current will dissipate if the Pokémon is removed from the field (and no other Pokémon with Delta Stream remain on the field), if the Pokémon is rotated out in a Rotation Battle, if the Pokémon has its Ability suppressed or replaced, or if the Desolate Land or Primordial Sea Ability activates.\n\nOutside of battle\nDelta Stream has no effect outside of battle."
    },
    "desolate land": {
        "name": "Desolate Land",
        "description": "The Pokémon changes the weather to nullify Water-type attacks.",
        "effect": "In battle\nWhen a Pokémon with Desolate Land enters the battle or a Pokémon gains the Ability Desolate Land, the Ability creates extremely harsh sunlight, a unique variation of harsh sunlight. In a Rotation Battle, Desolate Land will not activate if the Pokémon is sent out in a rotated-out position, nor will it activate if the Pokémon is rotated in. In addition, Desolate Land will not activate if extremely harsh sunlight is already present on the battlefield.\n\nAlong with the usual effects of harsh sunlight, extremely harsh sunlight causes damage-dealing Water-type moves to fail (unless a Pokémon on the field has the Air Lock or Cloud Nine Ability). Additionally, extremely harsh sunlight causes the weather-modifying moves Sunny Day, Rain Dance, Sandstorm, and Hail to fail if used; and causes the Abilities Drought, Drizzle, Sand Stream, and Snow Warning to fail to activate.\n\nThe extremely harsh sunlight will fade if the Pokémon is removed from the field (and no other Pokémon with Desolate Land remain on the field), if the Pokémon is rotated out in a Rotation Battle, if the Pokémon has its Ability suppressed or replaced, or if the Primordial Sea or Delta Stream Ability activates.\n\nOutside of battle\nDesolate Land has no effect outside of battle."
    },
    "disguise": {
        "name": "Disguise",
        "description": "Once per battle, the shroud that covers the Pokémon can protect it from an attack.",
        "effect": "In battle\nIf a Mimikyu in its Disguised Form is hit by a damaging attack or hits itself in confusion, Disguise causes it to take no damage. When this effect activates, the message, \"Its disguise served it as a decoy!\" is displayed, Mimikyu changes to its Busted Form, and finally the message, \"<Name>'s disguise was busted!\" is displayed. If Mimikyu's type was changed, it is restored to Ghost/Fairy when it changes to its Busted Form.\n\nMimikyu remains in Busted Form if it is switched out, but reverts to Disguised Form outside of battle. If a Mimikyu faints and is revived, it will be revived in its Disguised Form and Disguise will be able to activate again.\n\nDisguise will not protect against entry hazards or weather damage. Disguise activates at the first strike of a multi-strike move such as Water Shuriken and will not block damage from remaining strikes. Disguise only blocks the damage from moves; additional effects of damaging moves like paralysis from Nuzzle are not prevented. If Mimikyu has a substitute, the substitute will take damage before Disguise.\n\nWeakness Policy will not activate if Disguise negates the damage, because it is treated as a neutral hit. A held Air Balloon will be popped even if the Disguise negates the damage.\n\nGastro Acid, Worry Seed, and Simple Beam fail if the target has the Ability Disguise. Role Play, Skill Swap, and Entrainment fail if either Pokémon has Disguise. Disguise cannot be copied by Trace, Power of Alchemy, or Receiver. Disguise cannot be replaced by Mummy or suppressed by Core Enforcer; if a Pokémon that has its Ability suppressed passes that effect to a Pokémon with this Ability via Baton Pass, that effect fades. If a Pokémon other than Mimikyu obtains Disguise with Imposter or Transform, the Ability will never activate.\n\nPokémon with Mold Breaker, Teravolt or Turboblaze will ignore Disguise, hitting through the disguise without busting it. The same is true for the moves Moongeist Beam, Sunsteel Strike, and Photon Geyser as well as the Z-Moves Searing Sunraze Smash, Menacing Moonraze Maelstrom and Light That Burns the Sky.\n\nOutside of battle\nDisguise has no effect outside of battle."
    },
    "download": {
        "name": "Download",
        "description": "Compares an opposing Pokémon's Defense and Sp. Def stats before raising its own Attack or Sp. Atk stat—whichever will be more effective.",
        "effect": "In battle\nDownload raises either the Attack stat or Special Attack stat by one stage depending on the foe's lowest current defensive stat: it will raise Attack if the foe's current Defense is lower than its current Special Defense stat, and Special Attack otherwise.\n\nFor determining which of the foe's defensive stat is lower, Download takes into account stat stages and the effect of Power Trick; however, it does not consider the effects of held items, Abilities such as Marvel Scale, or Wonder Room. In case of a tie between the foe's Defense and Special Defense, Download increases Special Attack.\n\nDuring a Double Battle, Download will add the two opposing Pokémon's stats and calculate the lower stat between both.\n\nOutside of battle\nDownload has no effect outside of battle."
    },
    "drizzle": {
        "name": "Drizzle",
        "description": "The Pokémon makes it rain when it enters a battle.",
        "effect": "In battle\nGenerations III to V\nDrizzle summons rain in battle as soon as a Pokémon with Drizzle enters the battle. Its effects are the same as the move Rain Dance, but instead of lasting for a limited amount of turns, it lasts for the whole battle (unless it is replaced by another type of weather). If a Pokémon with Drizzle is sent out in the same turn as another Pokémon whose Ability affects the weather, the slower Pokémon's Ability will override the faster Pokémon's Ability.\n\nGeneration VI\nThe rain now lasts only for five turns. This can be extended to eight turns if the Pokémon is holding a Damp Rock.\n\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Drizzle will fail to activate.\n\nOutside of battle\nDrizzle has no effect outside of battle."
    },
    "drought": {
        "name": "Drought",
        "description": "Turns the sunlight harsh when the Pokémon enters a battle.",
        "effect": "In battle\nGenerations III to V\nDrought summons harsh sunlight in battle as soon as a Pokémon with Drought enters the battle. Its effects are the same as the move Sunny Day, but instead of lasting for a limited amount of turns, it lasts for the whole battle (unless it is replaced by another weather condition). If a Pokémon with Drought is sent out in the same turn as another Pokémon whose Ability affects the weather, the slower Pokémon's Ability will override the faster Pokémon's Ability.\n\nGeneration VI\nThe sunlight now lasts only for five turns. This can be extended to eight turns if the Pokémon is holding a Heat Rock.\n\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Drought will fail to activate.\n\nOutside of battle\nDrought has no effect outside of battle."
    },
    "dry skin": {
        "name": "Dry Skin",
        "description": "Restores HP in rain or when hit by Water-type moves. Reduces HP in harsh sunlight, and increases the damage received from Fire-type moves.",
        "effect": "In battle\nDuring harsh sunlight, a Pokémon with Dry Skin will lose ⅛ of its maximum HP at the end of each turn. During rain, a Pokémon with Dry Skin will regain ⅛ of its maximum HP at the end of each turn.\n\nFire-type attacks do 25% more damage to a Pokémon with Dry Skin.\n\nWhen a Pokémon with Dry Skin is hit by a Water-type move, its HP is restored by one quarter of its maximum HP, and the move will have no effect on that Pokémon (if a Pokémon with this Ability already has full HP, the Water-type move will do nothing). This effect will not activate if the Pokémon is protected from the Water-type move.\n\nIf a Pokémon with Dry Skin is holding an Absorb Bulb or Luminous Moss, Dry Skin absorbs the Water-type move so the item's effect is not triggered.\n\nOutside of battle\nDry Skin has no effect outside of battle."
    },
    "early bird": {
        "name": "Early Bird",
        "description": "The Pokémon awakens twice as fast as other Pokémon from sleep.",
        "effect": "In battle\nEarly Bird causes quick awakening from sleep. In the turn the Pokémon is put to sleep, the number of turns it will remain asleep is preset. If it is 6 turns, it will be halved to 3. If 3, it will be rounded to 1. If only 1 turn is preset, it is rounded to 0, causing the Pokémon to instantly wake up at the end of the same turn. This also applies to the self-induced sleep from Rest, reducing its length from 3 to 1 turn.\n\nOutside of battle\nEarly Bird has no effect outside of battle."
    },
    "effect spore": {
        "name": "Effect Spore",
        "description": "Contact with the Pokémon may inflict poison, sleep, or paralysis on its attacker.",
        "effect": "In battle\nGenerations III to V\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become poisoned, paralyzed or asleep: there is a 9% chance of poison, 10% chance of paralysis, and 11% chance of sleep.[1]\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\n\nGeneration VI onward\nGrass-type Pokémon, Pokémon with Overcoat, and Pokémon holding Safety Goggles are now immune to Effect Spore.\n\nOutside of battle\nEffect Spore has no effect outside of battle."
    },
    "electric surge": {
        "name": "Electric Surge",
        "description": "Turns the ground into Electric Terrain when the Pokémon enters a battle.",
        "effect": "In battle\nWhen a Pokémon with Electric Surge enters the battle, it creates the effect of the move Electric Terrain on the battlefield.\n\nOutside of battle\nElectric Surge has no effect outside of battle."
    },
    "emergency exit": {
        "name": "Emergency Exit",
        "description": "The Pokémon, sensing danger, switches out when its HP becomes half or less.",
        "effect": "In battle\nWhen a Pokémon with Emergency Exit drops below half of its full HP in battle, it will flee in wild battles, or switch out in Trainer battles. It can only activate when a Pokémon's HP falls from above half to below half; if it does not activate at that time, it will not activate at all (unless the Pokémon with this Ability restores HP).\n\nEmergency Exit will not activate if the Pokémon's HP falls below half due to hurting itself in confusion, hail, sandstorm or using Substitute. This Ability will not activate if the HP of the Pokémon with this Ability is restored to above half immediately after it drops below half (such as due to a held Sitrus Berry).\n\nEmergency Exit will not activate if the Pokémon's HP falls below half by a move affected by Sheer Force.\n\nIt will activate only after the last hit of multi-strike moves, even if the HP of the Pokémon with this Ability drops below half before the last hit. If this Ability activates due to being hit by U-turn or Volt Switch, the user of that move will not be switched out. This Ability will not activate if the Pokémon's HP falls below half while it is in the air during the semi-invulnerable turn of Sky Drop.\n\nTrapping moves do not prevent Emergency Exit from activating.\n\nIf the Pokémon with Emergency Exit holds a Red Card or Eject Button, the item activates first. Dragon Tail and Circle Throw switch out Pokémon before the Ability activates.\n\nEmergency Exit will not activate on the player's Pokémon in wild battles during trials.\n\nOutside of battle\nEmergency Exit has no effect outside of battle."
    },
    "fairy aura": {
        "name": "Fairy Aura",
        "description": "Powers up each Pokémon's Fairy-type moves.",
        "effect": "In battle\nFairy Aura increases the damage dealt by Fairy-type attacks by 33% for all Pokémon on the field. This effect is inverted by Aura Break, instead dividing the power of Fairy-type attacks by 1.33, resulting in approximately a 25% reduction in damage.\n\nThe effects will not stack multiple times if more than one Pokémon has this Ability.\n\nOutside of battle\nFairy Aura has no effect outside of battle."
    },
    "filter": {
        "name": "Filter",
        "description": "Reduces the power of supereffective attacks taken.",
        "effect": "In battle\nFilter reduces damage from supereffective moves by ¼ (regardless of the effectiveness multiplier).\n\nOutside of battle\nFilter has no effect outside of battle."
    },
    "flame body": {
        "name": "Flame Body",
        "description": "Contact with the Pokémon may burn the attacker.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become burned.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\n\nOutside of battle\nFrom Pokémon Emerald onward, if a Pokémon with Flame Body is in the party (even if fainted), the number of cycles it takes for all Pokémon Eggs in the party to hatch are halved. This effect does not stack with itself or Magma Armor; however, it can be stacked with Hatching Power Pass Power, O-Power, or Roto Hatch."
    },
    "flare boost": {
        "name": "Flare Boost",
        "description": "Powers up special attacks when the Pokémon is burned.",
        "effect": "In battle\nWhile the Pokémon with this Ability is burned, the power of its special moves is increased by 50%.\n\nOutside of battle\nFlare Boost has no effect outside of battle."
    },
    "flash fire": {
        "name": "Flash Fire",
        "description": "Powers up the Pokémon's Fire-type moves if it's hit by one.",
        "effect": "In battle\nGeneration III\nFlash Fire makes the Pokémon immune to Fire-type moves and will activate when hit by one. When activated, the power of the Pokémon's Fire-type moves is increased by 50%. While subsequent hits by Fire-type moves will not provide further increases in power, the Pokémon remains immune to the moves.\n\nFlash Fire will not activate if the Pokémon is protected from the Fire-type move.\n\nFlash Fire will not work while the user is frozen.\n\nGeneration IV\nInstead of boosting Fire-type moves' power, Flash Fire now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Fire-type move is being used, resulting in effectively the same effect.\n\nGeneration V onwards\nFlash Fire is now functional even if the user is frozen.\n\nOutside of battle\nFlash Fire has no effect outside of battle."
    },
    "flower gift": {
        "name": "Flower Gift",
        "description": "Boosts the Attack and Sp. Def stats of itself and allies in harsh sunlight.",
        "effect": "In battle\nGeneration IV\nDuring harsh sunlight, Flower Gift increases the Attack and Special Defense stats of the Pokémon with this Ability and its allies by 1.5×.\n\nFlower Gift is not responsible for changing Cherrim from Overcast Form into Sunshine Form.\n\nFlower Gift can be copied by Trace or Role Play.\n\nGeneration V onward\nAlong with its previous effect, Flower Gift now changes Cherrim from Overcast Form to Sunshine Form during harsh sunlight. If Cherrim loses Flower Gift or Flower Gift is suppressed (such as by Gastro Acid), it will revert to its Overcast Form.\n\nRole Play fails if the target has the Ability Flower Gift. Entrainment fails if the user has the Ability Flower Gift. Flower Gift cannot be copied by Trace, Power of Alchemy, or Receiver.\n\nOutside of battle\nFlower Gift has no effect outside of battle."
    },
    "flower veil": {
        "name": "Flower Veil",
        "description": "Ally Grass-type Pokémon are protected from status conditions and the lowering of their stats.",
        "effect": "In battle\nFlower Veil prevents the Pokémon with this Ability (if it is Grass-type) and its Grass-type allies (including non-adjacent allies) from having their stats lowered. Self-inflicted stat reductions, such as from Leaf Storm or Weak Armor, are not prevented. If a Grass-type Pokémon has Contrary, Flower Veil prevents the Pokémon's stats from being lowered after accounting for Contrary.\n\nFlower Veil also prevents the Pokémon with this Ability (if it is Grass-type) and its Grass-type allies (including non-adjacent allies) from being afflicted by non-volatile status conditions or Yawn. However, it will not prevent a Pokémon from falling asleep if it is already drowsy from Yawn. This Ability has no effect on Rest, the Flame Orb, and the Toxic Orb.\n\nWhen a Pokémon with Mold Breaker, Turboblaze or Teravolt uses a move, the effects of Flower Veil (including allies') are ignored for the duration of that move. As such, if the move of a Grass-type Pokémon with one of these Abilities triggers Flame Body, Poison Point, Static, Synchronize, Gooey, or Tangling Hair, it will not be protected by Flower Veil.\n\nOutside of battle\nIt is unknown if Flower Veil has an effect outside of battle."
    },
    "fluffy": {
        "name": "Fluffy",
        "description": "Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.",
        "effect": "In battle\nA Pokémon with Fluffy takes half damage from moves that make contact. It also takes double damage from Fire-type moves. Fire-type moves that make contact will deal regular damage. Moves affected by Long Reach or the Protective Pads that make contact will deal regular damage.\n\nOutside of battle\nFluffy has no effect outside of battle."
    },
    "forecast": {
        "name": "Forecast",
        "description": "The Pokémon transforms with the weather to change its type to Water, Fire, or Ice.",
        "effect": "In battle\nDepending on the weather, Forecast will change Castform's form, which also changes its type. Castform changes as follows:\n\n- During harsh sunlight or extremely harsh sunlight, it will become Sunny Form, which is Fire-type.\n- During hail, it will become Snowy Form, which is Ice-type.\n- During rain or heavy rain, it will become Rainy Form, which is Water-type.\n- During a sandstorm, fog, a mysterious air current, a shadowy aura, or clear weather it will revert to its normal form, which is Normal-type.\n  -It will also revert to its normal form if a Pokémon on the field has Cloud Nine or Air Lock.\nThis Ability has no effect on Pokémon other than Castform.\n\nForecast does not change Castform's form until after Stealth Rock deals damage.\n\nGeneration III\nIf a Pokémon transforms into Castform with Forecast, it will change forms with the weather just like Castform.\n\nIf Castform or a Pokémon transformed into Castform loses Forecast, it will be stuck in its current form. When it regains Forecast, it will change to the form matching the current weather, even if it is already in the correct form (which resets its type if it had changed due to an effect like Color Change).\n\nForecast can be copied by Role Play and Trace.\n\nGeneration IV\nIf Forecast is suppressed with Gastro Acid, it will be stuck in its current form.\n\nForecast cannot be copied by Trace.\n\nGeneration V onward\nIf a Pokémon transforms into Castform, the Pokémon will remain in the same form as the target Castform, regardless of the weather.\n\nIf Castform loses Forecast or Forecast is suppressed with Gastro Acid, it will revert to its normal form and not be able to change form. If Castform regains Forecast, it will change form to match the current weather, unless it would be in its normal form in the current weather.\n\nRole Play fails if the target has the Ability Forecast. Entrainment fails if the user has the Ability Forecast. Forecast cannot be copied by Power of Alchemy or Receiver.\n\nOutside of battle\nForecast has no effect outside of battle."
    },
    "forewarn": {
        "name": "Forewarn",
        "description": "When it enters a battle, the Pokémon can tell one of the moves an opposing Pokémon has.",
        "effect": "In battle\nForewarn shows the opponent's move with the highest power. If two or more moves are of the same power, one will be chosen at random.\n\nIn a Double Battle, Forewarn will only show the highest power move out of all the moves known by both opponents. If both opponents have a move with the same power, one will be chosen at random.\n\nDamaging moves without a power (i.e. moves that deal direct damage and moves that have variable power) are assigned one.\n\nOutside of battle\nForewarn has no effect outside of battle."
    },
    "friend guard": {
        "name": "Friend Guard",
        "description": "Reduces damage done to allies.",
        "effect": "In battle\nFriend Guard reduces the damage done to allies by 25%. It does not reduce the damage dealt by moves that deal direct damage.\n\nOutside of battle\nFriend Guard has no effect outside of battle."
    },
    "frisk": {
        "name": "Frisk",
        "description": "When it enters a battle, the Pokémon can check an opposing Pokémon's held item.",
        "effect": "In battle\nFrisk allows the Pokémon to see the opponent's held item upon entering battle. If the foe is holding an item, a message identifying the item will be shown right after the Pokémon with Frisk enters the battle. If the foe is not holding an item, no message will appear.\n\nIn a Double Battle, an unidentified opponent is randomly chosen and their held item revealed.\n\nGeneration VI\nFrisk now identifies the held items of all opposing Pokémon, regardless of position.\n\nOutside of battle\nFrisk has no effect outside of battle."
    },
    "full metal body": {
        "name": "Full Metal Body",
        "description": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
        "effect": "In battle\nFull Metal Body prevents stat reduction caused by another Pokémon's move or Ability.[1]\n\nFull Metal Body does not prevent stat reduction as a side effect from paralysis or burning. Full Metal Body also does not prevent stat losses caused by Heart Swap, Guard Swap, Power Swap, Guard Split, Power Split, Baton Pass, and Topsy-Turvy.\n\nUnlike its similar variations, this Ability is not ignored by Mold Breaker, Teravolt, and Turboblaze.[2]\n\nOutside of battle\nFull Metal Body has no effect outside of battle."
    },
    "fur coat": {
        "name": "Fur Coat",
        "description": "Halves the damage from physical moves.",
        "effect": "In battle\nFur Coat doubles the Defense stat of the Pokémon with this Ability.\n\nOutside of battle\nFur Coat has no effect outside of battle."
    },
    "gale wings": {
        "name": "Gale Wings",
        "description": "Gives priority to Flying-type moves when the Pokémon's HP is full.",
        "effect": "In battle\nGeneration VI\nGale Wings increases the priority of Flying-type moves by one. Affected Flying-type attacks and offensive status moves can be blocked by Quick Guard.\n\nThis Ability does not increase the priority of Flying-type Hidden Power, Natural Gift, or Judgment, as they are treated as Normal-type moves before being used.\n\nGeneration VII\nGale Wings now works only if the user has full HP.\n\nOutside of battle\nGale Wings has no effect outside of battle."
    },
    "galvanize": {
        "name": "Galvanize",
        "description": "Normal-type moves become Electric-type moves. The power of those moves is boosted a little.",
        "effect": "In battle\nGalvanize causes all Normal-type moves used by the Pokémon to become Electric-type and receive a 20% power boost.\n\nOutside of battle\nGalvanize has no effect outside of battle."
    },
    "gluttony": {
        "name": "Gluttony",
        "description": "Makes the Pokémon eat a held Berry when its HP drops to half or less, which is sooner than usual.",
        "effect": "In battle\nGluttony causes the Pokémon to eat Berries that would normally be eaten at 25% HP or lower at 50% HP or lower instead. It has no effect on Berries such as the Oran Berry, which are normally eaten at 50% HP or less. It also has no effect on the use of Berries with non-HP-related trigger conditions, such as the Leppa Berry and Lum Berry.\n\nOutside of battle\nGluttony has no effect outside of battle."
    },
    "gooey": {
        "name": "Gooey",
        "description": "Contact with the Pokémon lowers the attacker's Speed stat.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, the Speed of the attacking Pokémon is decreased by one stage.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit activates this Ability.\n\nOutside of battle\nIt is unknown if Gooey has an effect outside of battle."
    },
    "grass pelt": {
        "name": "Grass Pelt",
        "description": "Boosts the Pokémon's Defense stat in Grassy Terrain.",
        "effect": "In battle\nWhile Grassy Terrain is active, the Defense of the Pokémon with this Ability is increased by 50%.\n\nOutside of battle\nGrass Pelt has no effect outside of battle."
    },
    "grassy surge": {
        "name": "Grassy Surge",
        "description": "Turns the ground into Grassy Terrain when the Pokémon enters a battle.",
        "effect": "In battle\nWhen a Pokémon with Grassy Surge enters the battle, it creates the effect of the move Grassy Terrain on the battlefield.\n\nOutside of battle\nGrassy Surge has no effect outside of battle."
    },
    "guts": {
        "name": "Guts",
        "description": "It's so gutsy that having a status condition boosts the Pokémon's Attack stat.",
        "effect": "In battle\nWhile a Pokémon with this Ability has a status condition, its Attack is increased by 50%. Additionally, a Pokémon with this Ability does not lose Attack due to burn.\n\nThe Attack boost from Guts does not activate if a Pokémon is frozen and uses a move which thaws it out, such as Flame Wheel or Flare Blitz.\n\nOutside of battle\nGuts has no effect outside of battle."
    },
    "harvest": {
        "name": "Harvest",
        "description": "May create another Berry after one is used.",
        "effect": "In battle\nIf the Pokémon has used a Berry, there is a 50% chance of it being restored at the end of each turn. The held Berry is remembered even if it is not restored or if the Pokémon has switched out. Harvest will always activate in harsh sunlight.\n\nHarvest can recover Berries consumed by Fling and Natural Gift; however, Harvest cannot recover Berries transferred to another Pokémon, Berries destroyed by Incinerate, Berries knocked off with Knock Off, or Berries eaten with Bug Bite or Pluck. Harvest cannot restore a Berry if it is collected by a Pokémon with Pickup. If more than one Pokémon has Pickup or Harvest, the faster Pokémon will restore an item first.\n\nA single Pokémon's Harvest will not activate more than once per turn. If the held Berry is consumed immediately after it is restored, Harvest will not be able to restore it again until the next turn.\n\nHarvest can recover Berries consumed that were originally another Pokémon's, but transferred to the Pokémon with Harvest. However, a Pokémon may only have one consumed item (including non-Berries) at a time; if a Pokémon consumes a Berry, obtains another item and consumes it, the original consumed Berry cannot be restored, even if the second item is restored and swapped away. If the Pokémon with Harvest obtains an item after consuming a Berry, Harvest can still restore the old Berry as long as the Pokémon has no hold item and did not consume any other items (including non-Berries) since consuming the old Berry.\n\nOutside of battle\nHarvest has no effect outside of battle."
    },
    "healer": {
        "name": "Healer",
        "description": "Sometimes heals an ally's status condition.",
        "effect": "In battle\nAt the end of each turn, Healer has a 30% chance of curing an adjacent ally's status condition. If the Pokémon has multiple adjacent allies with status conditions, it has an independent 30% chance of curing each one, and can cure more than one in the same turn. If it cures a status condition, it does so before burn or poison damage is dealt on that turn.\n\nOutside of battle\nHealer has no effect outside of battle."
    },
    "heatproof": {
        "name": "Heatproof",
        "description": "The heatproof body of the Pokémon halves the damage from Fire-type moves that hit it.",
        "effect": "In battle\nHeatproof halves the damage done by Fire-type attacks and the burn status ailment.\n\nOutside of battle\nHeatproof has no effect outside of battle."
    },
    "heavy metal": {
        "name": "Heavy Metal",
        "description": "Doubles the Pokémon's weight.",
        "effect": "In battle\nThe user's weight is doubled. This may increase the base power of the user's Heavy Slam and Heat Crash, increase the damage taken from the opponent's Low Kick and Grass Knot, and lower the damage taken from the opponent's Heavy Slam and Heat Crash.\n\nOutside of battle\nHeavy Metal has no effect outside of battle."
    },
    "honey gather": {
        "name": "Honey Gather",
        "description": "The Pokémon may gather Honey after a battle.",
        "effect": "In battle\nHoney Gather has no effect during battle.\n\nOutside of battle\nA Pokémon with Honey Gather may collect Honey after a battle if it is not already holding a held item, similar to Pickup. The chance for a Pokémon with Honey Gather to pick up Honey depends on its level, starting at 5% if the Pokémon is between levels 1 and 10, and going up by 5% every ten levels, ending at a 50% chance from levels 91-100."
    },
    "huge power": {
        "name": "Huge Power",
        "description": "Doubles the Pokémon's Attack stat.",
        "effect": "In battle\nHuge Power doubles the Attack stat of the Pokémon with this Ability.\n\nOutside of battle\nHuge Power has no effect outside of battle."
    },
    "hustle": {
        "name": "Hustle",
        "description": "Boosts the Attack stat, but lowers accuracy.",
        "effect": "In battle\nHustle increases the user's Attack stat by 50%, but lowers the accuracy of the user's physical moves by 20%. Special moves and status moves are unaffected by Hustle.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Hustle is in the first place in the party (even if fainted), the chance of encountering a high-leveled wild Pokémon increases by 50% (so an otherwise 25% chance would become 75%). It shares this effect with Pressure and Vital Spirit."
    },
    "hydration": {
        "name": "Hydration",
        "description": "Heals status conditions if it's raining.",
        "effect": "In battle\nAt the end of each turn, if it is raining, Hydration will cure the Pokémon of any non-volatile status condition. If it cures a status condition, it does so before burn or poison damage is dealt on that turn. Pokémon who are made drowsy by Yawn will not fall asleep until after Hydration takes effect, and as such, will not be healed until the end of the next turn.\n\nOutside of battle\nHydration has no effect outside of battle."
    },
    "hyper cutter": {
        "name": "Hyper Cutter",
        "description": "The Pokémon's proud of its powerful pincers. They prevent other Pokémon from lowering its Attack stat.",
        "effect": "In battle\nHyper Cutter prevents other Pokémon from lowering the Attack stat stage of the Pokémon with this Ability. It does not prevent the Pokémon with this Ability from lowering its own Attack, such as by using Superpower.\n\nEffects that decrease Attack without using stat stages, such as Power Swap, Heart Swap, and Power Split, are unaffected by Hyper Cutter.\n\nThis Ability can be ignored with Mold Breaker, Teravolt, and Turboblaze.\n\nOutside of battle\nIn Pokémon Emerald, if a Pokémon with Hyper Cutter uses Cut in the overworld, it will remove all tall grass within a two-square radius of the player's position, as opposed to a one-square radius without this Ability. From Generation IV onward, Hyper Cutter has no effect outside of battle due to the removal of the ability to cut tall grass."
    },
    "ice body": {
        "name": "Ice Body",
        "description": "The Pokémon gradually regains HP in a hailstorm.",
        "effect": "In battle\nDuring hail, a Pokémon with Ice Body will regain 1/16 of its maximum HP at the end of each turn. A Pokémon with this Ability will take no damage from hail if it otherwise would.\n\nOutside of battle\nIce Body has no effect outside of battle."
    },
    "illuminate": {
        "name": "Illuminate",
        "description": "Raises the likelihood of meeting wild Pokémon by illuminating the surroundings.",
        "effect": "In battle\nIlluminate has no effect during battle.\n\nOutside of battle\nIf a Pokémon with Illuminate is in the first place in the party (even if fainted), the wild Pokémon encounter rate increases by 100%. From Pokémon Emerald onwards, it shares this trait with Arena Trap and Swarm."
    },
    "illusion": {
        "name": "Illusion",
        "description": "Comes out disguised as the Pokémon in the party's last spot.",
        "effect": "In battle\nGeneration V\nIllusion will change the appearance of the Pokémon to that of the last Pokémon in the player's party. Illusion will not disguise the Pokémon if the last Pokémon in the player's party is fainted or is of the same species. Illusion will replicate the type of Poké Ball, nickname (or species name if none), Shininess (if any), gender, and form of the Pokémon it is masquerading as; however, it does not replicate the level of the masqueraded Pokémon. If an Egg is in the last position, the Pokémon that is in the Egg will be shown. The effect is only aesthetic: effects like the move Attract still use the Pokémon's actual gender.\n\nThe illusion wears off when the Pokémon with this Ability is directly damaged by a damaging move or when Illusion is negated or replaced, causing the Pokémon with this Ability to appear as its true self. Indirect damage or loss of HP (such as through Substitute, Life Orb, weather, status conditions, entry hazards, recoil, and so on) will not break Illusion. If the Pokémon with Illusion is hit by a multi-strike move, the illusion will be broken after the first hit.\n\nA Pokémon with Illusion can disguise itself as another Pokémon with Illusion, provided that they are different species.\n\nRole Play fails if the target has the Ability Illusion. Skill Swap fails if either Pokémon has Illusion. Illusion cannot be copied by Trace. If a Pokémon obtains this Ability with Imposter or Transform, it will not disguise itself.\n\nIn Pokémon Black and White, if the player visits Lostlorn Forest with a GameStop Entei, Raikou, and/or Suicune in their party, they can encounter a Zoroark, which enters the battle already disguised as the Legendary beast that has a type advantage over the beast closest to the first slot in the player's party (Entei in case of Raikou).\n\nGeneration VI\nIllusion can now disguise itself as another Pokémon with Illusion of the same species.\n\nIllusion now disguises the Pokémon as the last conscious Pokémon in the party.\n\nGeneration VII\nOn the user interface, an opponent's Pokémon disguised by Illusion will appear to be the same type as the species it is disguised as (even if it is affected by a move such as Soak).\n\nIf a Pokémon with Illusion uses a Z-Move, the illusion wears off immediately before using the Z-Move.\n\nIllusion cannot be copied by Power of Alchemy or Receiver.\n\nIf a Pokémon with Illusion successfully calls for help in an SOS Battle, it will disguise itself as the summoned ally.\n\nOutside of battle\nIllusion has no effect outside of battle."
    },
    "immunity": {
        "name": "Immunity",
        "description": "The immune system of the Pokémon prevents it from getting poisoned.",
        "effect": "In battle\nImmunity prevents the Pokémon from being afflicted by poison.\n\nA Pokémon with this Ability will be cured of poison if it is poisoned while in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is poisoned by a Pokémon with an Ability like Mold Breaker).\n\nGeneration III\nIf a poisoned Pokémon with Immunity is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Immunity due to Trace, it will not be cured of poison until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of poison if it is switched in to replace a switched out Pokémon.\n\nIf a poisoned Pokémon has Immunity as its original Ability but not its current Ability, it will remain poisoned when switched out.\n\nIf the Pokémon with this Ability is poisoned and is holding a Pecha, Lum, or Drash Berry, Immunity will cure the Pokémon of poison before the Berry has a chance to be consumed.\n\nGeneration IV\nWhen a poisoned Pokémon with Immunity enters battle, it will be cured of poison.\n\nIf a poisoned Pokémon has Immunity as its original Ability but not its current Ability, if it is one of the active Pokémon at the end of the battle or switched out, it will be cured of poison (with no message).\n\nGeneration V onward\nIf a poisoned Pokémon has Immunity as its original Ability but not its current Ability, it will remain poisoned when switched out.\n\nIf the Pokémon with this Ability is poisoned and is holding a Pecha or Lum Berry, the Berry will be eaten and cure the Pokémon of poison before Immunity has a chance to activate.\n\nA Pokémon with Immunity can be poisoned by Sunsteel Strike if the attacker has Poison Touch, but will be cured of poison immediately.\n\nOutside of battle\nPokémon with this Ability can't take damage from poison outside of battle.\n\nIf a poisoned Pokémon gains Immunity by evolution or the Ability Capsule, it will not be cured of poison until sent into battle. Pokémon with Immunity will not be poisoned by the Gentleman's Kirlia in the Battle Pike nor the Battle Arcade's game board."
    },
    "imposter": {
        "name": "Imposter",
        "description": "The Pokémon transforms itself into the Pokémon it's facing.",
        "effect": "In battle\nAs soon as the user comes into battle, it transforms into its opponent. Imposter copies the target's appearance, cry, moves (which all have 5 PP), Ability, stats (except HP), stat changes (but not stat multipliers such as with Choice Specs), weight, and Mega Evolution or form (regardless of held item). Imposter does not copy its opponent's IVs (for the purpose of Hidden Power), friendship or gender.\n\nImposter will not activate if the opponent is transformed, disguised with Illusion, or behind a substitute. Imposter only activates when the Pokémon with the Ability is sent out; if it fails to transform into an opponent, it will not activate unless the Pokémon with Imposter is withdrawn and sent out again.\n\nIn Double Battles, Triple Battles, and Battle Royals, Imposter will copy the opponent in the position directly opposite it. If there is no opponent directly opposite it, it will not transform.\n\nA transformed Pokémon can use moves exclusive to a species it has transformed into, such as Hyperspace Fury if transformed into Hoopa Unbound. A transformed Pokémon can use Z-Moves exclusive to a species it has transformed into, if it holds an appropriate Z-Crystal. If the Pokémon with this Ability has transformed into a Mega-Evolved Pokémon, it cannot use any Z-Moves, even if it holds an appropriate Z-Crystal.\n\nRole Play fails if the target has the Ability Imposter. Entrainment fails if the user has the Ability Imposter. Imposter cannot be copied by Trace, Power of Alchemy, or Receiver.\n\nEven if a Pokémon transforms into Meteor Form Minior, Shields Down will not prevent a transformed Pokémon from being afflicted with status conditions.\n\nIf the Pokémon with this Ability transforms into a Pokémon that has no type (i.e. it was a pure Fire type that used Burn Up), the transformed Pokémon will become Normal-type; if such a Pokémon has additionally been affected by Forest's Curse or Trick-or-Treat, the user will become Normal-type with an added Grass or Ghost type respectively. If the Pokémon with this Ability transforms into a dual-typed Pokémon that has used Burn Up, however, Imposter will copy the user's current types (and type additions) as usual.\n\nOutside of battle\nImposter has no effect outside of battle."
    },
    "infiltrator": {
        "name": "Infiltrator",
        "description": "Passes through the opposing Pokémon's barrier, substitute, and the like and strikes.",
        "effect": "In battle\nGeneration V\nA Pokémon with Infiltrator ignores the effects of a target's Reflect, Light Screen, Safeguard, and Mist.\n\nGeneration VI onwards\nInfiltrator now allows Pokémon to bypass Substitute. It can also ignore Aurora Veil.\n\nOutside of battle\nInfiltrator has no effect outside of battle"
    },
    "innards out": {
        "name": "Innards Out",
        "description": "Damages the attacker landing the finishing hit by the amount equal to its last HP.",
        "effect": "In battle\nWhen a Pokémon with this Ability is knocked out by an opponent's attack, it deals damage to that opponent equal to the amount of HP it had left before last being hit.\n\nIf a Pokémon with this Ability faints through Future Sight or Doom Desire, Innards Out will only activate if the user of the move is still on the field.\n\nOutside of battle\nInnards Out has no effect outside of battle."
    },
    "inner focus": {
        "name": "Inner Focus",
        "description": "The Pokémon's intensely focused, and that protects the Pokémon from flinching.",
        "effect": "In battle\nInner Focus prevents the Pokémon from flinching. However, Pokémon with this Ability can still flinch to a Pokémon with Mold Breaker, Teravolt or Turboblaze.\n\nWhile some descriptions state that the user flinches, Focus Punch failing due to taking damage is not flinching, so the move is unaffected by Inner Focus.\n\nIf the Pokémon is hit by a move that always causes flinching, the message \"<Pokémon>'s Inner Focus prevents flinching!\" (Generation III) or \"<Pokémon> won't flinch because of its Inner Focus!\" (Generation IV) will appear.\n\nOutside of battle\nInner Focus has no effect outside of battle."
    },
    "insomnia": {
        "name": "Insomnia",
        "description": "The Pokémon is suffering from insomnia and cannot fall asleep.",
        "effect": "In battle\nInsomnia prevents the Pokémon from being afflicted by sleep and Yawn. Rest will fail when used by the Pokémon.\n\nA Pokémon with this Ability will wake up if it is asleep in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is put to sleep by a Pokémon with an Ability like Mold Breaker).\n\nIf a Pokémon with this Ability is drowsy due to Yawn, when it would fall asleep the Ability activates and keeps it awake.\n\nThe move Worry Seed can change the target Pokémon's Ability to Insomnia.\n\nGeneration III\nIf a sleeping Pokémon with Insomnia is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Insomnia due to Trace, it will not be cured of sleep until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of sleep if it is switched in to replace a switched out Pokémon.\n\nIf a sleeping Pokémon has Insomnia as its original Ability but not its current Ability, it will remain asleep when switched out.\n\nIf the Pokémon with this Ability is asleep and is holding a Chesto or Lum Berry, Insomnia will cure the Pokémon of sleep before the Berry has a chance to be consumed.\n\nGeneration IV\nThere is no known way for a sleeping Pokémon with Insomnia to enter battle.\n\nIf a sleeping Pokémon has Insomnia as its original Ability but not its current Ability, if it is one of the active Pokémon at the end of the battle or switched out, it will be cured of sleep (with no message).\n\nGeneration V onward\nWhen a sleeping Pokémon with Insomnia enters battle, it will be cured of sleep.\n\nIf a sleeping Pokémon has Insomnia as its original Ability but not its current Ability, it will remain asleep when switched out.\n\nIf the Pokémon with this Ability is asleep and is holding a Chesto or Lum Berry, the Berry will be eaten and cure the Pokémon of sleep before Insomnia has a chance to activate.\n\nOutside of battle\nIf a sleeping Pokémon gains Insomnia by evolution or the Ability Capsule, it will not wake up until sent into battle. Pokémon with Insomnia will not be put to sleep by the Gentleman's Kirlia in the Battle Pike nor the Battle Arcade's game board."
    },
    "intimidate": {
        "name": "Intimidate",
        "description": "The Pokémon intimidates opposing Pokémon upon entering battle, lowering their Attack stat.",
        "effect": "In battle\nGeneration III\nWhen a Pokémon with Intimidate enters the battle, it lowers the Attack stat of all adjacent opponents by one stage.\n\nIn Generations III and IV, Intimidate's activation message reads, \"<Pokémon>'s Intimidate cuts <opponent>'s attack!\" In Generation V, the message changed to \"<Opponent>'s Attack fell!\"\n\nIntimidate has no effect on Pokémon who are immune to Attack stat reductions, such as Pokémon with Clear Body, Hyper Cutter, or White Smoke. This Ability will not affect a target with a substitute.\n\nGeneration IV onward\nIntimidate now also activates when a Pokémon gains the Ability, such as via Skill Swap or Mega Evolution.\n\nIn a Triple Battle, Intimidate does not affect non-adjacent Pokémon.\n\nIntimidate does not affect Pokémon with the Full Metal Body Ability.\n\nWild Pokémon are more likely to call for help when facing a Pokémon with Intimidate. It shares this effect with Pressure and Unnerve.\n\nIf a Pokémon holding an Adrenaline Orb is affected by Intimidate, the item will be consumed and increase the holder's Speed by one stage.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Intimidate is in the first place in the party (even if fainted), there is a 50% chance that a Pokémon that would be encountered will not appear if its level would be 5 levels or more below the leading Pokémon's. It shares this effect with Keen Eye."
    },
    "iron barbs": {
        "name": "Iron Barbs",
        "description": "Inflicts damage to the attacker on contact with iron barbs.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, the attacking Pokémon takes damage equal to 1/8 of its own maximum HP. If Iron Barbs causes both the Pokémon with this Ability and the attacking Pokémon to faint, then the attacking Pokémon will faint first.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit will activate this Ability.\n\nOutside of battle\nIron Barbs has no effect outside of battle."
    },
    "iron fist": {
        "name": "Iron Fist",
        "description": "Powers up punching moves.",
        "effect": "In battle\nIron Fist causes the power of affected punching moves to increase by 20%.\n\nOutside of battle\nIron Fist has no effect outside of battle."
    },
    "justified": {
        "name": "Justified",
        "description": "Being hit by a Dark-type move boosts the Attack stat of the Pokémon, for justice.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a Dark-type damaging move, its Attack is increased by one stage. (No immunity is granted to Dark-type moves.)\n\nIf a Pokémon with this Ability is hit by a Dark-type multi-strike move (such as Beat Up), each hit activates this Ability.\n\nOutside of battle\nJustified has no effect outside of battle."
    },
    "keen eye": {
        "name": "Keen Eye",
        "description": "Keen eyes prevent other Pokémon from lowering this Pokémon's accuracy.",
        "effect": "In battle\nGeneration III\nKeen Eye prevents other Pokémon from lowering the accuracy stat stage of the Pokémon with this Ability.\n\nEffects that decrease accuracy without using stat stages, such as Wonder Skin and Sand Veil, are unaffected by Keen Eye.\n\nThis Ability can be ignored with Mold Breaker, Teravolt, and Turboblaze.\n\nGeneration VI\nKeen Eye now also ignores any increases in its target's evasion stages.\n\nOutside of battle\nFrom Pokémon Emerald onward, if a Pokémon with Keen Eye is in the first place in the party (even if fainted), there is a 50% chance that a Pokémon that would be encountered will not appear if its level would be 5 levels or more below the leading Pokémon's. It shares this effect with Intimidate."
    },
    "klutz": {
        "name": "Klutz",
        "description": "The Pokémon can't use any held items.",
        "effect": "In battle\nGeneration IV\nKlutz prevents the effects of the held item of the Pokémon with this Ability from applying.\n\nKlutz does not negate item effects that affect prize money, experience, effort values, or friendship, such as those of the Amulet Coin, Lucky Egg, Power Weight, or Soothe Bell.\n\nThe Speed drop from the Iron Ball, Macho Brace, and Power items (such as the Power Bracer) is not negated by Klutz. However, the grounding effect of the Iron Ball is negated.\n\nKlutz prevents the Pokémon with this Ability from using Natural Gift; however, it does not prevent the Pokémon from using Fling. If a Pokémon with Klutz uses Bug Bite or Pluck, it will consume the target's held Berry without gaining its effects. If a Pokémon with Klutz uses Judgment, it will be a Normal-type move.\n\nGeneration V onward\nKlutz now prevents the Pokémon with this Ability from using Fling. If a Pokémon with Klutz uses Bug Bite or Pluck, it will now receive the effects of a consumed held Berry. If a Pokémon with Klutz uses Techno Blast or Multi-Attack, it will be a Normal-type move.\n\nAll effects of the Iron Ball are now negated by Klutz. However, Klutz still does not negate the Speed drop from the Macho Brace and Power items. Klutz cannot negate form-changing effects of items.\n\nIf a Pokémon is already locked into a move due to a held Choice item (Choice Scarf, Choice Specs, Choice Band), if the held Choice item is removed while its effect is negated, the Pokémon will be affected by the Choice item lock glitch.\n\nKlutz does not prevent Pokémon with this Ability from Mega Evolving with a Mega Stone, undergoing Primal Reversion with the Red Orb or Blue Orb, or using a Z-Move with a Z-Crystal.\n\nOutside of battle\nKlutz has no effect outside of battle. Items such as the Everstone, Cleanse Tag, Scarves, and Soothe Bell are not affected."
    },
    "leaf guard": {
        "name": "Leaf Guard",
        "description": "Prevents status conditions in harsh sunlight.",
        "effect": "In battle\nDuring harsh sunlight, Leaf Guard prevents the Pokémon from being afflicted by non-volatile status conditions and Yawn (including via the Flame Orb and Toxic Orb).\n\nIf a Pokémon with this Ability is drowsy due to Yawn, if there is harsh sunlight when it would fall asleep, the Ability activates and keeps it awake.\n\nGeneration IV\nLeaf Guard does not prevent self-inflicted sleep from Rest.\n\nGeneration V onward\nLeaf Guard now prevents the use of Rest.\n\nOutside of battle\nLeaf Guard has no effect outside of battle."
    },
    "levitate": {
        "name": "Levitate",
        "description": "By floating in the air, the Pokémon receives full immunity to all Ground-type moves.",
        "effect": "In battle\nLevitate renders the Pokémon with this Ability immune to damaging Ground-type moves (except Thousand Arrows). It also is unaffected by the effects of Arena Trap, Spikes, Toxic Spikes, Sticky Web, Rototiller, and terrain. Additionally, a Poison-type Pokémon with Levitate cannot remove Toxic Spikes.\n\nThese immunities are lost during Gravity or if the Pokémon with Levitate is holding an Iron Ball, is under the effects of Ingrain, or has been hit by Smack Down or Thousand Arrows. This Ability can also be suppressed by Gastro Acid or ignored by Mold Breaker, Teravolt, or Turboblaze.\n\nMany Pokémon with this Ability are eligible to enter Sky Battles; however, some Pokémon with this Ability—such as Gengar—are ineligible, due to them landing on the ground when entering the battle.\n\nOutside of battle\nLevitate has no effect outside of battle."
    },
    "light metal": {
        "name": "Light Metal",
        "description": "Halves the Pokémon's weight.",
        "effect": "In battle\nThe user's weight is halved. This may decrease the damage taken from Low Kick and Grass Knot, increase the damage taken from Heavy Slam and Heat Crash, and lower the base power of the user's Heavy Slam and Heat Crash.\n\nOutside of battle\nLight Metal has no effect outside of battle."
    },
    "lightning rod": {
        "name": "Lightning Rod",
        "description": "The Pokémon draws in all Electric-type moves. Instead of being hit by Electric-type moves, it boosts its Sp. Atk.",
        "effect": "In battle\nGeneration III\nLightningrod forces all single-target Electric-type moves used by foes to target the Pokémon with this Ability. Electric-type moves used by foes will never miss the Pokémon with this Ability, unless it is in the semi-invulnerable turn of a move such as Dig or Fly (Thunder will never miss it if it is in the semi-invulnerable turn of Fly or Bounce).\n\nLightningrod cannot redirect Electric-type Hidden Power.\n\nIf another Pokémon becomes the center of attention, Electric-type moves will be directed to it instead of the Pokémon with Lightningrod.\n\nGeneration IV\nLightningrod now also forces all single-target Electric-type moves used by allies to target the Pokémon with this Ability. Electric-type moves used by allies will now never miss the Pokémon with this Ability, unless it is in the semi-invulnerable turn of a move such as Dig or Fly (Thunder will never miss it if it is in the semi-invulnerable turn of Fly or Bounce).\n\nLightningrod cannot redirect Electric-type Judgment or Natural Gift.\n\nIf another Pokémon becomes the center of attention, Electric-type moves will be directed to it instead of the Pokémon with Lightningrod.\n\nGenerations V-VI\nAlong with its previous effects, Lightning Rod also gives the Pokémon immunity to all Electric-type moves, and raises the Pokémon's Special Attack by one stage whenever it is hit by an Electric-type move. If the Pokémon is protected from the move or immune to the move due to being Ground-type, its Special Attack will not increase.\n\nLightning Rod can now redirect Electric-type Hidden Power, Judgment, and Natural Gift.\n\nIf a Pokémon with Lightning Rod is holding a Cell Battery, Lightning Rod absorbs the move, so the Cell Battery's effect is not triggered.\n\nIn Triple Battles, Lightning Rod cannot redirect Electric-type moves if the Pokémon is out of range.\n\nGeneration VII\nEven if the Pokémon would be immune to the move due to being Ground-type, Lightning Rod activates and boosts the Pokémon's Special Attack.\n\nOutside of battle\nIn Pokémon Emerald, Trainers registered with the PokéNav's Match Call function will call more often if a Pokémon with Lightningrod is in the first place in the party (even if fainted)."
    },
    "limber": {
        "name": "Limber",
        "description": "Its limber body protects the Pokémon from paralysis.",
        "effect": "In battle\nLimber prevents the Pokémon from being afflicted by paralysis.\n\nA Pokémon with this Ability will be cured of paralysis if it is paralyzed while in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is paralyzed by a Pokémon with an Ability like Mold Breaker).\n\nGeneration III\nIf a paralyzed Pokémon with Limber is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Limber due to Trace, it will not be cured of paralysis until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of paralysis if it is switched in to replace a switched out Pokémon.\n\nIf a paralyzed Pokémon has Limber as its original Ability but not its current Ability, it will remain paralyzed when switched out.\n\nIf the Pokémon with this Ability is paralyzed and is holding a Cheri or Lum Berry, Limber will cure the Pokémon of paralysis before the Berry has a chance to be consumed.\n\nGeneration IV\nWhen a paralyzed Pokémon with Limber enters battle, it will be cured of paralysis.\n\nIf a paralyzed Pokémon has Limber as its original Ability but not its current Ability, if it is one of the active Pokémon at the end of the battle or switched out, it will be cured of paralysis (with no message).\n\nGeneration V onward\nIf a paralyzed Pokémon has Limber as its original Ability but not its current Ability, it will remain paralyzed when switched out.\n\nIf the Pokémon with this Ability is paralyzed and is holding a Cheri or Lum Berry, the Berry will be eaten and cure the Pokémon of paralysis before Limber has a chance to activate.\n\nOutside of battle\nIf a paralyzed Pokémon gains Limber by evolution or the Ability Capsule, it will not be cured of paralysis until sent into battle. Pokémon with Limber will not be paralyzed by the Gentleman's Kirlia in the Battle Pike nor the Battle Arcade's game board."
    },
    "liquid ooze": {
        "name": "Liquid Ooze",
        "description": "Oozed liquid has strong stench, which damages attackers using any draining move.",
        "effect": "In battle\nLiquid Ooze causes HP-draining moves used on the Pokémon with this Ability to damage their user instead of healing them.\n\nIf a Pokémon with Liquid Ooze is hit by a draining move such as Giga Drain or Leech Life (including the status move Strength Sap), or takes damage from the effect of Leech Seed, the amount of HP that would be recovered by the opponent is dealt as damage instead (after applying the effect of Big Root). The damage dealt by the move is not affected.\n\nEven if the user of the HP-draining move cannot heal from its effect due to having full HP or the effect of Heal Block, it will still take damage.\n\nOutside of battle\nLiquid Ooze has no effect outside of battle."
    },
    "liquid voice": {
        "name": "Liquid Voice",
        "description": "All sound-based moves become Water-type moves.",
        "effect": "In battle\nLiquid Voice turns the Pokémon's sound-based moves into Water-type moves.\n\nOutside of battle\nLiquid Voice has no effect outside of battle."
    },
    "long reach": {
        "name": "Long Reach",
        "description": "The Pokémon uses its moves without making contact with the target.",
        "effect": "In battle\nIf the Pokémon uses a contact move, it will not activate any effects caused by contact.\n\nOutside of battle\nLong Reach has no effect outside of battle."
    },
    "magic bounce": {
        "name": "Magic Bounce",
        "description": "Reflects status moves, instead of getting hit by them.",
        "effect": "In battle\nMagic Bounce reflects the effect of all stat-lowering status moves (excluding Memento), status condition-inducing status moves, entry hazard moves, moves like Taunt and Torment, and so on back to the user. Magic Bounce reflects the same moves that Magic Coat does.\n\nMoves reflected by Magic Bounce can still miss. Magic Bounce can reflect status Z-Moves (but not their Z-Power effects) and moves used via Dancer or Instruct. If Parting Shot is reflected, the Pokémon that originally used Parting Shot has its stats lowered while the Pokémon with Magic Bounce is switched out; if Z-Parting Shot is reflected, the Pokémon switched in does not have its HP restored.\n\nMagic Bounce cannot reflect a move if the Pokémon with Magic Bounce is immune to it due to its type or species (e.g. a Ground-type Pokémon targeted by Thunder Wave, or Dugtrio targeted by Telekinesis) or is protected from that move. Magic Bounce can reflect a move even if the move would fail (e.g. Disable used on a Pokémon that has not used a move or is already disabled) or have no effect on the target (e.g. Feather Dance when the target already has -6 Attack).\n\nIf a move targets multiple Pokémon individually (such as Heal Block or Growl), it will still affect each Pokémon that does not have Magic Bounce as normal, then each Pokémon that has Magic Bounce will reflect the move individually. If a move targets an entire side (such as entry hazard moves), if one Pokémon on that side has Magic Bounce the whole side is unaffected; even if multiple Pokémon on that side have Magic Bounce, only one of the Pokémon on that side will have its Magic Bounce activate.\n\nMagic Bounce does not activate if the move is used by a Pokémon with Teravolt, Turboblaze, or Mold Breaker. Magic Bounce will only activate once per turn. Magic Bounce cannot reflect a move that was just reflected by Magic Coat or Magic Bounce. If a Pokémon with this Ability is in the semi-invulnerable turn of a move like Fly, Magic Bounce will not activate.\n\nOutside of battle\nMagic Bounce has no effect outside of battle."
    },
    "magic guard": {
        "name": "Magic Guard",
        "description": "The Pokémon only takes damage from attacks.",
        "effect": "In battle\nMagic Guard prevents indirect damage, such as from weather, poison, Curse, and Leech Seed, but it does not stop them from being induced. Additional effects, such as being trapped by binding moves (such as Fire Spin) and Attack reduction from a burn, are not prevented.\n\nMagic Guard prevents damage caused by entry hazards, recoil, crash damage, and damage from using Mind Blown, though it does not prevent recoil damage from Struggle. Magic Guard will also prevent Life Orb's HP deduction without negating its power boost. Damage from confusion still occurs.\n\nMagic Guard does not prevent direct modification of a Pokémon's HP through means other than damage, such as with Pain Split, Belly Drum, Substitute, or a Ghost type cutting its own HP to use Curse. Moves that cause the user to faint, Destiny Bond and Perish Song can still cause a Pokémon with Magic Guard to faint.\n\nGeneration IV\nIf paralyzed, a Pokémon with Magic Guard will suffer from the normal Speed reduction but cannot be fully paralyzed. Magic Guard will prevent the Pokémon with this Ability from being poisoned by Toxic Spikes.\n\nGeneration V onward\nMagic Guard no longer grants immunity to being fully paralyzed and no longer prevents poisoning from Toxic Spikes, but it still prevents poison damage.\n\nOutside of battle\nMagic Guard has no effect outside of battle. This means a poisoned Pokémon with Magic Guard will still take damage in the field in Generation IV (but not later generations, because poison no longer causes damage in the field starting in Generation V)."
    },
    "magician": {
        "name": "Magician",
        "description": "The Pokémon steals the held item of a Pokémon it hits with a move.",
        "effect": "In battle\nWhen a Pokémon with Magician hits another Pokémon with a damaging move, it will steal the held item of the Pokémon that it hit. Magician will not activate if the user already has a held item.\n\nFling, Natural Gift, Future Sight and Doom Desire do not activate the Ability; Present will activate the Ability only if it deals damage. Thief, Covet, Knock Off, Pluck, Bug Bite, and Incinerate will steal or destroy the target's held item before Magician steals it. Sticky Barb transfers with its own effect before Magician can steal it. Magician will not activate if the Pokémon is holding a Gem even if the Gem is consumed when using the move, but will activate if the Pokémon's held Power Herb is consumed when using the move.\n\nIf a target's consumable held item is triggered by the move (such as a Focus Sash or Lum Berry), it will be consumed before it can be stolen. If a target holds a Focus Band or Rocky Helmet, it can be activated by the move, then be stolen by Magician.\n\nIf the Pokémon with Magician faints when using the move (such as due to the target's Liquid Ooze or held Rocky Helmet, or due to the Pokémon with this Ability using a recoil move or a move that causes it to faint), Magician will not steal the item. If the move of the Pokémon with Magician triggers Mummy, so that it no longer has the Ability Magician, it cannot steal an item.\n\nMagician activates after the last strike of a multi-strike move. Magician activates even if the user is switched out by U-turn or Volt Switch or the target is switched out by Dragon Tail or Circle Throw. Pickpocket activates after Magician, so the Pokémon that has Pickpocket will always end up with the item if the move is a contact move. If Meloetta has the Ability Magician (due to Skill Swap etc.) and uses Relic Song, Magician activates before it changes form.\n\nIt cannot steal from a Pokémon with Sticky Hold, unless the move causes the Pokémon with Sticky Hold to faint. It cannot steal Mail or a Z-Crystal. It cannot steal a Griseous Orb if either Pokémon is Giratina, a Plate if either Pokémon is Arceus, a memory if either Pokémon is Silvally, a Drive if either Pokémon is Genesect, a Mega Stone if either Pokémon can Mega Evolve using it, a Blue Orb if either Pokémon is Kyogre, or a Red Orb if either Pokémon is Groudon.\n\nOutside of battle\nIt is unknown if Magician has an effect outside of battle."
    },
    "magma armor": {
        "name": "Magma Armor",
        "description": "The Pokémon is covered with hot magma, which prevents the Pokémon from becoming frozen.",
        "effect": "In battle\nMagma Armor prevents the Pokémon from being frozen.\n\nA Pokémon with this Ability will be thawed out if it is frozen while in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is frozen by a Pokémon with an Ability like Mold Breaker).\n\nGeneration III\nIf a frozen Pokémon with Magma Armor is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Magma Armor due to Trace, it will not be cured of freeze until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of freeze if it is switched in to replace a switched out Pokémon.\n\nIf a frozen Pokémon has Magma Armor as its original Ability but not its current Ability, it will remain frozen when switched out.\n\nIf the Pokémon with this Ability is frozen and is holding an Aspear, Lum, or Pumkin Berry, Magma Armor will cure the Pokémon of freeze before the Berry has a chance to be consumed.\n\nGeneration IV\nWhen a frozen Pokémon with Magma Armor enters battle, it will be cured of freeze.\n\nIf a frozen Pokémon has Magma Armor as its original Ability but not its current Ability, if it is one of the active Pokémon at the end of the battle or switched out, it will be cured of freeze (with no message).\n\nGeneration V onward\nIf a frozen Pokémon has Magma Armor as its original Ability but not its current Ability, it will remain frozen when switched out.\n\nIf the Pokémon with this Ability is frozen and is holding an Aspear or Lum Berry, the Berry will be eaten and cure the Pokémon of freeze before Magma Armor has a chance to activate.\n\nOutside of battle\nIf a frozen Pokémon gains Magma Armor by evolution or the Ability Capsule, it will not be thawed out until sent into battle. Pokémon with Magma Armor will not be frozen by the Gentleman's Dusclops in the Battle Pike nor the Battle Arcade's game board.\n\nFrom Pokémon Emerald onward, if a Pokémon with Magma Armor is in the party (even if fainted), the number of cycles it takes for all Pokémon Eggs in the party to hatch are halved. This effect does not stack with itself or Flame Body; however, it can be stacked with Hatching Power Pass Power or O-Power."
    },
    "magnet pull": {
        "name": "Magnet Pull",
        "description": "Prevents Steel-type Pokémon from escaping using its magnetic force.",
        "effect": "In battle\nGeneration III to V\nMagnet Pull prevents Steel-type foes from fleeing (including Teleport) or switching out as long as the user remains in battle.\n\nUsing Baton Pass, U-turn, Volt Switch, or Parting Shot will still cause the Pokémon to switch out. Holding a Shed Shell allows the Pokémon to switch out, but not flee or use Teleport. Having the Ability Run Away or holding a Smoke Ball allows the Pokémon to flee or use Teleport, but not switch.\n\nIf a wild Pokémon has Magnet Pull and the player's Steel-type Pokémon faints, if the player attempts to flee instead of sending out another Pokémon, they are unaffected by Magnet Pull.\n\nMagnet Pull does not affect allies.\n\nGeneration VI onward\nMagnet Pull may no longer affect Ghost-type foes (even if they are part Steel-type).\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Magnet Pull is in the first place in the party (even if fainted), then there is a 50% chance the game will force an encounter with a Steel-type Pokémon, if one is possible."
    },
    "marvel scale": {
        "name": "Marvel Scale",
        "description": "The Pokémon's marvelous scales boost the Defense stat if it has a status condition.",
        "effect": "In battle\nWhile the Pokémon with this Ability has a status condition, its Defense is increased by 50%.\n\nIn the Mystery Dungeon series, a Pokémon with a status problem with this Ability will have a 50% defense bonus when hit by a physical attack.\n\nOutside of battle\nMarvel Scale has no effect outside of battle."
    },
    "mega launcher": {
        "name": "Mega Launcher",
        "description": "Powers up aura and pulse moves.\n",
        "effect": "In battle\nMega Launcher boosts the strength of aura and pulse moves used by a Pokémon with this Ability. Damage-dealing moves are boosted in power by 50%, while Heal Pulse heals 75% of the target's maximum HP rather than the usual 50%, including Z-Heal Pulse.\n\nOutside of battle\nMega Launcher has no effect outside of battle."
    },
    "merciless": {
        "name": "Merciless",
        "description": "The Pokémon's attacks become critical hits if the target is poisoned.",
        "effect": "In battle\nAttacks used by the Pokémon with this Ability will always become critical hits against poisoned targets, unless that target has Battle Armor or Shell Armor or is under the effects of Lucky Chant.\n\nOutside of battle\nMerciless has no effect outside of battle."
    },
    "minus": {
        "name": "Minus",
        "description": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
        "effect": "In battle\nGenerations III and IV\nMinus powers up with Plus. When a Pokémon with Minus enters into a Double Battle with a Pokémon with the Ability Plus, the user's Special Attack stat is increased by 50%.\n\nGeneration V onwards\nWhen a Pokémon with Minus enters a battle and has an ally with Plus or Minus, the Special Attack stat of the Pokémon with Minus is increased by 50%.\n\nThe move Magnetic Flux raises the Defense and Special Defense of allied Pokémon with Plus or Minus by 1 stage, while the move Gear Up raises the Attack and Special Attack of target Pokémon with Plus or Minus by 1 stage.\n\nOutside of battle\nMinus has no effect outside of battle."
    },
    "misty surge": {
        "name": "Misty Surge",
        "description": "Turns the ground into Misty Terrain when the Pokémon enters a battle.",
        "effect": "In battle\nWhen a Pokémon with Misty Surge enters the battle, it creates the effect of the move Misty Terrain on the battlefield.\n\nOutside of battle\nMisty Surge has no effect outside of battle"
    },
    "mold breaker": {
        "name": "Mold Breaker",
        "description": "Moves can be used on the target regardless of its Abilities.",
        "effect": "In battle\nMold Breaker ignores the effects of Abilities that could potentially affect the damage or effects of a move that its user executes. For example, a Pokémon with Mold Breaker can hit opponents that possess Levitate by using Earthquake. Mold Breaker applies regardless of target Pokémon, but only to moves executed by its user (so if two Pokémon in a Double Battle both know Earthquake, only the Pokémon with Mold Breaker can hit a Pokémon with Levitate).\n\nUnlike Gastro Acid, which completely negates a target's Ability, the opponents' Abilities otherwise remain in effect:\n\n- Abilities that prevent status conditions (such as Immunity and Oblivious) will not protect the Pokémon from receiving the status condition; however, many of these Abilities also have effects to cure the Pokémon of the status condition if afflicted, which are not negated by Mold Breaker.\n- Abilities that draw attacks to the user, such as Lightning Rod and Storm Drain, will still divert attacks regardless of Mold Breaker, but will not nullify the damage or boost the Pokémon's stats.\n- If a Pokémon with Own Tempo consumes a held Berry that may cause confusion in response to the move of a Pokémon with Mold Breaker, it will become confused if it dislikes the flavor (although Own Tempo will then activate and cure it of confusion).\nMold Breaker can ignore the Abilities of Pokémon other than the target; for example, if a Pokémon with Mold Breaker uses Thunder Wave on a Grass-type Pokémon whose ally has Flower Veil, the target will still be paralyzed.\n\nIn Generation IV, when a Pokémon with Mold Breaker is brought out, the message \"<name> has Mold Breaker!\" is displayed. In Generation V onward, when a Pokémon with Mold Breaker is brought out, the message \"<name> breaks the mold!\" is displayed.\n\nGeneration IV\nFlower Gift will increase the Attack of allies with Mold Breaker, even when they are attacking the ally with Flower Gift.\n\nGeneration V onward\nIf a Pokémon with Mold Breaker forces a Pokémon to switch in with a move like Roar or Dragon Tail, Abilities that affect entry hazards will be ignored if possible; if forced to switch in this way:\n\n- Pokémon with Levitate will be affected by Spikes and Toxic Spikes, unless they are Flying-type or holding an Air Balloon.\n  - Poison-type Pokémon with Levitate can remove Toxic Spikes, if they are not Flying-type and not holding an Air Balloon.\n- Pokémon with Immunity will be poisoned by Toxic Spikes (although Immunity will then activate and cure them of poison).\n- Pokémon with Leaf Guard will be poisoned by Toxic Spikes even during harsh sunlight.\n- Pokémon with Simple, Contrary, Clear Body or White Smoke will have their Speed lowered one stage by Sticky Web.\n- Grass-type Pokémon that have or have an ally with Flower Veil will be poisoned by Toxic Spikes, and will have their Speed lowered one stage by Sticky Web.\nIn Generation VI, a Pokémon with Overcoat will be affected by powder and spore moves as well.\n\nAbilities that draw attacks to the user, such as Lightning Rod and Storm Drain, no longer divert attacks from a Pokémon with Mold Breaker.\n\nWhen a Pokémon with Mold Breaker uses a move, even the effects of allies' Abilities (notably Flower Gift, Sweet Veil, Aroma Veil and Flower Veil) are ignored for the duration of that move. As such, if the move of a Pokémon with Mold Breaker triggers an Ability (such as Gooey or Cursed Body) or item (such as Destiny Knot), the Pokémon with Mold Breaker will not be protected by its allies' Abilities; likewise, if a Destiny Knot held by a Pokémon with Mold Breaker is activated during the use of its own move (such as in response to the target's Cute Charm), that target will not be protected by its allies' Aroma Veil. This also means that a Pokémon with Mold Breaker will not gain Attack due to an ally's Flower Gift.\n\nOutside of battle\nMold Breaker has no effect outside of battle."
    },
    "moody": {
        "name": "Moody",
        "description": "Raises one stat sharply and lowers another every turn.",
        "effect": "In battle\nAt the end of each turn, Moody raises one of the stats of the Pokémon with this Ability by two stages (at random), then decreases another stat by one stage (at random). It can select accuracy and evasion.\n\nMoody will not attempt to lower a stat that is already at -6 or attempt to increase a stat that is already at +6. Moody will not select the same stat to lower as it raised. If all stats are already at +6, Moody will only decrease one random stat, the same will happen if all stats are already at -6, Moody will only increase one random stat.\n\nOutside of battle\nMoody has no effect outside of battle."
    },
    "motor drive": {
        "name": "Motor Drive",
        "description": "Boosts its Speed stat if hit by an Electric-type move, instead of taking damage.",
        "effect": "In battle\nWhen a Pokémon with Motor Drive is hit by an Electric-type move, its Speed is increased by one stage, and the move will have no effect on that Pokémon.\n\nMotor Drive will not activate if the Pokémon is protected from the Electric-type move.\n\nIf a Pokémon with Motor Drive is holding a Cell Battery, Motor Drive absorbs the move so the Cell Battery's effect is not triggered.\n\nOutside of battle\nMotor Drive has no effect outside of battle."
    },
    "moxie": {
        "name": "Moxie",
        "description": "The Pokémon shows moxie, and that boosts the Attack stat after knocking out any Pokémon.",
        "effect": "In battle\nWhen a Pokémon with Moxie directly causes another Pokémon (including allies) to faint by using a damaging move, its Attack is increased by one stage. If its Attack is already at +6 stages, Moxie will not activate.\n\nMoxie activates after the Pokémon gains Attack from Fell Stinger. If a Pokémon with Moxie defeats a Pokémon with Mummy using a contact move, the Pokémon's Ability will become Mummy before Moxie has the opportunity to activate. Starting from Pokémon X and Y, if the Pokémon fainting ends the battle, Moxie will not activate."
    },
    "multiscale": {
        "name": "Multiscale",
        "description": "Reduces the amount of damage the Pokémon takes when its HP is full.",
        "effect": "In battle\nMultiscale reduces damage taken from damage-dealing moves by half when at maximum HP. It does not reduce the amount of HP taken from moves that deal direct damage.\n\nOutside of battle\nMultiscale has no effect outside of battle."
    },
    "multitype": {
        "name": "Multitype",
        "description": "Changes the Pokémon's type to match the Plate or Z-Crystal it holds.",
        "effect": "In battle\nGeneration IV\nMultitype changes the form and type of a Pokémon with this Ability depending on the Plate attached. The item-removing effects of Thief, Covet, Trick, Switcheroo, and Knock Off will not work on a Pokémon with Multitype, regardless of what item it is holding.\n\nWhen a Pokémon transforms into Arceus, it becomes the same form and type as the target Arceus. If the transformed Pokémon is holding a Plate that is different from the target's held Plate, it then immediately changes to the form and type corresponding to that Plate; if it is not holding a Plate, it immediately changes to Normal Arceus (unless it transformed into Normal Arceus).\n\nRole Play, Gastro Acid, and Worry Seed fail if the target has the Ability Multitype. Skill Swap fails if either Pokémon has Multitype. Multitype cannot be copied by Trace.\n\nGeneration V-VI\nIf a Pokémon transforms into Arceus, the Pokémon will now be in the same form as the target Arceus, regardless of its own held item.\n\nMultitype no longer has an effect on items; instead, item-manipulating effects cannot affect Arceus if they would cause it to hold a Plate or take a Plate it already holds.\n\nSimple Beam and Entrainment fail if the target has the Ability Multitype. Multitype cannot be replaced by Mummy.\n\nGeneration VII\nMultitype will also change Arceus's type and form if it holds a type-specific Z-Crystal.\n\nMultitype cannot be copied by Power of Alchemy or Receiver. Multitype cannot be suppressed by Core Enforcer.\n\nOutside of battle\nMultitype has no effect outside of battle."
    },
    "mummy": {
        "name": "Mummy",
        "description": "Contact with the Pokémon changes the attacker's Ability to Mummy.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, the Ability of the attacking Pokémon will become Mummy. Besides spreading Mummy in battle, the Ability does not have any other effect.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), the attacking Pokémon's Ability will become Mummy after the first strike.\n\nIf a Pokémon with Rock Head uses a recoil contact move on a Pokémon with Mummy, its Ability will become Mummy, then subsequently it will take recoil damage. If a Pokémon with Parental Bond uses a contact move on a Pokémon with Mummy, the Pokémon's Ability will become Mummy after the first strike, then the current move will continue to strike a second time regardless.\n\nMultitype, Stance Change, Schooling, Battle Bond, Shields Down, RKS System, Disguise and Mummy itself are not affected by Mummy.\n\nOutside of battle\nMummy has no effect outside of battle."
    },
    "natural cure": {
        "name": "Natural Cure",
        "description": "All status conditions heal when the Pokémon switches out.",
        "effect": "In battle\nNatural Cure heals any status conditions upon switching out or completing a battle (if it was in battle at the end of the battle).\n\nThis effect will occur if Natural Cure is the Pokémon's Ability in battle when it switches out and is not suppressed; a Pokémon that obtained the Ability with Trace will have its status condition cured when it switches out, whereas a Pokémon which has Natural Cure but has been affected by Gastro Acid will not.\n\nOutside of battle\nFrom Generation IV onward, Natural Cure automatically heals status conditions upon the end of a battle."
    },
    "neuroforce": {
        "name": "Neuroforce",
        "description": "Powers up moves that are super effective.",
        "effect": "In battle\nNeuroforce increases the power of moves which would be super effective by 25%.\n\nOutside of battle\nIt is unknown if Neuroforce has an effect outside of battle."
    },
    "no guard": {
        "name": "No Guard",
        "description": "The Pokémon employs no-guard tactics to ensure incoming and outgoing attacks always land.",
        "effect": "In battle\nAll moves used by or against a Pokémon with this Ability cannot miss. It also allows Pokémon to be hit during the semi-invulnerable turn of Fly, Bounce, Dive, Dig, Shadow Force, Sky Drop, and Phantom Force.\n\nIn Diamond and Pearl, a Pokémon with No Guard can successfully hit a Pokémon that has used Protect or Detect, but only if it uses a move with less than 100% accuracy. The lower the initial accuracy of the move, the higher its chance of breaking through Protect or Detect. Thus, when used against Protect or Detect, moves that never miss (such as Swift and Aerial Ace) will always be blocked. One-hit knockout moves are exempted from this behavior and will be protected against. This battle mechanic was a bug, and was fixed in Platinum so that most moves are blocked by Protect and Detect.\n\nOutside of battle\nOutside of battle, if a Pokémon with No Guard is in the first place in the party (even if fainted), the wild Pokémon encounter rate increases by 50%."
    },
    "normalize": {
        "name": "Normalize",
        "description": "All the Pokémon's moves become Normal type. The power of those moves is boosted a little.",
        "effect": "In battle\nNormalize makes all moves (including status moves) used by the Pokémon with this Ability act as though they were Normal-type instead of their usual type.\n\nIf Normalize makes Thunder Wave a Normal-type move, Thunder Wave can affect Ground-type Pokémon but not Ghost-type Pokémon, unless the Ghost-type Pokémon is holding a Ring Target or affected by Foresight or Odor Sleuth.\n\nIf the move Flying Press is affected by Normalize, it deals Normal/Flying-type damage. If the move Freeze-Dry is affected by Normalize, its ability to hit Water-type Pokémon super effectively is retained.\n\nIf Electrify or Ion Deluge is used on a Pokémon with Normalize, all its moves turn to the Electric type rather than Normal type.\n\nGeneration IV\nHidden Power, Weather Ball, Natural Gift, and Judgment are affected by Normalize.\n\nGenerations V and VI\nHidden Power, Weather Ball, Natural Gift, Judgment, and Techno Blast are not affected by Normalize.\n\nGeneration VII\nAffected moves now receive a 20% power boost. Damaging Z-Moves are not affected by Normalize.\n\nOutside of battle\nNormalize has no effect outside of battle."
    },
    "oblivious": {
        "name": "Oblivious",
        "description": "The Pokémon is oblivious, and that keeps it from being infatuated or falling for taunts.",
        "effect": "In battle\nGeneration III\nOblivious prevents the Pokémon from being afflicted by infatuation.\n\nA Pokémon with this Ability will be cured of infatuation if it is infatuated while in battle (such as if it gains the Ability by an effect like Skill Swap, or is infatuated by a Pokémon with an Ability like Mold Breaker).\n\nIf a Pokémon is infatuated and has a status condition, if its infatuation is cured by Oblivious, the status condition icon will not disappear.\n\nGeneration IV\nIn addition to preventing infatuation, Pokémon with Oblivious are unaffected by Captivate.\n\nIf a Pokémon is infatuated and has a status condition, if its infatuation is cured by Oblivious, the status condition icon will disappear from the HP bar while it is in battle. The status condition will continue to take effect, however.\n\nIf the Pokémon with this Ability is infatuated and is holding a Mental Herb, Oblivious will cure the Pokémon of infatuation before the Mental Herb has a chance to be consumed. If the Pokémon with this Ability is holding a Destiny Knot, the Destiny Knot will be activated before Oblivious cures the Pokémon of infatuation.\n\nGeneration V\nIf a Pokémon is infatuated and has a status condition, if its infatuation is cured by Oblivious, the status condition icon will not disappear.\n\nIf the Pokémon with this Ability is infatuated and is holding a Mental Herb, the Mental Herb will be consumed before Oblivious cures the Pokémon of infatuation.\n\nGeneration VI\nIn addition to preventing infatuation, Oblivious now prevents the Pokémon from being afflicted by Taunt.\n\nA Pokémon with this Ability will be cured of Taunt if it is taunted while in battle (such as if it gains the Ability by an effect like Skill Swap, or is taunted by a Pokémon with an Ability like Mold Breaker). If the Pokémon is holding a Mental Herb, it will be consumed before Oblivious cures the Pokémon of the Taunt.\n\nOutside of battle\nOblivious has no effect outside of battle."
    },
    "overcoat": {
        "name": "Overcoat",
        "description": "Protects the Pokémon from things like sand, hail, and powder.",
        "effect": "In battle\nGeneration V\nIn battle, a Pokémon with Overcoat does not take damage from the weather conditions sandstorm and hailstorm.\n\nGeneration VI onward\nOvercoat now also protects from powder and spore moves, as well as Effect Spore.\n\nOutside of battle\nOvercoat has no effect outside of battle."
    },
    "overgrow": {
        "name": "Overgrow",
        "description": "Powers up Grass-type moves when the Pokémon's HP is low.",
        "effect": "In battle\nGenerations III to IV\nWhen a Pokémon with Overgrow uses a Grass-type move, the move's power will be increased by 50% if the user has less than or equal to ⅓ of its maximum HP remaining.\n\nGenerations V onwards\nInstead of boosting Grass-type moves' power, Overgrow now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Grass-type move is being used, resulting in effectively the same effect.\n\nOutside of battle\nOvergrow has no effect outside of battle."
    },
    "own tempo": {
        "name": "Own Tempo",
        "description": "This Pokémon has its own tempo, and that prevents it from becoming confused.",
        "effect": "In battle\nOwn Tempo prevents the Pokémon from being afflicted by confusion, even if it is self-inflicted (such as from moves like Thrash or items like the Iapapa Berry).\n\nA Pokémon with this Ability will be cured of confusion if it is confused while in battle (such as if it gains the Ability by an effect like Skill Swap, or is confused by a Pokémon with an Ability like Mold Breaker).\n\nGeneration III\nIf a Pokémon with Own Tempo is confused due to obtaining it from Baton Pass, it will be cured of confusion as soon as it switches in. If a Pokémon with Trace is sent into battle via Baton Pass and is confused as a result, if it gains Own Tempo via Trace it will not be cured of confusion until after a Pokémon takes its turn (uses a move, switches out, etc.).\n\nIf a Pokémon is confused and has a status condition, if its confusion is cured by Own Tempo, the status condition icon will not disappear.\n\nIf the Pokémon with this Ability is confused and is holding a Persim, Lum, or Touga Berry, Own Tempo will cure the Pokémon of confusion before the Berry has a chance to be consumed.\n\nGeneration IV\nIf a Pokémon with Trace is sent into battle via Baton Pass and is confused as a result, if it gains Own Tempo via Trace it will be cured of confusion immediately.\n\nIf a Pokémon is confused and has a status condition, if its confusion is cured by Own Tempo, the status condition icon will disappear from the HP bar while it is in battle. The status condition will continue to take effect, however.\n\nGeneration V onward\nIf a Pokémon with Own Tempo is confused due to obtaining it from Baton Pass, it will not be cured of confusion until after a Pokémon takes its turn (uses a move, switches out, etc.).\n\nIf a Pokémon is confused and has a status condition, if its confusion is cured by Own Tempo, the status condition icon will not disappear.\n\nIf the Pokémon with this Ability is confused and is holding a Persim or Lum Berry, the Berry will be eaten before Own Tempo cures the Pokémon of confusion.\n\nOutside of battle\nOwn Tempo has no effect outside of battle."
    },
    "parental bond": {
        "name": "Parental Bond",
        "description": "Parent and child each attacks.",
        "effect": "In battle.\nGeneration VI\nParental Bond causes most damaging moves used by the Pokémon to become two-strike moves, with the second attack being half as strong as the first. It does not affect multi-strike moves.\n\nIf a move could hit multiple targets (including allies), such as Earthquake and Rock Slide, it will not strike twice; however, if it can only hit a single Pokémon, such as in a Single Battle or if using a move that can hit multiple targets when only one target is in range, it will strike twice. If a move could hit multiple Pokémon but only hits one due to missing the other Pokémon, it will only strike once.\n\nAny attack which has a secondary effect (except Secret Power) has the same secondary effect on both strikes (such as Power-Up Punch), including effects that do not always trigger. If the Pokémon's Ability is changed to Mummy after the first strike, it will continue to make a second strike regardless. Since Parental Bond turns moves into two-hit multi-strike moves, each strike has a separate chance to be a critical hit, items and Abilities that trigger upon strike or contact such as Cursed Body and Rocky Helmet occur for each strike, and Spiky Shield and King's Shield only damage and decrease Attack (respectively) once if a Pokémon with Parental Bond uses a contact move against a Pokémon that has used one of them.\n\nUnlike other secondary effects, Secret Power's secondary effect can only occur after the second hit. If a move has recoil damage, the recoil will be based on the damage dealt by both strikes, but will be taken after the second strike; Struggle will inflict recoil damage equal to half the user's maximum HP (after the second strike). Circle Throw and Dragon Tail will strike twice, but only force the opponent to switch out once after both strikes are dealt. U-turn and Volt Switch strike twice, then the user switches out. Bug Bite and Pluck consume the target's Berry after the second strike, so if the target could eat its Berry due to low HP after the first strike, it will. Moves that require the user to recharge after use like Hyper Beam strike twice, and the user only needs to recharge for one turn. Smelling Salts, Wake-Up Slap and Knock Off do not cure the target of paralysis or sleep or remove the target's held item (respectively), until after the second strike, so both strikes get the increased power. Fire-type moves, Scald and Steam Eruption thaw a frozen target after the second strike (so a frozen target cannot be thawed and then burned by the same move). If Meloetta has Parental Bond and uses Relic Song, it will change Forme only once, after the second strike.\n\nIf Present heals the target it will only strike once, but if it damages the target it will strike twice (the second strike will always damage the target). Fixed-damage moves such as Seismic Toss and Dragon Rage deal the full amount of damage for both strikes. The damage dealt by Psywave is generated separately for each strike, and the second strike's damage is not halved. Each strike of Super Fang halves the target's HP (effectively quartering it if HP is not restored between strikes). Counter, Mirror Coat, Metal Burst and Bide deal the full amount of damage for both strikes. The first strike of Assurance counts as previously taking damage for the second strike, giving it increased power. Grass Pledge, Fire Pledge, and Water Pledge strike twice, even when used as a combination move. Natural Gift and Spit Up strike twice.\n\nFling, Self-Destruct, Explosion, and Final Gambit only strike once. Moves with a charging turn (such as Fly and Solar Beam) only strike once, even if the Pokémon becomes fully charged in one turn (such as with a Power Herb). Endeavor also only strikes once, even if the user or target's HP is changed after it strikes (such as by Iron Barbs or the Sitrus Berry). Confusion damage only occurs once.\n\nEven though the Ability makes the Pokémon strike twice, there is only one accuracy check for the strike. This means if the first strike misses there will be no second strike, and if the first strike does not miss, then the second is guaranteed to strike.\n\nGeneration VII\nThe second strike's damage was reduced, now dealing 25% of the damage of the first strike.\n\nParental Bond does not affect Z-Moves.\n\nOutside of battle\nParental Bond has no effect outside of battle."
    },
    "pickpocket": {
        "name": "Pickpocket",
        "description": "Steals an item from an attacker that made direct contact.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, the Pokémon with this Ability will steal the held item of the attacking Pokémon. It will not activate if the Pokémon with this Ability already has a held item. It will not activate if the Pokémon with this Ability is knocked out by that move.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), the item will not be stolen until after the final strike. If multiple Pokémon with this Ability are hit by the same move that made contact, Pickpocket will activate for the fastest one that does not already have an item.\n\nPickpocket activates after Magician and the Sticky Barb, and after Thief and Covet steal a held item. Consequently, the Pokémon that has Pickpocket will always end up with the item. Pickpocket also activates after Knock Off, Bug Bite, and Pluck, meaning that the stolen item will not be lost, and if it does lose its item due to these moves it can immediately steal another.\n\nThe Life Orb and Shell Bell will activate before being stolen. The King's Rock and Razor Fang can still make the Pokémon with Pickpocket flinch even if stolen.\n\nIt cannot steal from a Pokémon with Sticky Hold. It cannot steal Mail or a Z-Crystal. It cannot steal a Griseous Orb if either Pokémon is Giratina, a Plate if either Pokémon is Arceus, a memory if either Pokémon is Silvally, a Drive if either Pokémon is Genesect, a Mega Stone if either Pokémon can Mega Evolve using it, a Blue Orb if either Pokémon is Kyogre, or a Red Orb if either Pokémon is Groudon.\n\nOutside of battle\nPickpocket has no effect outside of battle."
    },
    "pickup": {
        "name": "Pickup",
        "description": "The Pokémon may pick up the item an opposing Pokémon used during a battle. It may pick up items outside of battle, too.",
        "effect": "In battle\nGeneration III-IV\nPickup has no effect during battle.\n\nGeneration V onward\nAt the end of the turn in which another Pokémon used a one-time use item (including throwing an item with Fling or using Natural Gift), a Pokémon with Pickup will collect the item if they are not holding anything. If more than one Pokémon has Pickup or Harvest, the faster Pokémon will restore an item first. If multiple items can be collected, the Pokémon will collect the item most recently consumed.\n\nA single Pokémon's Pickup will not activate more than once per turn.\n\nPickup cannot collect an item if the Pokémon that consumed the item is no longer on the field at the end of the turn, or if the item has already been recovered (such as with Recycle, another Pokémon's Pickup, or Harvest). Pickup cannot collect an item that a Pokémon consumed before switching out, even if it switched back in again before the end of the turn. Pickup cannot collect items that have been destroyed with Incinerate, eaten with Bug Bite or Pluck, or knocked off with Knock Off. A popped Air Balloon cannot be collected.\n\nA Pokémon may only have one consumed item at a time; if a Pokémon consumes an item, obtains another item and consumes it, the original consumed item cannot be collected, even if the second item is collected or restored then swapped away. If the Pokémon obtains another item after consuming an item, Pickup can still collect the old item as long as the Pokémon does not consume the new one.\n\nOutside of battle\nAfter winning a battle, any Pokémon on the team that has this Ability and is not already holding an item has a 10% chance of creating a held item for itself, even if the Pokémon was not used in battle. This Ability is still active while the Pokémon is fainted."
    },
    "pixilate": {
        "name": "Pixilate",
        "description": "Normal-type moves become Fairy-type moves. The power of those moves is boosted a little.",
        "effect": "In battle\nGeneration VI\nPixilate causes all Normal-type moves used by the Pokémon to become Fairy-type and receive a 30% power boost.\n\nGeneration VII\nAffected moves now receive a 20% power boost.\n\nOutside of battle\nPixilate has no effect outside of battle."
    },
    "plus": {
        "name": "Plus",
        "description": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
        "effect": "In battle\nGenerations III and IV\nWhen a Pokémon with Plus enters a Double Battle and has an ally with Minus, the Special Attack stat of the Pokémon with Plus is increased by 50%.\n\nGeneration V onwards\nWhen a Pokémon with Plus enters a battle and has an ally with Plus or Minus, the Special Attack stat of the Pokémon with Plus is increased by 50%.\n\nThe move Magnetic Flux raises the Defense and Special Defense of allied Pokémon with Plus or Minus by 1 stage, while the move Gear Up raises the Attack and Special Attack of target Pokémon with Plus or Minus by 1 stage.\n\nOutside of battle\nPlus has no effect outside of battle."
    },
    "poison heal": {
        "name": "Poison Heal",
        "description": "Restores HP if the Pokémon is poisoned, instead of losing HP.",
        "effect": "In battle\nIf the Pokémon is poisoned or badly poisoned, it will gain 1/8 of its maximum HP at the end of each turn instead of taking damage.\n\nWhen a Pokémon with Poison Heal is badly poisoned, this has no effect on the Pokémon's HP recovery. However, the bad poison counter still increases each turn even if the Pokémon has Poison Heal; as such, if Gastro Acid is used on the Pokémon with Poison Heal after being badly poisoned for five turns, it will incur poison damage starting at 5/16 (instead of 1/16).\n\nIf a poisoned Pokémon with Poison Heal is affected by Heal Block, it will be neither healed nor damaged by the poison.\n\nOutside of battle\nPoison Heal has no effect outside of battle, so in Generation IV, poison will still hurt a Pokémon outside of battle even if it has this Ability."
    },
    "poison point": {
        "name": "Poison Point",
        "description": "Contact with the Pokémon may poison the attacker.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become poisoned.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit has an independent chance to activate this Ability.\n\nOutside of battle\nPoison Point has no effect outside of battle."
    },
    "poison touch": {
        "name": "Poison Touch",
        "description": "May poison a target when the Pokémon makes contact.",
        "effect": "In battle\nIf a Pokémon with this Ability uses a move that makes contact, there is a 30% chance the target will become poisoned. In Japanese versions of Pokémon Black and White, this is a 20% chance instead.\n\nThis chance applies independently of any moves that may have a chance to poison the target with their own effect. If the attack's target holds a status condition-curing Berry, it is possible for a move's natural effect to inflict a non-volatile status condition which the target's held item will then cure, only for the target to then be poisoned by Poison Touch. Poison Touch's chances also apply independently for each hit of a multi-strike move.\n\nPoison Touch can poison a target hit by Dragon Tail or Circle Throw. Poison Touch can also poison a target with Mummy before Mummy overwrites Poison Touch. Pokémon with Immunity or Shield Dust cannot become poisoned by Poison Touch, unless the contact-making move is Sunsteel Strike.\n\nIn a link battle including a Japanese version of Pokémon Black or White and a non-Japanese version or Pokémon Black 2 and White 2, the chance to poison is determined by the game of the player with the Pokémon with the Ability Poison Touch. As such, a Pokémon with Poison Touch owned by the player of a Japanese version of Pokémon Black or White will have a 20% chance to poison, whereas players of Pokémon Black 2 and White 2 and non-Japanese versions of Pokémon Black and White will have a 30% chance.\n\nOutside of battle\nPoison Touch has no effect outside of battle."
    },
    "power construct": {
        "name": "Power Construct",
        "description": "Other Cells gather to aid when its HP becomes half or less. Then the Pokémon changes its form to Complete Forme.",
        "effect": "In battle\nAt the end of a turn, if the HP of a Zygarde 10% Forme or 50% Forme with Power Construct is below half, it changes into Complete Forme.\n\nSince Zygarde Complete Forme has a higher base HP stat, Zygarde's maximum HP will increase and its current HP will be revised to its new maximum HP minus the amount of HP it had lost before changing form. Additionally, its type becomes Dragon/Ground (if it had been changed by some effect).\n\nAt the end of the battle, Zygarde will change back to the Forme it started battle as, retaining the HP it had at the end of the battle. If this is above the maximum HP of its original Forme, its HP will become equal to its maximum HP.\n\nPower Construct cannot be copied with Trace, suppressed with Gastro Acid, or replaced with Entrainment or Skill Swap. The increase in base HP is not considered healing, so it is not prevented by Heal Block. If a Pokémon other than Zygarde obtains Power Construct with Transform, the Pokémon cannot change Formes.\n\nOutside of battle\nZygarde with the Ability Power Construct cannot be separated back into Cores and Cells; however, the Zygarde Cube can be used to switch a Zygarde with this Ability between its 10% and 50% Formes.\n\nZygarde cannot switch between Abilities using an Ability Capsule."
    },
    "power of alchemy": {
        "name": "Power of Alchemy",
        "description": "The Pokémon copies the Ability of a defeated ally.",
        "effect": "In battle\nWhen an ally of the Pokémon with this Ability faints in battle (regardless of cause), Power of Alchemy will be replaced by the fainted Pokémon's Ability.\n\nPower of Alchemy will not activate if its ally had the Ability Power of Alchemy, Receiver, Trace, Forecast, Flower Gift, Multitype, Illusion, Wonder Guard, Zen Mode, Imposter, Stance Change, Power Construct, Schooling, Comatose, Shields Down, Disguise, RKS System, or Battle Bond.\n\nPower of Alchemy cannot be copied by Role Play or Trace. Role Play and Entrainment will fail if used by a Pokémon with Power of Alchemy.\n\nOutside of battle\nPower of Alchemy has no effect outside of battle."
    },
    "prankster": {
        "name": "Prankster",
        "description": "Gives priority to a status move.",
        "effect": "In battle\nGeneration V\nPrankster increases the priority of status moves by one. Any move that is increased in priority from Prankster is not blocked by Quick Guard.\n\nGeneration VI\nAny status moves used by Pokémon with Prankster now can be blocked by Quick Guard.\n\nGeneration VII\nDark-type Pokémon are now immune to opposing Pokémon's moves that gain priority due to Prankster, including moves called by moves that call other moves (such as Assist and Nature Power) and excluding moves that are repeated as a result of Prankster-affected Instruct. Ally Dark-type Pokémon are still affected by the user's status moves.\n\nDark-type Pokémon can still bounce moves back with Magic Bounce or Magic Coat; moves that have increased priority due to Prankster which are reflected by Magic Bounce or Magic Coat can affect Dark-type Pokémon, unless the Pokémon that bounced the move with Magic Coat also has Prankster. Moves that target all Pokémon (except Perish Song and Rototiller, which cannot affect Dark-type opponents if boosted by Prankster) and entry hazard moves are successful regardless of the presence of Dark-type Pokémon.\n\nOutside of battle\nPrankster has no effect outside of battle.\n\nStatus Z-Moves (including Extreme Evoboost) have their priority increased."
    },
    "pressure": {
        "name": "Pressure",
        "description": "By putting pressure on the opposing Pokémon, it raises their PP usage.",
        "effect": "In battle\nGeneration III\nWhen a Pokémon with Pressure is targeted by a foe's move, one additional PP is deducted upon execution. Consequently, extra PP is deducted even if the foe's move misses, has multiple targets, or is rendered ineffective due to immunity. Pressure applies to allies targeting the Pokémon.\n\nIf the move of a Pokémon targets several foes with Pressure, one additional PP will be deducted for each one.\n\nGeneration IV\nThe presence of Pressure is broadcast with the message \"<name> is exerting its Pressure!\"\n\nThis Ability is not affected by Mold Breaker.\n\nGeneration V onward\nPokémon no longer have PP deducted by allies with Pressure.\n\nThis Ability is not affected by Teravolt or Turboblaze.\n\nWild Pokémon are more likely to call for help when facing a Pokémon with Pressure. It shares this effect with Intimidate and Unnerve.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Pressure is in the first place in the party (even if fainted), then Pressure increases the chance of encountering a high-leveled wild Pokémon by 50% (so an otherwise 25% chance would become 75%). It shares this effect with Hustle and Vital Spirit."
    },
    "primordial sea": {
        "name": "Primordial Sea",
        "description": "The Pokémon changes the weather to nullify Fire-type attacks.",
        "effect": "In battle\nWhen a Pokémon with Primordial Sea enters the battle or a Pokémon gains the Ability Primordial Sea, the Ability creates heavy rain, a unique variation of rain. In a Rotation Battle, Primordial Sea will not activate if the Pokémon is sent out in a rotated-out position, nor will it activate if the Pokémon is rotated in. In addition, Primordial Sea will not activate if heavy rain is already present on the battlefield.\n\nAlong with the usual effects of rain, heavy rain causes damage-dealing Fire-type moves to fail (unless a Pokémon on the field has the Air Lock or Cloud Nine Ability). Additionally, heavy rain causes the weather-modifying moves Sunny Day, Rain Dance, Sandstorm, and Hail to fail if used; and causes the Abilities Drought, Drizzle, Sand Stream, and Snow Warning to fail to activate.\n\nThe heavy rain will lift if the Pokémon is removed from the field (and no other Pokémon with Primordial Sea remain on the field), if the Pokémon is rotated out in a Rotation Battle, if the Pokémon has its Ability suppressed or replaced, or if the Desolate Land or Delta Stream Ability activates.\n\nOutside of battle\nPrimordial Sea has no effect outside of battle."
    },
    "prism armor": {
        "name": "Prism Armor",
        "description": "Reduces the power of supereffective attacks taken.",
        "effect": "In battle\nPrism Armor reduces damage from supereffective moves by ¼ (regardless of the effectiveness multiplier).\n\nPrism Armor is not ignored by the Abilities Mold Breaker, Teravolt, and Turboblaze.\n\nOutside of battle\nPrism Armor has no effect outside of battle."
    },
    "protean": {
        "name": "Protean",
        "description": "Changes the Pokémon's type to the type of the move it's about to use.",
        "effect": "In battle\nImmediately before using any move (except Struggle), a Pokémon with Protean as its Ability will change its type to be the same type as the move it is using. Protean always causes the user to become a single-type Pokémon.\n\nBecause Protean activates prior to executing a move, the user will receive same-type attack bonus on every move it uses (except Struggle) regardless of the move's type, and will always hit with the move Toxic.\n\nWhen using a move that calls another move (such as Nature Power), the type of the called move will be considered. When using a move that can change type or if the move has been affected by Electrify or Ion Deluge, the type it changes to will be considered. When using a move that changes the user's type, such as Camouflage, first Protean changes the user's type to the type of the move, then the move will either fail or change the user's type again. When using Curse (unless its type is changed by Electrify), if the user is not already Ghost-type prior to the activation of Protean, Protean will change the user to Ghost-type, then the user will use the Ghost-type effect of Curse on itself (regardless of Crafty Shield and Follow Me or Rage Powder).\n\nProtean will not activate if the move fails (unless it fails due to the activation of Protean), if the execution is interrupted entirely (such as by the effect of infatuation or confusion), if the move is prevented by heavy rain or extremely harsh sunlight, or if the move is prevented by Powder. Protean will activate even if the move misses, is blocked by a protection move, or fails to affect the opponent. Protean will still change the user's type when using Trick-or-Treat and Forest's Curse, regardless of whether the move successfully executes or not.\n\nThe user's new type remains in effect until changed again or until the user is switched out; negating or replacing the Ability does not change the user back to their original type.\n\nOutside of battle\nProtean has no effect outside of battle."
    },
    "psychic surge": {
        "name": "Psychic Surge",
        "description": "Turns the ground into Psychic Terrain when the Pokémon enters a battle.",
        "effect": "In battle\nWhen a Pokémon with Psychic Surge enters the battle, it creates the effect of the move Psychic Terrain on the battlefield.\n\nOutside of battle\nPsychic Surge has no effect outside of battle."
    },
    "pure power": {
        "name": "Pure Power",
        "description": "Using its pure power, the Pokémon doubles its Attack stat.",
        "effect": "In battle\nPure Power doubles the Attack stat of the Pokémon with this Ability.\n\nOutside of battle\nPure Power has no effect outside of battle."
    },
    "queenly majesty": {
        "name": "Queenly Majesty",
        "description": "Its majesty pressures the opposing Pokémon, making it unable to attack using priority moves.",
        "effect": "In battle\nIf an opponent uses a priority move (including moves boosted by Prankster, Gale Wings or Triage) that targets the Pokémon with Queenly Majesty or its allies, Queenly Majesty prevents the Pokémon from executing that move (PP is still consumed). When this occurs, the text \"[Pokémon] cannot use [Move]!\" is displayed.\n\nMoves that target all Pokémon (except Perish Song, Flower Shield, and Rototiller) and moves that target all foes cannot be blocked by Queenly Majesty even if they become priority moves. Queenly Majesty has no effect on allies' priority moves.\n\nPriority status Z-Moves will have their Z-Power effect activate. For example, if a Pokémon with Prankster uses Z-Will-O-Wisp, it will get the Attack boost, but will not burn the target.\n\nMold Breaker will ignore this Ability.\n\nOutside of battle\nQueenly Majesty has no effect outside of battle."
    },
    "quick feet": {
        "name": "Quick Feet",
        "description": "Boosts the Speed stat if the Pokémon has a status condition.",
        "effect": "In battle\nWhile a Pokémon with this Ability has a status condition, its Speed is increased by 50%. Additionally, a Pokémon with this Ability does not lose Speed due to paralysis.\n\nOutside of battle\nIf a Pokémon with Quick Feet is in the first place in the party (even if fainted), the chance of encountering a wild Pokémon is decreased by 50%. It shares this effect with Stench and White Smoke."
    },
    "rain dish": {
        "name": "Rain Dish",
        "description": "The Pokémon gradually regains HP in rain.",
        "effect": "In battle\nDuring rain, a Pokémon with Rain Dish will regain 1/16 of its maximum HP at the end of each turn.\n\nOutside of battle\nRain Dish has no effect outside of battle."
    },
    "rattled": {
        "name": "Rattled",
        "description": "Dark-, Ghost-, and Bug-type moves scare the Pokémon and boost its Speed stat.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a Bug-, Dark-, or Ghost-type damaging move, its Speed is increased by one stage. No immunity is granted to these types of moves, however.\n\nIf a Pokémon with this Ability is hit by a Bug-, Dark-, or Ghost-type multi-strike move (such as Pin Missile), each hit activates this Ability.\n\nOutside of battle\nRattled has no effect outside of battle."
    },
    "receiver": {
        "name": "Receiver",
        "description": "The Pokémon copies the Ability of a defeated ally.",
        "effect": "In battle\nWhen an ally of the Pokémon with this Ability faints in battle (regardless of cause), Receiver will be replaced by the fainted Pokémon's Ability.\n\nReceiver will not activate if its ally had the Ability Receiver, Power of Alchemy, Trace, Forecast, Flower Gift, Multitype, Illusion, Wonder Guard, Zen Mode, Imposter, Stance Change, Power Construct, Schooling, Comatose, Shields Down, Disguise, RKS System, or Battle Bond.\n\nReceiver cannot be copied by Role Play or Trace. Role Play and Entrainment will fail if used by a Pokémon with Receiver.\n\nOutside of battle\nReceiver has no effect outside of battle."
    },
    "reckless": {
        "name": "Reckless",
        "description": "Powers up moves that have recoil damage.",
        "effect": "In battle\nReckless increases the base power of moves which cause recoil or crash damage by 20%, except Struggle.\n\nOutside of battle\nReckless has no effect outside of battle."
    },
    "refrigerate": {
        "name": "Refrigerate",
        "description": "Normal-type moves become Ice-type moves. The power of those moves is boosted a little.",
        "effect": "In battle\nGeneration VI\nRefrigerate causes all Normal-type moves used by the Pokémon to become Ice-type and receive a 30% power boost.\n\nGeneration VII\nAffected moves now receive a 20% power boost.\n\nOutside of battle\nRefrigerate has no effect outside of battle."
    },
    "regenerator": {
        "name": "Regenerator",
        "description": "Restores a little HP when withdrawn from battle.",
        "effect": "In battle\nRegenerator restores ⅓ of the Pokémon's maximum HP upon switching out.\n\nThis effect will occur if Regenerator is the Pokémon's Ability in battle when it switches out and is not suppressed; a Pokémon that obtained the Ability with Trace will restore HP when it switches out, whereas a Pokémon which has Regenerator but has been affected by Gastro Acid will not. Heal Block doesn't prevent Regenerator from restoring HP.\n\nOutside of battle\nRegenerator has no effect outside of battle."
    },
    "rivalry": {
        "name": "Rivalry",
        "description": "Becomes competitive and deals more damage to Pokémon of the same gender, but deals less to Pokémon of the opposite gender.",
        "effect": "In battle\nGeneration IV\nWhen using a move, Rivalry raises the power of the move by 25% if the target and the Pokémon with this Ability have the same gender, but reduces base power by 25% if the target and the Pokémon with this Ability have opposite genders. If the Pokémon with this Ability or the target is genderless, the move's power is unaffected.\n\nUnless the Pokémon is genderless, Rivalry powers up confusion damage.\n\nGeneration V onward\nRivalry no longer powers up confusion damage.\n\nOutside of battle\nRivalry has no effect outside of battle."
    },
    "rks system": {
        "name": "RKS System",
        "description": "Changes the Pokémon’s type to match the memory disc it holds.",
        "effect": "RKS System changes the type of the Pokémon with this Ability depending on the memory attached.\n\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability RKS System. Skill Swap fails if either Pokémon has RKS System. RKS System cannot be copied by Trace, Power of Alchemy, or Receiver. RKS System cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Silvally obtains RKS System with Imposter or Transform, the Pokémon will copy the form of the target Silvally regardless of its own held item.\n\nOutside of battle\nRKS System has no effect outside of battle."
    },
    "rock head": {
        "name": "Rock Head",
        "description": "Protects the Pokémon from recoil damage.",
        "effect": "In battle\nRock Head prevents recoil damage from moves (except Struggle), but not from use of a Life Orb, Jaboca Berry, or Rowap Berry. Crash damage is still received if Jump Kick or High Jump Kick misses.\n\nIf Rock Head is lost in a turn due to using a recoil-inducing contact move on a Pokémon with Mummy, the HP loss from recoil will occur that turn.\n\nIn Pokémon Colosseum, Pokémon with this Ability still receive recoil damage from Shadow Rush. In Pokémon XD: Gale of Darkness, Pokémon with this Ability still receive recoil damage from Shadow End.\n\nOutside of battle\nRock Head has no effect outside of battle."
    },
    "rough skin": {
        "name": "Rough Skin",
        "description": "This Pokémon inflicts damage with its rough skin to the attacker on contact.",
        "effect": "In battle\nGeneration III\nWhen a Pokémon with this Ability is hit by a move that makes contact, the attacking Pokémon takes damage equal to 1/16 of its own maximum HP.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit will activate this Ability.\n\nGeneration IV onward\nWhen a Pokémon with this Ability is hit by a move that makes contact, the attacking Pokémon now takes damage equal to 1/8 of its own maximum HP.\n\nIf Rough Skin causes both the Pokémon with this Ability and the attacking Pokémon to faint, then the attacking Pokémon will faint first.\n\nOutside of battle\nRough Skin has no effect outside of battle."
    },
    "run away": {
        "name": "Run Away",
        "description": "Enables a sure getaway from wild Pokémon.",
        "effect": "In battle\nA Pokémon with this Ability can always flee successfully, regardless of trapping moves and Abilities (including Ingrain and binding moves). This Ability has no effect on switching out. Run Away does not guarantee escape in the Battle Pyramid, but if a Pokémon with this Ability successfully flees, this escape will be credited to Run Away.\n\nUntil Generation V, when activated, the message \"<Pokémon name> escaped using Run Away!\" will appear. From Generation V onward, a banner with Run Away shows up instead.\n\nOutside of battle\nRun Away has no effect outside of battle."
    },
    "sand force": {
        "name": "Sand Force",
        "description": "Boosts the power of Rock-, Ground-, and Steel-type moves in a sandstorm.",
        "effect": "In battle\nDuring a sandstorm, Sand Force increases the power of Rock-, Ground-, and Steel-type moves used by the Pokémon with this Ability by 30%. A Pokémon with this Ability will take no damage from the sandstorm if it otherwise would.\n\nOutside of battle\nIt is unknown if Sand Force has an effect outside of battle."
    },
    "sand rush": {
        "name": "Sand Rush",
        "description": "Boosts the Pokémon's Speed stat in a sandstorm.",
        "effect": "In battle\nDuring a sandstorm, the Speed stat of Pokémon with this Ability is doubled. A Pokémon with this Ability will take no damage from the sandstorm if it otherwise would.\n\nOutside of battle\nThere are no effects outside of battle."
    },
    "sand stream": {
        "name": "Sand Stream",
        "description": "The Pokémon summons a sandstorm when it enters a battle.",
        "effect": "In battle\nGenerations III-V\nSand Stream summons a sandstorm in battle as soon as a Pokémon with Sand Stream enters the battle. Its effects almost are the same as Sandstorm's; the only difference is that instead of lasting for five turns, it lasts for the whole battle until a different weather condition replaces it. If a Pokémon with Sand Stream is sent out in the same turn as another Pokémon whose Ability causes a different weather condition, the slower Pokémon's Ability will override the faster Pokémon's Ability.\n\nGeneration VI\nIn Generation VI, the sandstorm will last only for five turns instead. This can be extended to eight turns if the Pokémon is holding a Smooth Rock.\n\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Sand Stream will fail to activate.\n\nOutside of battle\nSand Stream has no effect outside of battle."
    },
    "sand veil": {
        "name": "Sand Veil",
        "description": "Boosts the Pokémon's evasion in a sandstorm.",
        "effect": "In battle\nDuring a sandstorm, the accuracy of any move used against a Pokémon with this Ability is modified by a factor of 4/5. A Pokémon with this Ability will take no damage from the sandstorm if it otherwise would.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Sand Veil is in the first place in the party (even if fainted) in an area with a sandstorm (such as Route 228 in Sinnoh), the chance of encountering a wild Pokémon is decreased by 50%."
    },
    "sap sipper": {
        "name": "Sap Sipper",
        "description": "Boosts the Attack stat if hit by a Grass-type move, instead of taking damage.",
        "effect": "In battle\nGeneration V\nWhen a Pokémon with Sap Sipper is hit by a Grass-type move, its Attack is increased by one stage, and the move will have no effect on that Pokémon.\n\nMulti-strike moves, such as Bullet Seed, will only increase the Pokémon's Attack once. Aromatherapy will not activate Sap Sipper.\n\nSap Sipper will not activate if the Pokémon is protected from the Grass-type move.\n\nGeneration VI\nAromatherapy now activates Sap Sipper of allies.\n\nOutside of battle\nSap Sipper has no effect outside of battle."
    },
    "schooling": {
        "name": "Schooling",
        "description": "When it has a lot of HP, the Pokémon forms a powerful school. It stops schooling when its HP is low.",
        "effect": "In battle\nIf Wishiwashi is level 20 or higher, at the start of battle or the end of a turn, if its HP is above 25%, it will change into its School Form. At the end of the turn, if its HP is below 25%, it will change back to its Solo Form.\n\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability Schooling. Skill Swap fails if either Pokémon has Schooling. Schooling cannot be copied by Trace, Power of Alchemy, or Receiver. Schooling cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Wishiwashi obtains Schooling with Imposter or Transform, the Pokémon will not change forms.\n\nOutside of battle\nSchooling has no effect outside of battle."
    },
    "scrappy": {
        "name": "Scrappy",
        "description": "The Pokémon can hit Ghost-type Pokémon with Normal- and Fighting-type moves.",
        "effect": "In battle\nScrappy causes Ghost-type Pokémon to be hit by damage-dealing Normal- and Fighting-type moves inflicted by the user.\n\nOutside of battle\nScrappy has no effect outside of battle."
    },
    "serene grace": {
        "name": "Serene Grace",
        "description": "Boosts the likelihood of additional effects occurring when attacking.",
        "effect": "In battle\nGenerations III-IV\nSerene Grace will double the chance of a move having an additional effect. For example, Psychic will have a 20% chance of lowering the target's Special Defense stat instead of its usual 10% chance, and Rock Smash will always lower an opponent's Defense by 1 level, as opposed to having a 50% chance of doing so. The 10% flinch chance due to King's Rock and Razor Fang is unaffected by Serene Grace. Serene Grace has no effect on status moves.\n\nGeneration V onward\nSerene Grace boosts the 10% flinch chance due to King's Rock or Razor Fang to 20%.\n\nOutside of battle\nSerene Grace has no effect outside of battle."
    },
    "shadow shield": {
        "name": "Shadow Shield",
        "description": "Reduces the amount of damage the Pokémon takes while its HP is full.",
        "effect": "In battle\nShadow Shield reduces damage taken from damage-dealing moves by half when at maximum HP. It does not reduce the amount of HP taken from moves that deal direct damage.\n\nUnlike Multiscale, Shadow Shield is unaffected by Mold Breaker, Teravolt, and Turboblaze. In addition, Moongeist Beam, Sunsteel Strike, and Photon Geyser do not ignore Shadow Shield.[1]\n\nOutside of battle\nShadow Shield has no effect outside of battle."
    },
    "shadow tag": {
        "name": "Shadow Tag",
        "description": "This Pokémon steps on the opposing Pokémon's shadow to prevent it from escaping.",
        "effect": "In battle\nShadow Tag prevents all foes from fleeing (including Teleport) or switching out while the Pokémon with this Ability is on the field.\n\nUsing Baton Pass, U-turn, Volt Switch, or Parting Shot will still cause the Pokémon to switch out. Having the Ability Run Away or holding a Smoke Ball allows the Pokémon to flee or Teleport, but not switch.\n\nIf a wild Pokémon has Shadow Tag and the player's Pokémon faints, if the player attempts to flee instead of sending out another Pokémon, they are unaffected by Shadow Tag.\n\nShadow Tag does not affect allies.\n\nGeneration IV\nShadow Tag now makes the Pokémon immune to the effects of other Pokémon's Shadow Tag. Holding a Shed Shell allows the Pokémon to switch out, but not flee or Teleport.\n\nGeneration VI\nGhost-type Pokémon are now immune to Shadow Tag.\n\nOutside of battle\nShadow Tag has no effect outside of battle."
    },
    "shed skin": {
        "name": "Shed Skin",
        "description": "The Pokémon may heal its own status conditions by shedding its skin.",
        "effect": "In battle\nAt the end of each turn, Shed Skin has a 30% chance of curing the Pokémon of a non-volatile status condition. If it cures a status condition, it does so before burn or poison damage is dealt on that turn.\n\nOutside of battle\nShed Skin has no effect outside of battle."
    },
    "sheer force": {
        "name": "Sheer Force",
        "description": "Removes additional effects to increase the power of moves when attacking.",
        "effect": "In battle\nSheer Force raises the base power of all damaging moves that have any additional effects by 30%, but their additional effects are ignored.\n\nReducing the target's stats, increasing the user's stats, inflicting a status condition or confusion to the target, and causing the target to flinch are all considered additional effects, so moves with these effects will have their power increased and their additional effect ignored.\n\nSheer Force does not consider recoil or decreasing the user's own stats to be additional effects. Properties of moves—such as having a high critical-hit ratio, being unable to miss, having variable power or powering up, or having a charging turn, among others—are not considered additional effects. Moves that have one of these properties in addition to an additional effect will be powered up and only the additional effect will be negated. For example, Flare Blitz inflicts recoil damage to the user, but also has an additional effect to burn; if the user has Sheer Force, Flare Blitz's damage will be boosted by 30% and the user will take recoil damage, but it cannot burn the target. Effects of Fling caused by holding specific items are not considered additional effects for the purposes of Sheer Force.\n\nIf (and only if) a move is boosted by the effect of Sheer Force, that move will no longer trigger item or Ability effects that activate after attacking. This includes the effects of Eject Button, Shell Bell, and Red Card, as well as the Abilities Color Change and Emergency Exit. Only the effect(s) that activate after attacking will be negated; therefore, if a Pokémon with Sheer Force holding a Life Orb uses a move boosted by Sheer Force, it will gain the passive damage boost (because it is not activated after the attack) but the Pokémon will not be damaged by the Life Orb.\n\nOutside of battle\nSheer Force does not have an effect outside of battle."
    },
    "shell armor": {
        "name": "Shell Armor",
        "description": "A hard shell protects the Pokémon from critical hits.",
        "effect": "In battle\nShell Armor prevents Pokémon from receiving a critical hit.\n\nOutside of battle\nShell Armor has no effect outside of battle."
    },
    "shield dust": {
        "name": "Shield Dust",
        "description": "This Pokémon's dust blocks the additional effects of attacks taken.",
        "effect": "In battle\nWhen the Pokémon is damaged by an attack, any additional effects are negated (similar to the attacker having Sheer Force, but without increasing damage). For example, Body Slam would only deal damage and not have its usual 30% chance of causing Paralysis. It does not stop moves that do not cause damage, like Thunder Wave. Shield Dust also prevents poisoning from Poison Touch unless the user of Poison Touch used Sunsteel Strike.\n\nOutside of battle\nShield Dust has no effect outside of battle."
    },
    "shields down": {
        "name": "Shields Down",
        "description": "When its HP becomes half or less, the Pokémon's shell breaks and it becomes aggressive.",
        "effect": "In battle\nAt the start of battle or at the end of a turn, if Minior's HP is above half, it will change into its Meteor Form. At the end of the turn, if its HP is below half, it will change back to its Core Form.\n\nWhile in Meteor Form, Minior cannot be afflicted by status conditions or become drowsy due to Yawn. Rest will fail when used by Minior in Meteor Form. If Core Form Minior is switched in while grounded (due to Iron Ball, Gravity, or being Baton Passed Ingrain), it will be poisoned by Toxic Spikes before Shields Down switches it to Meteor Form.\n\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability Shields Down. Skill Swap fails if either Pokémon has Shields Down. Shields Down cannot be copied by Trace, Power of Alchemy, or Receiver. Shields Down cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Minior obtains Shields Down with Imposter or Transform, the Pokémon will not change forms and will not be immune to status conditions (even if it transformed into Meteor Form Minior).\n\nMold Breaker, Turboblaze, and Teravolt have no effect on Shields Down. If a Pokémon with Poison Touch uses Sunsteel Strike on a Minior in Meteor Form, it will not be poisoned.\n\nIf Minior gets a status condition while in Core Form and later changes into Meteor Form, the status condition remains in effect.\n\nOutside of battle\nMinior is always in Core Form outside of battle."
    },
    "simple": {
        "name": "Simple",
        "description": "The stat changes the Pokémon receives are doubled.",
        "effect": "In battle\nGeneration IV\nSimple doubles the effectiveness of stat stages. For example, if Defense Curl is used, the screen will display that the user's Defense has increased by one stage and the game will store the user's Defense stage as +1, but the effect of that +1 stage will be equal to the effect of two regular stages and the user's Defense will be doubled during damage calculation. Similarly, if Tail Whip is used on this Pokémon, its Defense stat will fall one stage, but the effect will be treated as two.\n\nThe effect of stat stages cannot exceed their usual cap. For example, a Pokémon with Simple that has obtained +3 Defense stages will have quadrupled their Defense stat in damage calculation (the usual effect of +6 Defense); they can still continue to use a move like Defense Curl up to three more times to boost their Defense stage to +6, but these three additional stages will have no greater effect during damage calculation. The same applies to -3 Defense.\n\nBecause the stage numbers in-game have not changed, a Pokémon that uses Psych Up on a target with Simple only copies the stored (not doubled) stat stages. If a Pokémon uses Baton Pass to switch to a target with Simple, the target's passed stat stages will essentially gain double effect; if a Pokémon with Simple uses Baton Pass to a target without Simple, the target will not obtain any doubled stages. Similarly, if a Pokémon boosts its stats and then acquires Simple through a move like Skill Swap, its pre-existing effective stat changes will be doubled (barring caps) until it loses Simple.\n\nGeneration V\nSimple now directly doubles the number of stages that a stat is increased or decreased when the move, Ability, or item is used. For example, if Defense Curl is used, the screen will display that the user's Defense has increased by two stages (\"sharply rose\") and the game will store the user's Defense stage as +2, doubling the user's Defense as expected. Similarly, Tail Whip targeting a Pokémon with Simple will cause its Defense to directly drop by two stages.\n\nAs a result, moves like Defense Curl can only be used up to three times before they will fail (as the user's Defense stage will be the maximum of +6). If Psych Up is used on a target with Simple, the doubled stages will be copied. Using Baton Pass to a recipient with Simple will not cause the recipient to receive stat stages of double effect; if a Simple Pokémon uses Baton Pass itself, it will transfer the doubled stat stages. Similarly, if a Pokémon boosts its stats and then receives Simple through a move like Skill Swap, its pre-existing stat changes will not be doubled and nothing further will happen if it loses Simple.\n\nThe move Simple Beam can change the target Pokémon's Ability to Simple.\n\nGeneration VII\nStat stage increases caused by the Z-Power effects of status Z-Moves are not modified by Simple. However, the stat stage increases as a result of Extreme Evoboost and Clangorous Soulblaze are modified.\n\nOutside of battle\nSimple has no effect outside of battle."
    },
    "skill link": {
        "name": "Skill Link",
        "description": "Maximizes the number of times multi-strike moves hit.",
        "effect": "In battle\nGeneration IV\nSkill Link enables multi-strike moves that hit 2-5 times per use to always strike five times.\n\nGeneration V\nEven if the Ability is lost in the middle of move (such as via Mummy), the user will still hit the maximum number of times on the turn in progress.\n\nSkill Link now affects Triple Kick. When used by Pokémon with this Ability, there will be one accuracy check for all strikes instead of individual checks for each strike.\n\nOutside of battle\nSkill Link has no effect outside of battle."
    },
    "slow start": {
        "name": "Slow Start",
        "description": "For five turns, the Pokémon's Attack and Speed stats are halved.",
        "effect": "In battle\nSlow Start causes the Attack stat and Speed stat to be halved during the first five turns in battle. This counter is reset if the Pokémon is switched out.\n\nIf this Ability is replaced due to a move like Skill Swap or Worry Seed or suppressed by Gastro Acid, the Pokémon's stats return to normal.\n\nIn the Japanese version of Pokémon Diamond and Pearl, removing Slow Start does not undo the Attack and Speed drop; it must still wait five turns. This was changed in localized versions as well as in Pokémon Platinum.\n\nOutside of battle\nSlow Start has no effect outside of battle."
    },
    "slush rush": {
        "name": "Slush Rush",
        "description": "Boosts the Pokémon's Speed stat in a hailstorm.",
        "effect": "In battle\nDuring a hailstorm, the Speed stat of Pokémon with this Ability is doubled. Unlike Sand Rush, Snow Cloak, and Sand Veil, a Pokémon with this Ability will take damage from the hailstorm unless it is Ice-type.\n\nOutside of battle\nSlush Rush has no effect outside of battle."
    },
    "sniper": {
        "name": "Sniper",
        "description": "Powers up moves if they become critical hits when attacking.",
        "effect": "In battle\nCritical hits will do 1.5× the normal critical hit damage (i.e. 3× instead of 2× in Generation IV and Generation V, and 2.25× instead of 1.5× in Generation VI onwards).\n\nOutside of battle\nSniper has no effect outside of battle."
    },
    "snow cloak": {
        "name": "Snow Cloak",
        "description": "Boosts evasion in a hailstorm.",
        "effect": "In battle\nDuring hail, the accuracy of any move used against a Pokémon with this Ability is modified by a factor of 4/5. A Pokémon with this Ability will take no damage from hail if it otherwise would.\n\nOutside of battle\nIf a Pokémon with Snow Cloak is in the first place in the party (even if fainted) in an area with hail, the chance of encountering a wild Pokémon is decreased by 50%."
    },
    "snow warning": {
        "name": "Snow Warning",
        "description": "The Pokémon summons a hailstorm when it enters a battle.",
        "effect": "In battle\nGeneration IV-V\nSnow Warning summons a hailstorm in battle as soon as a Pokémon with Snow Warning enters the battle. Its effects are the same as Hail, but instead of lasting for five turns, it lasts for the whole battle until replaced. If a Pokémon with Snow Warning is sent out in the same turn as another Pokémon whose Ability affects the weather, the slower Pokémon's Ability will override the faster Ability.\n\nGeneration VI\nIn Generation VI, the hail will last only for five turns instead. This can be extended to eight turns if the Pokémon is holding an Icy Rock.\n\nIf heavy rain, extremely harsh sunlight, or a mysterious air current is present, Snow Warning will fail to activate.\n\nOutside of battle\nSnow Warning has no effect outside of battle."
    },
    "solar power": {
        "name": "Solar Power",
        "description": "Boosts the Sp. Atk stat in harsh sunlight, but HP decreases every turn.",
        "effect": "In battle\nDuring harsh sunlight, Solar Power increases the Pokémon's Special Attack by 1.5×, but the Pokémon loses 1/8 of its maximum HP at the end of each turn.\n\nOutside of battle\nSolar Power has no effect outside of battle."
    },
    "solid rock": {
        "name": "Solid Rock",
        "description": "Reduces the power of supereffective attacks taken.",
        "effect": "In battle\nSolid Rock reduces damage from supereffective moves by ¼ (regardless of the effectiveness multiplier).\n\nOutside of battle\nSolid Rock has no effect outside of battle."
    },
    "soul-heart": {
        "name": "Soul-Heart",
        "description": "Boosts its Sp. Atk stat every time a Pokémon faints.",
        "effect": "In battle\nSoul-Heart raises the user's Special Attack by one stage every time a Pokémon in the area faints.[1]\n\nOutside of battle\nSoul-Heart has no effect outside of battle."
    },
    "soundproof": {
        "name": "Soundproof",
        "description": "Soundproofing of the Pokémon itself gives full immunity to all sound-based moves.",
        "effect": "In battle\nGenerations III and IV\nSoundproof prevents all effects from sound-based moves, granting Pokémon with this Ability immunity from them.\n\nIn Pokémon FireRed and LeafGreen, a sleeping Pokémon with this Ability cannot be woken with a Poké Flute. From Generation III to IV, Pokémon with this Ability can still fall asleep during an uproar.\n\nGeneration V\nPokémon with Soundproof can now be affected by Heal Bell.\n\nGeneration VI onward\nPokémon with Soundproof again cannot be affected by Heal Bell.\n\nOutside of battle\nSoundproof has no effect outside of battle."
    },
    "speed boost": {
        "name": "Speed Boost",
        "description": "Its Speed stat is boosted every turn.",
        "effect": "In battle\nAt the end of each turn, Speed Boost raises the Speed stat of the Pokémon with this Ability by one stage.\n\nSpeed Boost will not activate on the turn the Pokémon with the Ability is switched in (even if it gains the Ability after switching in). It will activate if the Pokémon is switched in due to a previous Pokémon fainting.\n\nOutside of battle\nSpeed Boost has no effect outside of battle."
    },
    "stakeout": {
        "name": "Stakeout",
        "description": "Doubles the damage dealt to the target's replacement if the target switches out.",
        "effect": "In battle\nStakeout doubles the power of moves used against targets that have switched in this turn.\n\nOutside of battle\nStakeout has no effect outside of battle."
    },
    "stall": {
        "name": "Stall",
        "description": "The Pokémon moves after all other Pokémon do.",
        "effect": "In battle\nThe Pokémon with this Ability moves last in its priority bracket, regardless of its Speed and Trick Room.\n\nIf a Pokémon's held Quick Claw activates, Stall does not affect when the Pokémon moves.\n\nGeneration IV\nIf multiple Pokémon have the Ability Stall and use moves with the same priority, the Pokémon with the lower Speed will move first (regardless of Trick Room).\n\nA Pokémon with Stall moves before Pokémon holding a Lagging Tail or Full Incense. If a Pokémon with Stall also holds a Lagging Tail or Full Incense, Stall does not affect when the Pokémon moves.\n\nGeneration V onward\nIf multiple Pokémon with the Ability Stall or that are holding a Lagging Tail or Full Incense use moves with the same priority, the Pokémon move relatively according to Speed (the order is reversed during Trick Room).\n\nOutside of battle\nStall has no effect outside of battle."
    },
    "stamina": {
        "name": "Stamina",
        "description": "Boosts the Defense stat when hit by an attack.",
        "effect": "In battle\nWhen a Pokémon with Stamina is hit by an attack, its Defense rises by one stage.\n\nIf a Pokémon with this Ability is hit by a multi-strike move (such as Fury Swipes), each hit activates this Ability.\n\nOutside of battle\nStamina has no effect outside of battle."
    },
    "stance change": {
        "name": "Stance Change",
        "description": "The Pokémon changes its form to Blade Forme when it uses an attack move, and changes to Shield Forme when it uses King's Shield.",
        "effect": "In battle\nGeneration VI\nStance Change allows Aegislash to switch between its Shield Forme and Blade Forme. Aegislash is always in Shield Forme if it is not battling, and as such, switching out reverts it to Shield Forme.\n\nIf Shield Forme Aegislash uses a damaging move, it changes to Blade Forme immediately before using the move. If Blade Forme Aegislash uses King's Shield, it changes to Shield Forme immediately before using the move. Status moves other than King's Shield will not change its Forme. Moves that call other moves, such as Sleep Talk, will not change its Forme, even if they call a damaging move or King's Shield.\n\nIf Aegislash attempts to use a move, even if it cannot execute it due to an effect such as a status condition, confusion, or disobedience, Stance Change still activates accordingly.\n\nRole Play, Gastro Acid, Worry Seed, Simple Beam, and Entrainment fail if the target has the Ability Stance Change. Skill Swap fails if either Pokémon has Stance Change. Stance Change cannot be copied by Trace, Power of Alchemy, or Receiver. Stance Change cannot be replaced by Mummy or suppressed by Core Enforcer. If a Pokémon other than Aegislash obtains Stance Change with Imposter or Transform, the Pokémon will not change Formes.\n\nGeneration VII\nIf Aegislash attempts to use a move but cannot execute it due to an effect such as a status condition or confusion, Stance Change does not activate.\n\nOutside of battle\nStance Change has no effect outside of battle."
    },
    "static": {
        "name": "Static",
        "description": "The Pokémon is charged with static electricity, so contact with it may cause paralysis.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, there is a 30% chance that the attacking Pokémon will become paralyzed. This can affect Ground-type Pokémon.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact, each hit has an independent chance to activate this Ability.\n\nOutside of battle\nFrom Pokémon Emerald onward, if a Pokémon with Static is in the first place in the party (even if fainted), then there is a 50% chance the game will force an encounter with an Electric-type Pokémon, if one is possible."
    },
    "steadfast": {
        "name": "Steadfast",
        "description": "The Pokémon's determination boosts the Speed stat each time the Pokémon flinches.",
        "effect": "In battle\nSteadfast increases the user's Speed stat by one stage when flinched.\n\nOutside of battle\nSteadfast has no effect outside of battle."
    },
    "steelworker": {
        "name": "Steelworker",
        "description": "Powers up Steel-type moves.",
        "effect": "In battle\nSteelworker boosts the power of user's Steel-type moves by 50%.\n\nOutside of battle\nSteelworker has no effect outside of battle."
    },
    "stench": {
        "name": "Stench",
        "description": "By releasing stench when attacking, this Pokémon may cause the target to flinch.",
        "effect": "In battle\nGenerations III and IV\nStench has no effect in battle.\n\nGeneration V onward\nStench has a 10% chance of making the target flinch when hit by a damaging move. Stench does not stack with King's Rock or Razor Fang.\n\nOutside of battle\nIf a Pokémon with Stench is in the first place in the party (even if fainted), the chance of encountering a wild Pokémon is decreased by 50%. It shares this effect with Quick Feet and White Smoke.\n\nIn the Battle Pyramid, the encounter rate is decreased by 25%."
    },
    "sticky hold": {
        "name": "Sticky Hold",
        "description": "Items held by the Pokémon are stuck fast and cannot be removed by other Pokémon.",
        "effect": "In battle\nThis Ability prevents the held item of the Pokémon with this Ability from being taken by Covet, Thief, Pickpocket or Magician; eaten by Bug Bite or Pluck; destroyed by Incinerate; or removed by Knock Off. It also prevents the Pokémon from being affected by other Pokémon's Trick or Switcheroo (even if it has no held item), but not its own.\n\nSticky Hold does not prevent a Sticky Barb being transferred by its own effect.\n\nSticky Hold can be ignored by Mold Breaker, Turboblaze and Teravolt.\n\nGeneration III to IV\nEven if the Pokémon is knocked out by the attack, Sticky Hold protects the held item.\n\nGeneration V onward\nIf the Pokémon is knocked out by the attack, Sticky Hold does not protect the held item.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Sticky Hold is in the first place in the party (even if fainted), bites will occur more often while fishing. Suction Cups has the same effect."
    },
    "storm drain": {
        "name": "Storm Drain",
        "description": "Draws in all Water-type moves. Instead of being hit by Water-type moves, it boosts its Sp. Atk.",
        "effect": "In battle\nGeneration IV\nStorm Drain forces all single-target Water-type moves to strike the Pokémon with this Ability, including those used by allies. Water-type moves will never miss the Pokémon with this Ability, unless it is in the semi-invulnerable turn of a move such as Dive or Fly (Surf will never miss it if it is in the semi-invulnerable turn of Dive). Storm Drain can only redirect Dive on the turn Dive deals damage.\n\nStorm Drain cannot redirect Water-type Hidden Power, Judgment or Natural Gift.\n\nIf another Pokémon becomes the center of attention, Water-type moves will be directed to it instead of the Pokémon with Storm Drain.\n\nGeneration V and VI\nAlong with its previous effects, Storm Drain also gives the Pokémon immunity to all Water-type moves, and raises the Pokémon's Special Attack by one stage whenever it is hit by one. This effect will not activate if the Pokémon is protected from the Water-type move.\n\nStorm Drain can now redirect Water-type Hidden Power, Judgment and Natural Gift.\n\nIf a Pokémon with Storm Drain is holding an Absorb Bulb or Luminous Moss, Storm Drain absorbs the move so the item's effect is not triggered.\n\nIn Triple Battles, Storm Drain cannot redirect Water-type moves if the Pokémon is out of range.\n\nOutside of battle\nStorm Drain has no effect outside of battle."
    },
    "strong jaw": {
        "name": "Strong Jaw",
        "description": "The Pokémon's strong jaw boosts the power of its biting moves.",
        "effect": "In battle\nStrong Jaw increases the power of the Pokémon's biting moves by 50%.\n\nOutside of battle\nStrong Jaw has no effect outside of battle."
    },
    "sturdy": {
        "name": "Sturdy",
        "description": "It cannot be knocked out with one hit. One-hit KO moves cannot knock it out, either.",
        "effect": "In battle\nGenerations III and IV\nSturdy makes the Pokémon unaffected by one-hit knockout moves.\n\nGeneration V and on\nIn addition to Sturdy's previous effect, Sturdy now works like a Focus Sash, causing the Pokémon to have 1 HP remaining if another Pokémon's attack or confusion damage would have brought it from full health to 0 HP. Sturdy will activate as long as a Pokémon has full HP before the attack, and therefore it can activate multiple times if the Pokémon is brought back to full health, or if the Pokémon has a maximum of 1 HP.\n\nIf a Pokémon with Sturdy is holding a Focus Sash, Sturdy will activate first. A Pokémon with Mold Breaker will ignore Sturdy. When a multi-strike move hits a Pokémon with Sturdy, Sturdy's effect can only activate for hits while the user has full HP. Destiny Bond and Perish Song will not cause Sturdy to activate.\n\nOutside of battle\nSturdy has no effect outside of battle."
    },
    "suction cups": {
        "name": "Suction Cups",
        "description": "This Pokémon uses suction cups to stay in one spot to negate all moves and items that force switching out.",
        "effect": "In Battle\nThis Ability prevents other Pokémon from forcing the user to switch out or flee with a move (Roar, Whirlwind, Dragon Tail, or Circle Throw) or item (Red Card). Suction Cups does not affect the Pokémon switching out manually, or switching out or fleeing with its own move (Teleport, Baton Pass, etc.) or item (Eject Button).\n\nA Pokémon with the Ability Suction Cups cannot be forced to switch or flee, even if it is Ghost-type or holds a Smoke Ball or Shed Shell.\n\nIf a Pokémon with Suction Cups is under the effect of Ingrain, Suction Cups will take priority over Ingrain if it would be forced to switch or flee.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Suction Cups is in first place in the player's party (even if fainted), bites will occur more often while fishing. Sticky Hold has the same effect."
    },
    "super luck": {
        "name": "Super Luck",
        "description": "The Pokémon is so lucky that the critical-hit ratios of its moves are boosted.",
        "effect": "In battle\nSuper Luck increases the critical hit ratio by 1 stage.\n\nOutside of battle\nSuper Luck has no effect outside of battle."
    },
    "surge surfer": {
        "name": "Surge Surfer",
        "description": "Doubles the Pokémon's Speed stat on Electric Terrain.",
        "effect": "In battle\nWhen the battlefield is under the effects of Electric Terrain, Surge Surfer doubles the Speed of Pokémon with this Ability.\n\nOutside of battle\nSurge Surfer has no effect outside of battle."
    },
    "swarm": {
        "name": "Swarm",
        "description": "Powers up Bug-type moves when the Pokémon's HP is low.",
        "effect": "In battle\nGenerations III to IV\nWhen a Pokémon with Swarm uses a Bug-type move, the move's power will be increased by 50% if the user has less than or equal to ⅓ of its maximum HP remaining.\n\nGenerations V onwards\nInstead of boosting Bug-type moves' power, Swarm now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Bug-type move is being used, resulting in effectively the same effect.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with Swarm is in the first place in the party (even if fainted), the wild Pokémon encounter rate increases by 100%. It shares this trait with Illuminate and Arena Trap. In Pokémon Emerald, this Ability also increases the frequency that cries of wild Pokémon are heard in the overworld."
    },
    "sweet veil": {
        "name": "Sweet Veil",
        "description": "Prevents itself and ally Pokémon from falling asleep.",
        "effect": "In battle\nSweet Veil prevents the Pokémon with this Ability and its allies (including non-adjacent allies) from falling asleep. Rest will fail when used by the Pokémon with this Ability or an ally, unless it has Mold Breaker, Turboblaze or Teravolt.\n\nSweet Veil causes Yawn to fail if used on the Pokémon or its allies (including non-adjacent allies), and prevents the Pokémon and its allies already drowsy due to Yawn from falling asleep.\n\nWhen a Pokémon with Mold Breaker, Turboblaze or Teravolt uses a move, the effects of Sweet Veil (including allies') are ignored for the duration of that move. As such, if the move of a Pokémon with one of these Abilities triggers Effect Spore, it will not be protected by Sweet Veil.\n\nOutside of battle\nSweet Veil has no effect outside of battle."
    },
    "swift swim": {
        "name": "Swift Swim",
        "description": "Boosts the Pokémon's Speed stat in rain.",
        "effect": "In battle\nDuring rain, the Speed stat of Pokémon with this Ability is doubled.\n\nOutside of battle\nSwift Swim has no effect outside of battle."
    },
    "symbiosis": {
        "name": "Symbiosis",
        "description": "The Pokémon passes its item to an ally that has used up an item.",
        "effect": "In battle\nIf a Pokémon with Symbiosis has a held item, immediately after an ally's item is consumed, the Pokémon with Symbiosis will pass its item to that ally. Symbiosis may pass an item to a non-adjacent ally in a Triple Battle.\n\nSymbiosis triggers any time an ally Pokémon consumes its item, whether directly or through the use of Fling or Natural Gift. If a Pokémon eats another Pokémon's Berry with Bug Bite or Pluck and is not holding an item, its ally's Symbiosis will be triggered and give an item to the Pokémon that used that move. An Air Balloon popping will trigger Symbiosis. If multiple Pokémon on the same side of a Triple Battle or Horde Encounter have Symbiosis, then Symbiosis will trigger on the faster Pokémon (even while Trick Room is in effect).\n\nSymbiosis will not trigger if an ally's item is moved to a different Pokémon (such as due to Thief or Symbiosis itself), destroyed by Incinerate, or knocked off by Knock Off.\n\nIf a Gem was consumed in response to the start of a move and the item received through Symbiosis would normally affect the power of the triggering move, then the new item's effect will be applied immediately; however, if a Plate or Drive is given to a Pokémon using Judgment or Techno Blast after it has consumed a Gem, the move's type will not change. If a Gem was consumed in response to the start of a move and the item received through Symbiosis is another Gem, it will not also consume the new Gem. Otherwise, if a consumable item is received through Symbiosis and the Pokémon can currently consume it, it will use it immediately.\n\nIf a type-resist Berry is consumed in response to an attack, Symbiosis will not activate until after damage is received. If an item is consumed using Fling or Natural Gift, Symbiosis will not activate until after the move deals damage.\n\nSymbiosis cannot transfer a Z-Crystal. It cannot transfer a Griseous Orb if either Pokémon is Giratina, a Plate if either Pokémon is Arceus, a memory if either Pokémon is Silvally, a Drive if either Pokémon is Genesect, a Mega Stone if either Pokémon can Mega Evolve using it, a Blue Orb if either Pokémon is Kyogre, or a Red Orb if either Pokémon is Groudon.\n\nGeneration VI\nIn Generation VI, if an ally's Eject Button is consumed, Symbiosis will activate and transfer an item to that ally after it switches out but before its replacement is sent out. When this Pokémon is switched in again, the Pokémon's item will be affected by the Symbiosis Eject Button glitch, which causes certain items to apply their effect twice.\n\nGeneration VII\nThe Eject Button activating does not trigger Symbiosis.\n\nOutside of battle\nSymbiosis doesn't have a known effect outside of battle."
    },
    "synchronize": {
        "name": "Synchronize",
        "description": "The attacker will receive the same status condition if it inflicts a burn, poison, or paralysis to the Pokémon.",
        "effect": "In battle\nWhen a Pokémon with Synchronize is burned, paralyzed, or poisoned by another Pokémon, that Pokémon will be inflicted with the same status condition. Synchronize will not inflict sleep or freeze.\n\nEven if Synchronize would have no effect due to the other Pokémon already having a status condition or the other Pokémon's type, Ability, or team condition (e.g. Safeguard), it will still activate (revealing it as the Pokémon's Ability), but have no effect. Synchronize can affect a Pokémon behind a substitute. Synchronize can be activated by other Pokémon's Abilities, such as Static and Synchronize itself; it cannot be activated by the Toxic Orb or Flame Orb.\n\nIf a Pokémon with Synchronize has a Berry that cures the status condition it was just inflicted with, Synchronize will activate before the Berry is eaten.\n\nGeneration III to IV\nWhen a Pokémon with Synchronize is badly poisoned by another Pokémon, that Pokémon will be inflicted with the regular poison condition.\n\nIf Psycho Shift is used by a burned, paralyzed, or poisoned Pokémon targeting a Pokémon with Synchronize, Synchronize activates after Psycho Shift cures the user of its status condition. Therefore, Synchronize will inflict the status condition anew in such a case.\n\nToxic Spikes do not activate this Ability unless a Pokémon on the field directly causes a Pokémon with Synchronize to switch in, such as by using the moves Roar or Whirlwind.\n\nGeneration V and VI\nWhen a Pokémon with Synchronize is badly poisoned by another Pokémon, that Pokémon will now be inflicted with the bad poison condition, rather than the regular poison condition.\n\nIf Psycho Shift is used by a burned, paralyzed, poisoned, or badly poisoned Pokémon targeting a Pokémon with Synchronize, Synchronize now activates before Psycho Shift cures the user of its status condition. Therefore, Synchronize will fail to inflict the status condition anew in such a case.\n\nToxic Spikes do not activate this Ability, even if another Pokémon forced the Pokémon with this Ability to switch in by using a move like Roar or Dragon Tail.\n\nOutside of battle\nFrom Pokémon Emerald onward, if a Pokémon with Synchronize is in the first place in the party (even if fainted) when a wild Pokémon is encountered, there is a 50% chance that the game will force it to have the same Nature as the Pokémon with this Ability. This does not apply to roaming Pokémon, Pokémon in the Pokéwalker, or Pokémon in the Entree Forest. In Emerald, it also does not apply to stationary Pokémon (such as Regirock or Rayquaza).\n\nIn SOS Battles, Synchronize may take effect on subsequently called allies if a Pokémon with Synchronize moves to the first place in the party during the battle. Due to a bug, however, the called Pokémon will Synchronize to the Nature of the Pokémon that was originally in the first spot.\n\nStarting in Pokémon Omega Ruby and Alpha Sapphire, if a Pokémon with Synchronize is leading the party, gift Pokémon (except Pokémon obtained via Mystery Gift) that are in the Undiscovered Egg Group will always have the same Nature as the Pokémon with this Ability. Starting in Pokémon Ultra Sun and Ultra Moon, this applies regardless of the Pokémon's Egg Group; however, this does not apply to the Eevee Egg received at the Pokémon Nursery."
    },
    "tangled feet": {
        "name": "Tangled Feet",
        "description": "Raises evasion if the Pokémon is confused.",
        "effect": "In battle\nWhile a Pokémon with this Ability is confused, all moves used against it have their accuracy halved.\n\nOutside of battle\nTangled Feet has no effect outside of battle."
    },
    "tangling hair": {
        "name": "Tangling Hair",
        "description": "Contact with the Pokémon lowers the attacker's Speed stat.",
        "effect": "In battle\nWhen a Pokémon with this Ability is hit by a move that makes contact, the Speed of the attacking Pokémon is decreased by one stage.\n\nIf a Pokémon with this Ability is hit by a multi-strike move that makes contact (such as Fury Swipes), each hit activates this Ability.\n\nOutside of battle\nTangling Hair has no effect outside of battle."
    },
    "technician": {
        "name": "Technician",
        "description": "Powers up the Pokémon's weaker moves.",
        "effect": "In battle\nTechnician increases the power of moves which have a power of 60 or less by 50%.\n\nFor moves with variable power, Technician will only apply if the power is 60 or less when used. Thus, Pursuit will not get a Technician boost if the opposing Pokémon switches and Pursuit's power doubles to 80, and Low Kick and Grass Knot will only get a Technician boost if the target's weight is 110.0 lbs. (49.9 kg) or less. Similarly, if a move like Avalanche is used by a Pokémon previously damaged in the same turn, which doubles Avalanche's power to 120, then Technician will not be applied.\n\nThe effect does not apply to confusion damage, which remains at a power of 40.\n\nOutside of battle\nTechnician has no effect outside of battle."
    },
    "telepathy": {
        "name": "Telepathy",
        "description": "Anticipates an ally's attack and dodges it.",
        "effect": "In battle\nA Pokémon with Telepathy avoids damaging moves used by its allies. This includes attacks with multiple targets (such as Discharge), as well as attacks exclusively targeting an ally with Telepathy (such as Thunderbolt). However, it is not protected from its allies' status moves (such as Teeter Dance or Confuse Ray).\n\nWhen Telepathy prevents an attack from hitting, the message \"<name> avoids attacks by its ally Pokémon!\" will be displayed.\n\nOutside of battle\nTelepathy has no effect outside of battle."
    },
    "teravolt": {
        "name": "Teravolt",
        "description": "Moves can be used on the target regardless of its Abilities.",
        "effect": "In battle\nTeravolt ignores the effects of Abilities that could potentially affect the damage or effects of a move that its user executes. For example, a Pokémon with Teravolt can hit opponents that possess Levitate by using Earthquake. Teravolt applies regardless of target Pokémon, but only to moves executed by its user (so if two Pokemon in a Double Battle both know Earthquake, only the Pokémon with Teravolt can hit a Pokémon with Levitate).\n\nUnlike Gastro Acid, which completely negates a target's Ability, the opponents' Abilities otherwise remain in effect:\n\n- Abilities that prevent status conditions (such as Immunity and Oblivious) will not protect the Pokémon from receiving the status condition; however, many of these Abilities also have effects to cure the Pokémon of the status condition if afflicted, which are not negated by Teravolt.\n- If a Pokémon with Own Tempo consumes a held Berry that may cause confusion in response to the move of a Pokémon with Teravolt, it will become confused if it dislikes the flavor (although Own Tempo will then activate and cure it of confusion).\nTeravolt can ignore the Abilities of Pokémon other than the target; for example, if a Pokémon with Teravolt uses Thunder Wave on a Grass-type Pokémon whose ally has Flower Veil, the target will still be paralyzed.\n\nWhen a Pokémon with Teravolt uses a move, even the effects of allies' Abilities (notably Flower Gift, Sweet Veil, Aroma Veil and Flower Veil) are ignored for the duration of that move. As such, if the move of a Pokémon with Teravolt triggers an Ability (such as Gooey or Cursed Body) or item (such as Destiny Knot), the Pokémon with Teravolt will not be protected by its allies' Abilities; likewise, if a Destiny Knot held by a Pokémon with Teravolt is activated during the use of its own move (such as in response to the target's Cute Charm), that target will not be protected by its allies' Aroma Veil. This also means that a Pokémon with Teravolt will not gain Attack due to an ally's Flower Gift.\n\nIf a Pokémon with Teravolt forces a Pokémon to switch in with a move like Roar or Dragon Tail, Abilities that affect entry hazards will be ignored if possible; if forced to switch in this way:\n\n- Pokémon with Levitate will be affected by Spikes and Toxic Spikes, unless they are Flying-type or holding an Air Balloon.\n  - Poison-type Pokémon with Levitate can remove Toxic Spikes, if they are not Flying-type and not holding an Air Balloon.\n- Pokémon with Immunity will be poisoned by Toxic Spikes (although Immunity will then activate and cure them of poison).\n- Pokémon with Leaf Guard will be poisoned by Toxic Spikes even during harsh sunlight.\n- Pokémon with Simple, Contrary, Clear Body or White Smoke will have their Speed lowered one stage by Sticky Web.\n- Grass-type Pokémon that have or have an ally with Flower Veil will be poisoned by Toxic Spikes, and will have their Speed lowered one stage by Sticky Web.\nFrom Generation VI onward, a Pokémon with Overcoat will be affected by powder and spore moves as well.\n\nWhen a Pokémon with Teravolt is brought out, the message \"<name> is radiating a bursting aura!\" will be displayed.\n\nOutside of battle\nTeravolt has no effect outside of battle."
    },
    "thick fat": {
        "name": "Thick Fat",
        "description": "The Pokémon is protected by a layer of thick fat, which halves the damage taken from Fire- and Ice-type moves.",
        "effect": "In battle\nIf a Pokémon with Thick Fat is attacked by an Ice- or Fire-type move, the opponent's Attack or Special Attack is reduced by 50% during damage calculation, effectively halving the damage the Pokémon takes.\n\nOutside of battle\nThick Fat has no effect outside of battle."
    },
    "tinted lens": {
        "name": "Tinted Lens",
        "description": "The Pokémon can use \"not very effective\" moves to deal regular damage.",
        "effect": "In battle\nTinted Lens doubles the damage done by any moves that the Pokémon uses which are \"not very effective\". This effect is independent of whether the type effectiveness is ½× or less.\n\nOutside of battle\nTinted Lens has no effect outside of battle."
    },
    "torrent": {
        "name": "Torrent",
        "description": "Powers up Water-type moves when the Pokémon's HP is low.",
        "effect": "In battle\nGenerations III to IV\nWhen a Pokémon with Torrent uses a Water-type move, the move's power will be increased by 50% if the user has less than or equal to ⅓ of its maximum HP remaining.\n\nGenerations V onwards\nInstead of boosting Water-type moves' power, Torrent now technically boosts the Pokémon's Attack or Special Attack by 50% during damage calculation if a Water-type move is being used, resulting in effectively the same effect.\n\nOutside of battle\nTorrent has no effect outside of battle."
    },
    "tough claws": {
        "name": "Tough Claws",
        "description": "Powers up moves that make direct contact.",
        "effect": "In battle\nTough Claws boosts the power of the Pokémon's contact moves by 30%.\n\nOutside of battle\nTough Claws has no effect outside of battle."
    },
    "toxic boost": {
        "name": "Toxic Boost",
        "description": "Powers up physical attacks when the Pokémon is poisoned.",
        "effect": "In battle\nWhile the Pokémon with this Ability is poisoned, the power of its physical moves is increased by 50%.\n\nOutside of battle\nToxic Boost has no effect outside of battle."
    },
    "trace": {
        "name": "Trace",
        "description": "When it enters a battle, the Pokémon copies an opposing Pokémon's Ability.",
        "effect": "In battle\nTrace changes into the Ability of a random adjacent opponent.\n\nTrace can copy Wonder Guard. Trace can be swapped by Skill Swap.\n\nGeneration III\nWhen a Pokémon with Trace enters battle, it copies a random opponent's Ability (replacing itself). It can copy any Ability, but if it copies Trace, it will not activate again.\n\nTrace can be copied by Role Play.\n\nGeneration IV\nWhile a Pokémon with Trace is in battle, if at any time an opponent has an Ability that can be copied by Trace, Trace will activate and replace itself with that Ability. Trace can only activate once while a Pokémon is on the field; even if the Pokémon gains Trace again (e.g. via Skill Swap) after activating it the first time, Trace cannot activate until after it is switched out.\n\nIn a Double Battle with only one opponent remaining, if a Pokémon with Trace is sent into battle to replace a fainted Pokémon, Trace has a 50% chance to select the non-present opponent and not activate. Once a Pokémon takes its turn (uses a move, switches out, etc.), Trace will activate and copy the Ability of the opponent that is present.\n\nTrace cannot copy Trace, Forecast, or Multitype.\n\nTrace can be copied by Role Play.\n\nGeneration V\nWhen a Pokémon with Trace enters battle, it copies a random adjacent opponent's Ability (replacing itself). If no opponents have Abilities that can be copied by Trace when the Pokémon with Trace enters battle, Trace cannot be activated until it enters battle again.\n\nTrace cannot copy Trace, Forecast, Flower Gift, Multitype, Illusion, or Zen Mode.\n\nTrace cannot be copied by Role Play. Entrainment will fail if used by a Pokémon with Trace.\n\nGeneration VI onward\nWhile a Pokémon with Trace is in battle, if at any time an adjacent opponent has an Ability that can be copied by Trace, Trace will activate and replace itself with that Ability. After activating Trace, if a Pokémon gains Trace again (e.g. via Skill Swap), Trace will activate at the first opportunity.\n\nTrace cannot copy Trace, Forecast, Flower Gift, Multitype, Illusion, Zen Mode, Imposter, Stance Change, Power of Alchemy, Receiver, Schooling, Comatose, Shields Down, Disguise, RKS System, Battle Bond or Power Construct.\n\nTrace cannot be copied by Role Play, Power of Alchemy, or Receiver. Entrainment will fail if used by a Pokémon with Trace.\n\nOutside of battle\nTrace has no effect outside of battle."
    },
    "triage": {
        "name": "Triage",
        "description": "Gives priority to a healing move.",
        "effect": "In battle\nTriage increases the priority of moves that restore HP used by the Pokémon with this Ability by 3, including both damaging moves and status moves. Triage does not affect Aqua Ring, Grassy Terrain, Ingrain, Leech Seed, Pain Split, Present, Pollen Puff, or Z-Moves that only heal due to their Z-Power effect (such as Z-Conversion 2).\n\nOutside of battle\nTriage has no effect outside of battle."
    },
    "truant": {
        "name": "Truant",
        "description": "The Pokémon can't use a move the following turn if it uses one.",
        "effect": "In battle\nEvery second turn, a Pokémon with Truant cannot use a move due to loafing around, such that the Pokémon can move on its first turn but not its second turn. Switching out or gaining the Ability Truant resets the turn count for Truant. Using an item does not count as a turn for the purposes of Truant. Truant is reset by sleep and a Pokémon with Truant will always be able to attack on the turn they wake up.\n\nMoves with a charging turn, such as Fly, will not work (unless the user is holding a Power Herb), because the turn in which the move would be executed is the same turn in which the Pokémon will be truant. If the Pokémon uses a move that requires recharging, such as Hyper Beam, then the Pokémon will loaf around due to Truant during the turn that would normally be used recharging; however, the Pokémon would still recharge as such and thus would not be able to use items, switch out etc.\n\nIf a Pokémon gains Truant after it Mega Evolves but before it moves, Truant will activate on its first attempt to move.\n\nTruant cannot be replaced with Simple Beam, Worry Seed, or Entrainment.\n\nOutside of battle\nTruant has no effect outside of battle."
    },
    "turboblaze": {
        "name": "Turboblaze",
        "description": "Moves can be used on the target regardless of its Abilities.",
        "effect": "In battle\nTurboblaze ignores the effects of Abilities that could potentially affect the damage or effects of a move that its user executes. For example, a Pokémon with Turboblaze can hit opponents that possess Levitate by using Earthquake. Turboblaze applies regardless of target Pokémon, but only to moves executed by its user (so if two Pokemon in a Double Battle both know Earthquake, only the Pokémon with Turboblaze can hit a Pokémon with Levitate).\n\nUnlike Gastro Acid, which completely negates a target's Ability, the opponents' Abilities otherwise remain in effect:\n\n- Abilities that prevent status conditions (such as Immunity and Oblivious) will not protect the Pokémon from receiving the status condition; however, many of these Abilities also have effects to cure the Pokémon of the status condition if afflicted, which are not negated by Turboblaze.\n- If a Pokémon with Own Tempo consumes a held Berry that may cause confusion in response to the move of a Pokémon with Turboblaze, it will become confused if it dislikes the flavor (although Own Tempo will then activate and cure it of confusion).\nTurboblaze can ignore the Abilities of Pokémon other than the target; for example, if a Pokémon with Turboblaze uses Thunder Wave on a Grass-type Pokémon whose ally has Flower Veil, the target will still be paralyzed.\n\nWhen a Pokémon with Turboblaze uses a move, even the effects of allies' Abilities (notably Flower Gift, Sweet Veil, Aroma Veil and Flower Veil) are ignored for the duration of that move. As such, if the move of a Pokémon with Turboblaze triggers an Ability (such as Gooey or Cursed Body) or item (such as Destiny Knot), the Pokémon with Turboblaze will not be protected by its allies' Abilities; likewise, if a Destiny Knot held by a Pokémon with Turboblaze is activated during the use of its own move (such as in response to the target's Cute Charm), that target will not be protected by its allies' Aroma Veil. This also means that a Pokémon with Turboblaze will not gain Attack due to an ally's Flower Gift.\n\nIf a Pokémon with Turboblaze forces a Pokémon to switch in with a move like Roar or Dragon Tail, Abilities that affect entry hazards will be ignored if possible; if forced to switch in this way:\n\n- Pokémon with Levitate will be affected by Spikes and Toxic Spikes, unless they are Flying-type or holding an Air Balloon.\n  - Poison-type Pokémon with Levitate can remove Toxic Spikes, if they are not Flying-type and not holding an Air Balloon.\n- Pokémon with Immunity will be poisoned by Toxic Spikes (although Immunity will then activate and cure them of poison).\n- Pokémon with Leaf Guard will be poisoned by Toxic Spikes even during harsh sunlight.\n- Pokémon with Simple, Contrary, Clear Body or White Smoke will have their Speed lowered one stage by Sticky Web.\n- Grass-type Pokémon that have or have an ally with Flower Veil will be poisoned by Toxic Spikes, and will have their Speed lowered one stage by Sticky Web.\nFrom Generation VI onward, a Pokémon with Overcoat will be affected by powder and spore moves as well.\n\nWhen a Pokémon with Turboblaze is brought out, the message \"<name> is radiating a blazing aura!\" will be displayed.\n\nOutside of battle\nTurboblaze has no effect outside of battle."
    },
    "unaware": {
        "name": "Unaware",
        "description": "When attacking, the Pokémon ignores the target Pokémon's stat changes.",
        "effect": "In battle\nIf a Pokémon with this Ability uses a damaging move or is targeted by a damaging move, the other Pokémon's stat stages are ignored during damage and accuracy calculation.\n\nSpecifically, when a Pokémon with this Ability uses a damaging move, the evasion stat stages of the targets are ignored during accuracy calculation, and the Defense and Special Defense stat stages of the targets are ignored during damage calculation; when a Pokémon with this Ability is targeted by a damaging move, the accuracy stat stages of the attacking Pokémon are ignored during accuracy calculation, and the Attack and Special Attack stat stages of the attacking Pokémon are ignored during damage calculation.\n\nUnaware will not prevent the moves Gyro Ball, Electro Ball, Stored Power, Punishment, and Power Trip from factoring in the stat changes that determine their power. This Ability has no effect on a Pokémon hurting itself in confusion.\n\nOutside of battle\nUnaware has no effect outside of battle."
    },
    "unburden": {
        "name": "Unburden",
        "description": "Boosts the Speed stat if the Pokémon's held item is used or lost.",
        "effect": "In battle\nUnburden doubles the Pokémon's Speed stat when the Pokémon's held item is lost. If there is no held item to begin with or if a held item is traded for another, Unburden will not be activated. This boost is lost if the Pokémon is switched out or gains a held item.\n\nOutside of battle\nUnburden has no effect outside of battle."
    },
    "unnerve": {
        "name": "Unnerve",
        "description": "Unnerves opposing Pokémon and makes them unable to eat Berries.",
        "effect": "In battle\nGeneration V\nUnnerve causes opposing Pokémon to be unable to eat their own held Berries.\n\nGeneration VII\nWild Pokémon are more likely to call for help when facing a Pokémon with Unnerve. It shares this effect with Intimidate and Pressure.\n\nOutside of battle\nUnnerve has no effect outside of battle."
    },
    "victory star": {
        "name": "Victory Star",
        "description": "Boosts the accuracy of its allies and itself.",
        "effect": "In battle\nVictory Star increases the accuracy of moves used by the Pokémon with this Ability and its allies in battle by 10% of their original accuracy.\n\nOutside of battle\nVictory Star has no effect outside of battle."
    },
    "vital spirit": {
        "name": "Vital Spirit",
        "description": "The Pokémon is full of vitality, and that prevents it from falling asleep.",
        "effect": "In battle\nVital Spirit prevents the Pokémon from being afflicted by sleep and Yawn. Rest will fail when used by the Pokémon.\n\nA Pokémon with this Ability will wake up if it is asleep in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is put to sleep by a Pokémon with an Ability like Mold Breaker).\n\nIf a Pokémon with this Ability is drowsy due to Yawn, when it would fall asleep the Ability activates and keeps it awake.\n\nGeneration III\nIf a sleeping Pokémon with Vital Spirit is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Vital Spirit due to Trace, it will not be cured of sleep until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of sleep if it is switched in to replace a switched out Pokémon.\n\nIf a sleeping Pokémon has Vital Spirit as its original Ability but not its current Ability, it will remain asleep when switched out.\n\nIf the Pokémon with this Ability is asleep and is holding a Chesto or Lum Berry, Vital Spirit will cure the Pokémon of sleep before the Berry has a chance to be consumed.\n\nGeneration IV\nWhen a sleeping Pokémon with Vital Spirit enters battle, it will be cured of sleep.\n\nIf a sleeping Pokémon has Vital Spirit as its original Ability but not its current Ability, if it is one of the active Pokémon at the end of the battle or switched out, it will be cured of sleep (with no message).\n\nGeneration V onward\nIf a sleeping Pokémon has Vital Spirit as its original Ability but not its current Ability, it will remain asleep when switched out.\n\nIf the Pokémon with this Ability is asleep and is holding a Chesto or Lum Berry, the Berry will be eaten and cure the Pokémon of sleep before Vital Spirit has a chance to activate.\n\nOutside of battle\nIf a sleeping Pokémon gains Vital Spirit by evolution or the Ability Capsule, it will not wake up until sent into battle. Pokémon with Vital Spirit will not be put to sleep by the Gentleman's Kirlia in the Battle Pike nor the Battle Arcade's game board.\n\nFrom Pokémon Emerald onwards, if a Pokémon with Vital Spirit is in the first place in the party (even if fainted), the chance of encountering a high-leveled wild Pokémon increases by 50% (so an otherwise 25% chance would become 75%). It shares this effect with Hustle and Pressure.\n\nIn Generation V, Vital Spirit also prevented a Pokémon from visiting the Dream World before it was shut down."
    },
    "volt absorb": {
        "name": "Volt Absorb",
        "description": "Restores HP if hit by an Electric-type move, instead of taking damage.",
        "effect": "In battle\nGeneration III\nWhen a Pokémon with Volt Absorb is hit by a damaging Electric-type move, its HP is restored by one quarter of its maximum HP, and the move will have no effect on that Pokémon (if a Pokémon with this Ability already has full HP, the Electric-type move will do nothing).\n\nVolt Absorb will not activate if the Pokémon is protected from the Electric-type move.\n\nGeneration IV onward\nVolt Absorb will now activate when a Pokémon with it is hit by an Electric-type status move.\n\nIf a Pokémon with Volt Absorb is holding a Cell Battery, Volt Absorb absorbs the move, so the Cell Battery's effect is not triggered.\n\nOutside of battle"
    },
    "water absorb": {
        "name": "Water Absorb",
        "description": "Restores HP if hit by a Water-type move, instead of taking damage.",
        "effect": "In battle\nWhen a Pokémon with Water Absorb is hit by a Water-type move, its HP is restored by one quarter of its maximum HP, and the move will have no effect on that Pokémon (if a Pokémon with this Ability already has full HP, the Water-type move will do nothing).\n\nWater Absorb will not activate if the Pokémon is protected from the Water-type move.\n\nIf a Pokémon with Water Absorb is holding an Absorb Bulb or Luminous Moss, Water Absorb absorbs the move, so the item's effect is not triggered.\n\nOutside of battle\nWater Absorb has no effect outside of battle."
    },
    "water bubble": {
        "name": "Water Bubble",
        "description": "Lowers the power of Fire-type moves done to the Pokémon and prevents the Pokémon from getting a burn.",
        "effect": "In battle\nWater Bubble halves the damage dealt to the Pokémon with this Ability by Fire-type attacks and doubles the power of Water-type moves used by the Pokémon with this Ability.\n\nIt also prevents the Pokémon with the Ability from being burned. A Pokémon with Water Bubble will be cured of burn if it is burned while in battle (such as if it gains the Ability by an effect like Skill Swap, or is burned by a Pokémon with an Ability like Mold Breaker).\n\nOutside of battle\nWater Bubble has no effect outside of battle."
    },
    "water compaction": {
        "name": "Water Compaction",
        "description": "Boosts the Pokémon's Defense stat sharply when hit by a Water-type move",
        "effect": "In battle\nWhen a Pokémon with Water Compaction is hit by a Water-type move, its Defense rises by two stages. It will activate for every hit of Water Shuriken.\n\nOutside of battle\nIt is unknown if Water Compaction has any effect outside of battle."
    },
    "water veil": {
        "name": "Water Veil",
        "description": "The Pokémon is covered with a water veil, which prevents the Pokémon from getting a burn.",
        "effect": "In battle\nWater Veil prevents the Pokémon from being burned.\n\nA Pokémon with this Ability will be cured of burn if it is burned while in battle (such as if it gains the Ability outside of battle or by an effect like Skill Swap, or is burned by a Pokémon with an Ability like Mold Breaker).\n\nGeneration III\nIf a burned Pokémon has Water Veil as its original Ability but not its current Ability, it will remain burned when switched out.\n\nIf a burned Pokémon with Water Veil is sent into battle as one of the lead Pokémon or to replace a fainted Pokémon, or gains Water Veil due to Trace, it will not be cured of burn until after a Pokémon takes its turn (uses a move, switches out, etc.). It will be cured of burn if it is switched in to replace a switched out Pokémon.\n\nIf the Pokémon with this Ability is burned and is holding a Rawst, Lum, or Yago Berry, Water Veil will cure the Pokémon of burn before the Berry has a chance to be consumed.\n\nGeneration IV\nIf a burned Pokémon has Water Veil as its original Ability but not its current Ability, then if it is one of the active Pokémon at the end of the battle or if it is switched out, it will be cured of burn (with no message). Thus, there is no way for a burned Pokémon with Water Veil to enter battle.\n\nGeneration V onward\nIf a burned Pokémon has Water Veil as its original Ability but not its current Ability, it will remain burned when switched out.\n\nIf the Pokémon with this Ability is burned and is holding a Rawst or Lum Berry, the Berry will be eaten and cure the Pokémon of burn before Water Veil has a chance to activate.\n\nOutside of battle\nIf a burned Pokémon gains Water Veil by evolution or the Ability Capsule, it will not be cured of burn until sent into battle. Pokémon with Water Veil will not be burned by the Gentleman's Kirlia or Dusclops in the Battle Pike nor the Battle Arcade's game board."
    },
    "weak armor": {
        "name": "Weak Armor",
        "description": "Physical attacks to the Pokémon lower its Defense stat but sharply raise its Speed stat.",
        "effect": "In battle\nGeneration V-VI\nWhen a Pokémon with this Ability is hit by a physical move, its Defense is decreased by one stage and its Speed is increased by one stage.\n\nIf a Pokémon with this Ability is hit by a physical multi-strike move (such as Fury Swipes), each hit activates this Ability.\n\nGeneration VII\nWeak Armor now raises Speed by two stages.\n\nOutside of battle\nWeak Armor has no effect outside of battle."
    },
    "white smoke": {
        "name": "White Smoke",
        "description": "The Pokémon is protected by its white smoke, which prevents other Pokémon from lowering its stats.",
        "effect": "In battle\nWhite Smoke prevents stat reduction caused by other Pokémon's moves and Abilities (such as Scary Face and Intimidate), including Sticky Web. White Smoke does not prevent self-inflicted stat reductions such as from moves like Superpower or Hammer Arm.\n\nWhite Smoke only protects from effects that lower stat stages, so it does not prevent stat reduction from items like the Iron Ball, the status conditions paralysis or burn, or the moves Guard Split or Power Split. White Smoke does not prevent stat stages being directly modified by Heart Swap, Guard Swap, Power Swap, Baton Pass, or Topsy-Turvy.\n\nThis Ability is ignored by Pokémon with Mold Breaker, Teravolt, and Turboblaze.\n\nOutside of battle\nFrom Pokémon Emerald onwards, if a Pokémon with White Smoke is in the first place in the party (even if fainted), the chance of encountering a wild Pokémon is decreased by 50%. It shares this effect with Quick Feet and Stench."
    },
    "wimp out": {
        "name": "Wimp Out",
        "description": "The Pokémon cowardly switches out when its HP becomes half or less.",
        "effect": "In battle\nWhen a Pokémon with Wimp Out drops below half of its full HP in battle, it will flee in wild battles, or switch out in Trainer battles. It can only activate when a Pokémon's HP falls from above half to below half; if it does not activate at that time, it will not activate at all (unless the Pokémon with this Ability restores HP).\n\nWimp Out will not activate if the Pokémon's HP falls below half due to hurting itself in confusion, hail, sandstorm or using Substitute. This Ability will not activate if the HP of the Pokémon with this Ability is restored to above half immediately after it drops below half (such as due to a held Sitrus Berry).\n\nWimp Out will not activate if the Pokémon's HP falls below half by a move affected by Sheer Force.\n\nIt will activate only after the last hit of multi-strike moves, even if the HP of the Pokémon with this Ability drops below half before the last hit. If this Ability activates due to being hit by U-turn or Volt Switch, the user of that move will not be switched out. This Ability also will not activate if the Pokémon's HP falls below half while it is in the air during the semi-invulnerable turn of Sky Drop.\n\nTrapping moves do not prevent Wimp Out from activating.\n\nIf the Pokémon with Wimp Out holds a Red Card or Eject Button, the item activates first. Dragon Tail and Circle Throw switch out Pokémon before the Ability activates.\n\nWimp Out will not activate on the player's Pokémon in wild battles during trials.\n\nOutside of battle\nWimp Out has no effect outside of battle."
    },
    "wonder guard": {
        "name": "Wonder Guard",
        "description": "Its mysterious power only lets supereffective moves hit the Pokémon.\n",
        "effect": "In battle\nWonder Guard makes the user immune to damaging moves that are not super effective.\n\nIt does not prevent confusion damage. It does not affect status moves, such as Tail Whip or Poison Powder. It does not prevent any indirect damage, such as from burn, weather, recoil, and entry hazards.\n\nWonder Guard does not affect Struggle. Prior to Generation V, Wonder Guard does not affect Beat Up, Future Sight, or Doom Desire. In Generation IV only, Wonder Guard does not affect Fire Fang, due to a presumed glitch.\n\nRole Play fails if the target has the Ability Wonder Guard. Skill Swap fails if either Pokémon has Wonder Guard. Wonder Guard cannot be copied by Power of Alchemy or Receiver. Wonder Guard can be bypassed by a Pokémon with Mold Breaker, Teravolt, or Turboblaze. It can also be bypassed by the moves Moongeist Beam and Sunsteel Strike.\n\nOutside of battle\nWonder Guard has no effect outside of battle."
    },
    "wonder skin": {
        "name": "Wonder Skin",
        "description": "Makes status moves more likely to miss.",
        "effect": "In battle\nWonder Skin changes the accuracy of status moves used against the Pokémon with this Ability to 50%. Other effects may still be able to modify the accuracy after Wonder Skin's effect.\n\nWonder Skin does not affect moves used by Pokémon with Mold Breaker, Teravolt, or Turboblaze.\n\nOutside of battle\nWonder Skin has no effect outside of battle."
    },
    "zen mode": {
        "name": "Zen Mode",
        "description": "Changes the Pokémon's shape when HP is half or less.",
        "effect": "Generation VI\nParental Bond causes most damaging moves used by the Pokémon to become two-strike moves, with the second attack being half as strong as the first. It does not affect multi-strike moves.\n\nIf a move could hit multiple targets (including allies), such as Earthquake and Rock Slide, it will not strike twice; however, if it can only hit a single Pokémon, such as in a Single Battle or if using a move that can hit multiple targets when only one target is in range, it will strike twice. If a move could hit multiple Pokémon but only hits one due to missing the other Pokémon, it will only strike once.\n\nAny attack which has a secondary effect (except Secret Power) has the same secondary effect on both strikes (such as Power-Up Punch), including effects that do not always trigger. If the Pokémon's Ability is changed to Mummy after the first strike, it will continue to make a second strike regardless. Since Parental Bond turns moves into two-hit multi-strike moves, each strike has a separate chance to be a critical hit, items and Abilities that trigger upon strike or contact such as Cursed Body and Rocky Helmet occur for each strike, and Spiky Shield and King's Shield only damage and decrease Attack (respectively) once if a Pokémon with Parental Bond uses a contact move against a Pokémon that has used one of them.\n\nUnlike other secondary effects, Secret Power's secondary effect can only occur after the second hit. If a move has recoil damage, the recoil will be based on the damage dealt by both strikes, but will be taken after the second strike; Struggle will inflict recoil damage equal to half the user's maximum HP (after the second strike). Circle Throw and Dragon Tail will strike twice, but only force the opponent to switch out once after both strikes are dealt. U-turn and Volt Switch strike twice, then the user switches out. Bug Bite and Pluck consume the target's Berry after the second strike, so if the target could eat its Berry due to low HP after the first strike, it will.\n\nMoves that require the user to recharge after use like Hyper Beam strike twice, and the user only needs to recharge for one turn. Smelling Salts, Wake-Up Slap and Knock Off do not cure the target of paralysis or sleep or remove the target's held item (respectively), until after the second strike, so both strikes get the increased power. Fire-type moves, Scald and Steam Eruption thaw a frozen target after the second strike (so a frozen target cannot be thawed and then burned by the same move). If Meloetta has Parental Bond and uses Relic Song, it will change Forme only once, after the second strike.\n\nIf Present heals the target it will only strike once, but if it damages the target it will strike twice (the second strike will always damage the target). Fixed-damage moves such as Seismic Toss and Dragon Rage deal the full amount of damage for both strikes. The damage dealt by Psywave is generated separately for each strike, and the second strike's damage is not halved. Each strike of Super Fang halves the target's HP (effectively quartering it if HP is not restored between strikes). Counter, Mirror Coat, Metal Burst and Bide deal the full amount of damage for both strikes. The first strike of Assurance counts as previously taking damage for the second strike, giving it increased power. Grass Pledge, Fire Pledge, and Water Pledge strike twice, even when used as a combination move. Natural Gift and Spit Up strike twice.\n\nFling, Self-Destruct, Explosion, and Final Gambit only strike once. Moves with a charging turn (such as Fly and Solar Beam) only strike once, even if the Pokémon becomes fully charged in one turn (such as with a Power Herb). Endeavor also only strikes once, even if the user or target's HP is changed after it strikes (such as by Iron Barbs or the Sitrus Berry). Confusion damage only occurs once.\n\nEven though the Ability makes the Pokémon strike twice, there is only one accuracy check for the strike. This means if the first strike misses there will be no second strike, and if the first strike does not miss, then the second is guaranteed to strike.\n\nGeneration VII\nThe second strike's damage was reduced, now dealing 25% of the damage of the first strike.\n\nParental Bond does not affect Z-Moves.\n\nOutside of battle\nParental Bond has no effect outside of battle."
    }
}
